% 이 파일은 MMIXware의 mmix-doc.w((c) 1999 Donald E. Knuth)를 한글 GWEB로
% 옮긴 것으로, MMIXware 꾸러미의 일부가 아니다.
@i ../boilerplate.w

\input kotexgweb
\input luamplib.sty
\def\title{MMIX}

\font\logo=logo10

\def\NNIX{\hbox{\mc NNIX}}
\def\beginword{\vcenter\bgroup\let\\=\wordrule\halign\bgroup&\hfil##\hfil\cr}
\def\endword{\noalign{\vskip\baselineskip}\egroup\egroup
   \advance\belowdisplayskip-\baselineskip}
\def\wordrule{\vrule height 9.5pt depth 4.5pt width .4pt}
\newdimen\bitwd \bitwd=6.6pt
\def\field#1#2{\vrule depth 3pt width 0pt \hbox to#1\bitwd{\hss$#2$\hss}}

\def\XF{\\{XF}}\def\XM{\\{XM}}\def\XD{\\{XD}} % 이것들은 \tt가 아니다
\def\PC{\\{PC}}
\def\Jx{\.{J}} % 거꾸로, J_를 치면 \tt의 J가 된다

\def\s{{\rm s}}
\def\rX{{\rm\$X}} \def\rY{{\rm\$Y}} \def\rZ{{\rm\$Z}}
\def\mm{{\rm M}} \def\xx{{\rm X}} \def\yy{{\rm Y}} \def\zz{{\rm Z}}
\def\ll{L} \def\gg{G}
\def\?{\mkern-1mu}

\def\LL{\mathbin{<\!\!<}} % \.{CWEB}의 매크로
\def\AM{\&} % \.{CWEB}의 매크로
\def\9#1{} % @@:sort key}{entry@@>로 찾아보기의 정렬 열쇠를 줄 때 쓴다

@* MMIX 소개.
\.{MIX} 컴퓨터가 설계된 지 서른여덟 해가 지났다. 그동안 컴퓨터 아키텍처는 꽤 다른 모양의
기계로 모여 왔다. 그러니 이제 \.{MIX}를, 선배보다 포화 지방이 더 적은 새 컴퓨터로 바꿀 때가
되었다.

{\sl Fundamental Algorithms\/} 제3판의 연습 문제 1.3.1--25는 MixMaster라는 확장된 \.{MIX}를
다루는데, 이것은 옛 판과 위쪽으로 호환된다. 그러나 MixMaster 자체가 어쩔 도리 없이 낡았다.
메모리를 몇 기가바이트나 쓸 수 있는데도, {\mc ASCII} 코드로 소문자조차 쓸 수 없다. 게다가
아이고, \.{MIX}의 표준 서브루틴 호출 관례는 되돌릴 수 없게 자기 수정 코드에 바탕을 두고 있다!
십진 산술과 자기 수정 코드는 1962년에 인기가 있었지만, 기계가 더 크고 빨라지면서 확실히 금세
사라졌다. Hennessy와 Patterson이 {\sl Computer Architecture\/}(Morgan Kaufmann, 1996)에서
설명한 RISC 아키텍처의 원리에 바탕을 둔, 완전히 새로운 설계가 필요하다.
% 초판은 "Morgan Kaufman"이었지만 이제는 "nn"이 맞다
@^Hennessy, John LeRoy@>
@^Patterson, David Andrew@>

그래서 여기 \MMIX가 있다. {\sl The Art of Computer Programming\/} 제1--3권의 ``궁극''판과 나머지
권들의 초판에서 \.{MIX}를 완전히 대신할 컴퓨터다. 크누스는 이런 컴퓨터를 하나 가질 날이 몹시
기다려진다고 고백한다.

\MMIX는 어떻게 읽을까? 크누스는 혼자 ``엠믹스''라고 읽어 왔다. 첫 `\.M'이 새 천 년(millennium)을
나타내기 때문이다. 그래서 영어로 쓸 때는 ``an \MMIX\ simulator''처럼 이름 \MMIX\ 앞에 관사
``a'' 대신 ``an''을 쓴다.

덧붙여, {\sl Dictionary of American Regional English\/ \bf3}(1996)에는 ``mommix''가 명사와
동사로 두루 쓰이는 흔한 방언 낱말로 실려 있다. 무언가를 mommix한다는 것은 그것을 망쳐 놓는다,
엉망으로 만든다는 뜻이다. 크누스가 \MMIX의 정의를 mommix했는지는 시간만이 말해 줄 것이다.

보충: 이 문서는 크누스의 \.{mmix-doc.w}를 옮긴 것이다. 원본처럼 코드는 없고 \MMIX\ 기계의
정의만 담았다. 원본은 그림 하나를 따로 그린 \.{mmix.1} 파일로 넣었는데, 여기서는 그 그림을
조판하는 동안 {\logo METAPOST}로 바로 그린다. 이 문서의 절 번호는 원본의 절 번호와 같다. 다른 모듈의
문서가 ``\.{mmix-doc}의 몇 절''이라고 가리키면 이 문서의 같은 절을 보면 된다.

@ 원래의 \.{MIX} 컴퓨터는 운영체제 없이 돌릴 수 있었다. 천공 카드나 종이 테이프로 부트스트랩해서
모든 것을 스스로 할 수 있었다. 그러나 오늘날 그런 힘은 더 이상 보통 사용자의 손에 있지 않다.
\MMIX\ 하드웨어는 오늘날 만드는 다른 모든 계산 기계처럼, 작업들을 저마다의 주소 공간에서
시작시키고 입출력 기능을 제공하는 일을 운영체제에 기댄다.

누가 크누스에게 운영체제에 관해 쓸 생각이 있느냐고 물을 때마다 그의 대답은 늘 ``Nix''(안
한다)였다. 그러니 \MMIX의 운영체제 이름이 \NNIX라는 것은 놀랍지 않을 것이다.
@:NNIX}{\NNIX\ operating system@>
@^operating system@>
이따금 \NNIX가 사용자를 위해 하는 일을 언급할 수밖에 없겠지만, 크누스가 \NNIX를 직접 만들
수는 없다. 인생은 너무 짧다. 운영체제 설계의 어떤 전문가가 영감을 받아서, \MMIX\ 칩을 위한
멋지고 깔끔한 \NNIX\ 커널을 어떻게 만드는지 정확히 설명하는 책을 써 준다면 참 좋겠다.

@ 크누스는 \MMIX의 동작을 다듬도록 도와준 많은 사람에게 깊이 감사한다. 특히 John Hennessy와
(무엇보다) Dick Sites가 중요한 기여를 했다.
@^Hennessy, John LeRoy@>
@^Sites, Richard Lee@>

@ 프로그래머를 위한 \MMIX\ 입문은 ``제1권, 분책~1''에 있다. 이것은 결국 {\sl The Art of
@^Fascicle 1@>
Computer Programming\/} 제4판에 들어갈 길잡이 내용을 담은 소책자다. 다음 절들의 설명은 그것과
꽤 다르다. 여기서는 운영체제가 쓰고 보통 프로그램에는 보이지 않는 기능을 모두 포함한 완전한
구현에 관심을 두기 때문이다. 여기서는 길잡이에서 대충 넘어간 예외적인 경우를 강조하고, 잘못될
수 있는 일에 관한 시시콜콜한 세부까지 따지는 것이 중요하다.

@* MMIX의 기초.
\MMIX는 범용 레지스터가 적어도 256개 있고 주소 공간이 64비트인 64비트 RISC 기계다. 명령은
모두 네 바이트 길이이고 다음 꼴을 가진다.
$$\vcenter{\offinterlineskip
 \def\\#1&{\omit&#1&}
 \hrule
 \halign{&\vrule#&\hbox to 4em{\tt\hfil#\hfil}\cr
 height 9pt depth4pt&OP&&X&&Y&&Z&\cr}
 \hrule}\,.$$
가능한 OP 코드 256개는 기억하기 쉬운 열두어 가지 범주로 나뉜다. 명령은 대개 ``레지스터 X를
@^OP codes@>
Y~OP~Z의 결과로 정하라''는 뜻이다. 이를테면
$$\vcenter{\offinterlineskip
 \def\\#1&{\omit&#1&}
 \hrule
 \halign{&\vrule#&\hbox to 4em{\tt\hfil#\hfil}\cr
 height 9pt depth4pt&32&&1&&2&&3&\cr}
 \hrule}$$
는 레지스터~1을 레지스터 2와 3의 합으로 정한다. 몇몇 명령은 Y와 Z 바이트를 합쳐 16비트 YZ
필드로 쓰고, 점프 명령 가운데 둘은 24비트 XYZ 필드를 쓴다. 그러나 대개 세 바이트 X, Y, Z는
서로 독립인 세 갈래의 뜻을 가진다.

명령은 대개 \MMIX\ 어셈블리 언어에 해당하는 기호 꼴로 나타내는데, 그 언어에서는 연산 코드마다
기억하기 쉬운 이름이 있다. 이를테면 연산~32는 \.{ADD}이고, 위의 명령은 `\.{ADD}
\.{\$1,\$2,\$3}'이라고 쓸 수 있다. 달러 기호 `\.\$'는 레지스터 번호를 나타낸다. 일반적으로
명령 \.{ADD}~\.{\$X,\$Y,\$Z}는 $\rX=\rY+\rZ$로 정하는 연산이다. 쉼표가 둘인 어셈블리 언어
명령에는 피연산자 필드 X, Y,~Z가 셋 있다. 쉼표가 하나인 명령에는 피연산자 필드 X,~YZ가 둘 있다.
쉼표가 없는 명령에는 피연산자 필드 XYZ가 하나 있다. 피연산자가 없는 명령은 $\xx=\yy=\zz=0$이다.

\def\0{\$Z\char'174Z}
대부분의 명령에는 두 꼴이 있다. 하나는 Z 필드가 레지스터 \$Z를 나타내는 꼴이고, 다른 하나는
Z가 부호 없는 ``즉시'' 상수인 꼴이다. 이를테면 명령 `\.{ADD} \.{\$X,\$Y,\$Z}'에는 짝이 되는
@^immediate operands@>
`\.{ADD} \.{\$X,\$Y,Z}'가 있는데, 이것은 $\rX=\rY+\zz$로 정한다. 즉시 상수는 늘 음이 아니다.
아래의 설명에서는 그런 명령 쌍을 소개할 때 두 경우를 모두 적지 않고 그냥
`\.{ADD}~\.{\$X,\$Y,\0}'라고 쓴다.

명령 \.{ADD}~\.{\$X,\$Y,\$Z}의 연산 코드는 32이지만, 명령 \.{ADD}~\.{\$X,\$Y,Z}의 연산 코드는~33이다.
\MMIX\ 어셈블러는 셋째 인자가 레지스터 번호인지 아닌지를 보고 알맞은 코드를 고른다.

레지스터 번호와 상수에는 기호 이름을 붙일 수 있다. 이를테면 어셈블리 언어 명령
`\.x~\.{IS}~\.{\$1}'은 \.x를 레지스터 번호~1의 약칭으로 만든다. 마찬가지로
`\.{FIVE}~\.{IS}~\.5'는 \.{FIVE}를 상수~5의 약칭으로 만든다. 이런 약칭을 정한 뒤에는 명령
\.{ADD}~\.{x,x,FIVE}가 연산 코드~33을 써서 \$1을 5만큼 늘리고, 명령 \.{ADD}~\.{x,x,x}는 연산
코드~32를 써서 \$1을 두 배로 만든다. 레지스터 번호를 나타내는 기호 이름은 관례상 소문자로
시작하고, 상수를 나타내는 이름은 관례상 대문자로 시작한다. 어셈블러가 이 관례를 실제로 강요하지는
않지만, 이 관례는 프로그래머의 혼란을 줄여 준다.

@ {\it 니블\/}({\it nybble\/})은 4비트짜리 양으로, 흔히 십진 숫자나 십육진 숫자를 나타내는 데 쓴다.
{\it 바이트\/}({\it byte\/})는 8비트짜리 양으로, 흔히 {\mc ASCII} 코드의 영숫자 문자를 나타내는 데 쓴다.
유니코드 표준은 {\it 와이드\/}({\it wyde\/})라고 부르는 16비트 폭의 문자를 써서 {\mc ASCII}를 사실상
@^Unicode@>
@^ASCII@>
세계의 모든 언어로 넓힌다. (체중에 신경 쓰는 사람이라면 알겠지만, 니블(nibble, 조금씩 먹기)
둘이면 바이트(bite, 한 입)가 되고, 바이트 둘이면 와이드(wide, 넓적함)가 된다.) 아래의 논의에서는
4바이트짜리 양을 {\it 테트라바이트\/}({\it tetrabyte\/}) 또는 ``테트라''라고 부르고, 비슷하게 8바이트짜리 양을
@^nybble@>
@^byte@>
@^wyde@>
@^tetrabyte@>
@^octabyte@>
{\it 옥타바이트\/}({\it octabyte\/}) 또는 ``옥타''라고 부른다. 따라서 테트라는 와이드 둘이고, 옥타는 테트라 둘이다.
옥타바이트는 64~비트다. \MMIX\ 레지스터 하나에는 옥타바이트 하나, 또는 테트라 둘, 또는 와이드
넷, 또는 바이트 여덟, 또는 니블 열여섯이 들어 있다고 생각할 수 있다.

바이트, 와이드, 테트라, 옥타가 수를 나타낼 때는 {\it 부호 있는\/} 수이거나 {\it 부호 없는\/}
수라고 말한다. 부호 없는 바이트는 0 이상 $2^8-1=255$ 이하의 수다. 마찬가지로 부호 없는 와이드는
0과 $2^{16}-1=65535$ 사이에 있고, 부호 없는 테트라는 0과 $2^{32}-1=4{,}294{,}967{,}295$ 사이에
있고, 부호 없는 옥타는 0과 $2^{64}-1=18{,}446{,}744{,}073{,}709{,}551{,}615$ 사이에 있다. 부호
있는 쪽은 2의 보수 표기의 관례를 따라서, 가장 큰 쪽 비트에 각각 $2^8$, $2^{16}$, $2^{32}$,
$2^{64}$를 곱한 것을 뺀다. 따라서 부호 없는 바이트 128부터 255까지는 부호 있는 바이트로 셈할 때
수 $-128$부터~$-1$까지로 여긴다. 그러므로 부호 있는 바이트는 $-128$ 이상 $+127$ 이하다. 부호
있는 와이드는 $-32768$과 $+32767$ 사이의 수이고, 부호 있는 테트라는 $-2{,}147{,}483{,}648$과
$+2{,}147{,}483{,}647$ 사이에 있고, 부호 있는 옥타는 $-9{,}223{,}372{,}036{,}854{,}775{,}808$과
$+9{,}223{,}372{,}036{,}854{,}775{,}807$ 사이에 있다.

\MMIX의 가상 메모리는 $2^{64}$바이트짜리 배열 M이다. 임의의 부호 없는 옥타바이트~$k$에 대해
M[$k$]는 1바이트짜리 양이다. \MMIX\ 기계에 실제로 그렇게 거대한 메모리가 있지는 않지만,
프로그래머는 $2^{64}$바이트가 정말 있는 것처럼 행동할 수 있다. \MMIX가 주소 변환 방식을 제공해서
운영체제가 이 환상을 유지할 수 있기 때문이다.

기호 $\mm_{2^t}[k]$는 위치~$k\land\nobreak(2^{64}-2^t)$에서 시작하는 연이은 $2^t$~바이트로
이루어진 수를 나타낸다. (표기 $k\land(2^{64}-2^t)$는 $k$의 가장 작은 쪽 $t$비트를~0으로 만들고,
@^bit stuffing@>
그렇게 얻은 주소의 가장 작은 쪽 64~비트만 남긴다는 뜻이다. 마찬가지로 표기 $k\lor(2^t-1)$은
$k$의 가장 작은 쪽 $t$비트를~1로 만든다는 뜻이다.) \MMIX가 $2^t$바이트짜리 양에 접근하는 것은
모두 {\it 정렬되어\/} 있다. 첫 바이트의 위치가 $2^t$의 배수라는 뜻이다.

주소 지정은 늘 ``큰 쪽 먼저''(big-endian)다. 다시 말해 $\mm_{2^t}[k]$의 가장 큰 쪽(가장 왼쪽)
@^big-endian versus little-endian@>
@^little-endian versus big-endian@>
바이트는 $\mm_1[k\land\nobreak(2^{64}-2^t)]$이고, 가장 작은 쪽(가장 오른쪽) 바이트는
$\mm_1[k\lor(2^t-1)]$이다. 이 $2^t$바이트짜리 수를 {\it 부호 있는\/} 정수로 여기고 싶을 때는
표기 $\s(\mm_{2^t}[k])$를 쓴다. 형식적으로 말하면, $l=2^t$일 때
@^signed integers@>
$$\s(\mm_l[k])=\bigl(\mm_1[k\land(-l)]\,\mm_1[k\land(-l)+1]\,\ldots\,
 \mm_1[k\lor(l-1)]\bigr)_{256}
-2^{8l}[\mm_1[k\land(-l)]\!\ge\!128]$$
이다.

@* 적재와 저장.
메모리의 정보를 레지스터로 가져오는 데 쓸 수 있는 명령이 몇 가지 있다. 이를테면 ``부호 없는
테트라 적재'' 명령 \.{LDTU} \.{\$1,\$4,\$5}는 네 바이트 $\mm_4[\$4+\$5]$를 부호 없는 정수로서
레지스터~1에 넣는다. 레지스터~1의 가장 큰 쪽 네 바이트는 0이 된다. 비슷한 명령 \.{LDT}
\.{\$1,\$4,\$5}, 곧 ``테트라 적재''는 \$1을 {\it 부호 있는\/} 정수 $\s(\mm_4[\$4+\$5])$로 정한다.
(명령들은 연산 코드가 특별히 부호 없다고 하지 않으면 대개 수를 부호 있는 것으로 다룬다.) 부호
@^signed integers@>
있는 경우에 레지스터의 가장 큰 쪽 네 바이트는 적재한 테트라바이트의 가장 큰 쪽 비트의 복사본이
된다. 그래서 수가 $\ge0$인지 $<0$인지에 따라 모두~0이거나 모두~1이 된다.

\def\bull{\smallbreak\textindent{$\bullet$}}
\def\bul{\par\textindent{$\bullet$}}
\def\<#1 #2 {\.{#1}~\.{#2} }
\def\>{\hfill\break}

보충: 명령마다 원본의 영어 이름을 그대로 두고 괄호 안에 우리말 뜻을 붙였다. 연산 코드의 기억하기
쉬운 이름이 그 영어 이름에서 왔기 때문이다.

\bull\<LDB \$X,\$Y,\0 `바이트 적재'.\>
@.LDB@>
바이트 $\s(\mm[\rY+\rZ])$나 $\s(\mm[\rY+\zz])$를 $-128$ 이상 $+127$ 이하의 부호 있는 수로서
레지스터~X에 적재한다.

\bull\<LDBU \$X,\$Y,\0 `부호 없는 바이트 적재'.\>
@.LDBU@>
바이트 $\mm[\rY+\rZ]$나 $\mm[\rY+\zz]$를 $0$ 이상 $255$ 이하의 부호 없는 수로서 레지스터~X에
적재한다.

\bull\<LDW \$X,\$Y,\0 `와이드 적재'.\>
@.LDW@>
바이트들 $\s(\mm_2[\rY+\rZ])$나 $\s(\mm_2[\rY+\zz])$를 $-32768$ 이상 $+32767$ 이하의 부호 있는
수로서 레지스터~X에 적재한다. 앞에서 말했듯이 우리의 표기 $\mm_2[k]$는 주소 $\rY+\rZ$나 $\rY+\zz$의
가장 작은 쪽 비트를 무시하고~0으로 여긴다는 뜻을 담고 있다.
@^bit stuffing@>

\bull\<LDWU \$X,\$Y,\0 `부호 없는 와이드 적재'.\>
@.LDWU@>
바이트들 $\mm_2[\rY+\rZ]$나 $\mm_2[\rY+\zz]$를 $0$ 이상 $65535$ 이하의 부호 없는 수로서
레지스터~X에 적재한다.

\bull\<LDT \$X,\$Y,\0 `테트라 적재'.\>
@.LDT@>
바이트들 $\s(\mm_4[\rY+\rZ])$나 $\s(\mm_4[\rY+\zz])$를 $-2{,}147{,}483{,}648$ 이상
$+2{,}147{,}483{,}647$ 이하의 부호 있는 수로서 레지스터~X에 적재한다. 앞에서 말했듯이 우리의 표기
$\mm_4[k]$는 주소 $\rY+\rZ$나 $\rY+\zz$의 가장 작은 쪽 두 비트를 무시하고~0으로 여긴다는 뜻을
담고 있다.
@^bit stuffing@>

\bull\<LDTU \$X,\$Y,\0 `부호 없는 테트라 적재'.\>
@.LDTU@>
바이트들 $\mm_4[\rY+\rZ]$나 $\mm_4[\rY+\zz]$를 0 이상 4{,}294{,}967{,}296 이하의 부호 없는 수로서
레지스터~X에 적재한다. 보충: 원본에 이렇게 적혀 있지만, 부호 없는 테트라의 가장 큰 값은
$2^{32}-1=4{,}294{,}967{,}295$다.

\bull\<LDO \$X,\$Y,\0 `옥타 적재'.\>
@.LDO@>
바이트들 $\mm_8[\rY+\rZ]$나 $\mm_8[\rY+\zz]$를 레지스터~X에 적재한다. 앞에서 말했듯이 우리의 표기
$\mm_8[k]$는 주소 $\rY+\rZ$나 $\rY+\zz$의 가장 작은 쪽 세 비트를 무시하고~0으로 여긴다는 뜻을
담고 있다.
@^bit stuffing@>

\bull\<LDOU \$X,\$Y,\0 `부호 없는 옥타 적재'.\>
@.LDOU@>
바이트들 $\mm_8[\rY+\rZ]$나 $\mm_8[\rY+\zz]$를 레지스터~X에 적재한다. 사실 \.{LDOU}와~\.{LDO}의
동작에는 아무 차이도 없다. 옥타바이트는 부호 있는 것으로도, 부호 없는 것으로도 볼 수 있기
때문이다. 명령 \.{LDOU}는 그저 완전함과 일관성을 위해 \MMIX에 들어 있다. 어리석은 일관성은
좁은 마음의 도깨비라는 말이 있는데도 말이다.
@^Emerson, Ralph Waldo@>
(Niklaus Wirth는 System/360을 일찍이 비판하면서 그런 일관성을 강하게 호소했다. {\sl JACM\/
\bf15}(1967), 37--74를 보라.)
@^Wirth, Niklaus Emil@>
@^System/360@>

\bull\<LDHT \$X,\$Y,\0 `윗 테트라 적재'.\>
@.LDHT@>
바이트들 $\mm_4[\rY+\rZ]$나 $\mm_4[\rY+\zz]$를 레지스터~X의 가장 큰 쪽 절반에 적재하고, 가장
작은 쪽 절반은 0으로 지운다. (``윗 테트라 산술''의 쓰임새 하나는 테트라바이트를 더하거나 뺄 때
넘침을 쉽게 알아내는 것이다.)

\bull\<LDA \$X,\$Y,\0 `주소 적재'.\>
주소 $\rY+\rZ$나 $\rY+\zz$를 레지스터~X에 적재한다. 이 명령은 아래에서 다루는 \.{ADDU} 명령의
다른 이름일 뿐이다. 프로그래머가 수가 아니라 메모리 주소를 생각하고 있을 때 쓸 수 있다.
\MMIX\ 어셈블러는 \.{LDA}를 \.{ADDU}와 같은 OP 코드로 바꾼다.
@.LDA@>
@.ADDU@>

@ 다른 한 무리의 명령은 반대 방향으로 가서 레지스터를 메모리에 저장한다. 이를테면 ``즉시 옥타
저장'' 명령 \<STO \$3,\$2,17 은 레지스터~3의 현재 내용을 $\mm_8[\$2+17]$에 넣는다.

\bull\<STB \$X,\$Y,\0 `바이트 저장'.\>
@.STB@>
레지스터~X의 가장 작은 쪽 바이트를 바이트 $\mm[\rY+\rZ]$나 $\mm[\rY+\zz]$에 저장한다.
레지스터 \$X가 $-128$과 $+127$ 사이에 있지 않으면 정수 넘침 예외가 일어난다. (넘침과 다른 종류의 예외는 나중에
@^overflow@>
다룬다.)

\bull\<STBU \$X,\$Y,\0 `부호 없는 바이트 저장'.\>
@.STBU@>
레지스터~X의 가장 작은 쪽 바이트를 바이트 $\mm[\rY+\rZ]$나 $\mm[\rY+\zz]$에 저장한다. 명령
\.{STBU}는 넘침을 검사하지 않는다는 것 말고는 \.{STB}와 같다.

\bull\<STW \$X,\$Y,\0 `와이드 저장'.\>
@.STW@>
레지스터~X의 가장 작은 쪽 두 바이트를 바이트들 $\mm_2[\rY+\rZ]$나 $\mm_2[\rY+\zz]$에 저장한다.
레지스터 \$X가 $-32768$과 $+32767$ 사이에 있지 않으면 정수 넘침 예외가 일어난다.

\bull\<STWU \$X,\$Y,\0 `부호 없는 와이드 저장'.\>
@.STWU@>
레지스터~X의 가장 작은 쪽 두 바이트를 바이트들 $\mm_2[\rY+\rZ]$나 $\mm_2[\rY+\zz]$에 저장한다.
명령 \.{STWU}는 넘침을 검사하지 않는다는 것 말고는 \.{STW}와 같다.

\bull\<STT \$X,\$Y,\0 `테트라 저장'.\>
@.STT@>
레지스터~X의 가장 작은 쪽 네 바이트를 바이트들 $\mm_4[\rY+\rZ]$나 $\mm_4[\rY+\zz]$에 저장한다.
레지스터 \$X가 $-2{,}147{,}483{,}648$과 $+2{,}147{,}483{,}647$ 사이에 있지 않으면 정수 넘침 예외가
일어난다.

\bull\<STTU \$X,\$Y,\0 `부호 없는 테트라 저장'.\>
@.STTU@>
레지스터~X의 가장 작은 쪽 네 바이트를 바이트들 $\mm_4[\rY+\rZ]$나 $\mm_4[\rY+\zz]$에 저장한다.
명령 \.{STTU}는 넘침을 검사하지 않는다는 것 말고는 \.{STT}와 같다.

\bull\<STO \$X,\$Y,\0 `옥타 저장'.\>
@.STO@>
레지스터~X를 바이트들 $\mm_8[\rY+\rZ]$나 $\mm_8[\rY+\zz]$에 저장한다.

\bull\<STOU \$X,\$Y,\0 `부호 없는 옥타 저장'.\>
@.STOU@>
명령 \.{STO} \.{\$X,\$Y,\0}와 똑같다.

\bull\<STCO X,\$Y,\0 `상수 옥타바이트 저장'.\>
@.STCO@>
값이 부호 없는 바이트 X인 옥타바이트를 $\mm_8[\rY+\rZ]$나 $\mm_8[\rY+\zz]$에 저장한다.

\bull\<STHT \$X,\$Y,\0 `윗 테트라 저장'.\>
레지스터~X의 가장 큰 쪽 네 바이트를 $\mm_4[\rY+\rZ]$나 $\mm_4[\rY+\zz]$에 저장한다.
@.STHT@>

@* 더하기와 빼기.
수가 레지스터에 들어오면 그것으로 계산할 수 있다. 먼저 덧셈과 뺄셈을 생각해 보자.

\bull\<ADD \$X,\$Y,\0 `더하기'.\>
@.ADD@>
합 $\rY+\rZ$나 $\rY+\zz$를 부호 있는 2의 보수 산술로 레지스터~X에 넣는다. 합이 $\ge2^{63}$이거나
$<-2^{63}$이면 정수 넘침 예외가 일어난다. (넘침과 다른 종류의 예외는 나중에 다룬다.)
@^overflow@>

\bull\<ADDU \$X,\$Y,\0 `부호 없는 더하기'.\>
@.ADDU@>
합 $(\rY+\rZ)\bmod2^{64}$나 $(\rY+\zz)\bmod2^{64}$를 레지스터~X에 넣는다. 이 명령들은 넘침을
검사하지 않는다는 것 말고는 \.{ADD}~\.{\$X,\$Y,\0} 명령과 같다. (원한다면 덧셈 뒤에 명령
\<CMPU ovflo,\$X,\$Y 를 써서 넘침을 알아낼 수 있다. 여기서 \.{CMPU}는 ``부호 없는 비교''를
@.CMPU@>
뜻한다. 아래를 보라.)

\bull\<2ADDU \$X,\$Y,\0 `2를 곱해 부호 없이 더하기'.\>
@.2ADDU@>
합 $(2\rY+\rZ)\bmod2^{64}$나 $(2\rY+\zz)\bmod2^{64}$를 레지스터~X에 넣는다.

\bull\<4ADDU \$X,\$Y,\0 `4를 곱해 부호 없이 더하기'.\>
@.4ADDU@>
합 $(4\rY+\rZ)\bmod2^{64}$나 $(4\rY+\zz)\bmod2^{64}$를 레지스터~X에 넣는다.

\bull\<8ADDU \$X,\$Y,\0 `8을 곱해 부호 없이 더하기'.\>
@.8ADDU@>
합 $(8\rY+\rZ)\bmod2^{64}$나 $(8\rY+\zz)\bmod2^{64}$를 레지스터~X에 넣는다.

\bull\<16ADDU \$X,\$Y,\0 `16을 곱해 부호 없이 더하기'.\>
@.16ADDU@>
합 $(16\rY+\rZ)\bmod2^{64}$나 $(16\rY+\zz)\bmod2^{64}$를 레지스터~X에 넣는다.

\bull\<SUB \$X,\$Y,\0 `빼기'.\>
@.SUB@>
차 $\rY-\rZ$나 $\rY-\zz$를 부호 있는 2의 보수 산술로 레지스터~X에 넣는다. 차가 $\ge2^{63}$이거나
$<-2^{63}$이면 정수 넘침 예외가 일어난다.

\bull\<SUBU \$X,\$Y,\0 `부호 없는 빼기'.\>
@.SUBU@>
차 $(\rY-\rZ)\bmod2^{64}$나 $(\rY-\zz)\bmod2^{64}$를 레지스터~X에 넣는다. 이 두 명령은 넘침을
검사하지 않는다는 것 말고는 \.{SUB}~\.{\$X,\$Y,\0}와 같다.

\bull\<NEG \$X,Y,\0 `부호 바꾸기'.\>
@.NEG@>
값 $\yy-\rZ$나 $\yy-\zz$를 부호 있는 2의 보수 산술로 레지스터~X에 넣는다. 결과가
$2^{63}-\nobreak1$보다 크면 정수 넘침 예외가 일어난다. (이 경우에 \MMIX는 레지스터~Y가 아니라
``즉시'' 상수~Y로 일한다는 데 주목하라. 명령 \.{NEG}는 다른 명령의 즉시 변형과 닮았다. 한 바이트
상수를 레지스터에 넣어야 하는 수고를 덜어 주기 때문이다. 상수가 $\yy=0$일 때 넘침은 $\rZ=-2^{63}$일
때, 그리고 그때에만 일어난다. 명령 \<NEG \$X,1,2 는 \.{NEG}~\.{\$X,0,1}과 효과가 똑같다.)

\bull\<NEGU \$X,Y,\0 `부호 없이 부호 바꾸기'.\>
@.NEGU@>
값 $(\yy-\rZ)\bmod2^{64}$나 $(\yy-\zz)\bmod2^{64}$를 레지스터~X에 넣는다. 명령 \.{NEGU}는 넘침을
검사하지 않는다는 것 말고는 \.{NEG}와 같다.

@* 비트 주무르기.
더하기와 빼기보다 오래 걸리는 곱하기와 나누기를 보기 전에, \MMIX가 빨리 할 수 있는 다른 일
몇 가지를 보자. 부호 없는 수에 대한 비트 단위 논리 연산 명령이 열여덟 개 있다.

\bull\<AND \$X,\$Y,\0 `비트 단위 논리곱'.\>
@.AND@>
레지스터~Y의 각 비트를 레지스터~Z나 상수~Z의 해당 비트와 논리곱하고, 그 결과를 레지스터~X에
넣는다. 다시 말해 레지스터~X의 비트는 피연산자들의 해당 비트가 둘 다~1일 때, 그리고 그때에만~1이
된다. 기호로 쓰면 $\rX=\rY\land\rZ$나 $\rX=\rY\land\zz$다. 특히 이것은 명령 \<AND \$X,\$Y,Z 가 늘
레지스터~X의 가장 큰 쪽 일곱 바이트를 0으로 만든다는 뜻이다. 상수 바이트~Z의 앞에 0들이 붙기
때문이다.

\bull\<OR \$X,\$Y,\0 `비트 단위 논리합'.\>
@.OR@>
레지스터~Y의 각 비트를 레지스터~Z나 상수~Z의 해당 비트와 논리합하고, 그 결과를 레지스터~X에
넣는다. 다시 말해 레지스터~X의 비트는 피연산자들의 해당 비트가 둘 다~0일 때, 그리고 그때에만~0이
된다. 기호로 쓰면 $\rX=\rY\lor\rZ$나 $\rX=\rY\lor\zz$다.

특별한 경우 $\zz=0$이면, 이 명령의 즉시 변형은 레지스터~Y를 레지스터~X에 그냥 복사한다. \MMIX\
어셈블러는 `\.{OR}~\.{\$X,\$Y,0}'의 편리한 약칭으로 `\.{SET}~\.{\$X,\$Y}'라고 쓰게 해 준다.
@.SET@>

\bull\<XOR \$X,\$Y,\0 `비트 단위 배타적 논리합'.\>
@.XOR@>
레지스터~Y의 각 비트를 레지스터~Z나 상수~Z의 해당 비트와 배타적 논리합하고, 그 결과를
레지스터~X에 넣는다. 다시 말해 레지스터~X의 비트는 피연산자들의 해당 비트가 같을 때, 그리고
그때에만~0이 된다. 기호로 쓰면 $\rX=\rY\oplus\rZ$나 $\rX=\rY\oplus\zz$다.

\bull\<ANDN \$X,\$Y,\0 `비트 단위 논리곱 부정'.\>
@.ANDN@>
레지스터~Y의 각 비트를 레지스터~Z나 상수~Z의 해당 비트의 보수와 논리곱하고, 그 결과를
레지스터~X에 넣는다. 다시 말해 레지스터~X의 비트는 레지스터~Y의 해당 비트가~1이고 다른 해당
비트가~0일 때, 그리고 그때에만~1이 된다. 기호로 쓰면 $\rX=\rY\setminus\rZ$나 $\rX=\rY\setminus\zz$다.
(이것은 {\it 논리 차\/} 연산이다. 피연산자가 집합을 나타내는 비트열이면, 한 집합에는 있지만 다른
집합에는 없는 원소들을 계산하는 것이다.)

\bull\<ORN \$X,\$Y,\0 `비트 단위 논리합 부정'.\>
@.ORN@>
레지스터~Y의 각 비트를 레지스터~Z나 상수~Z의 해당 비트의 보수와 논리합하고, 그 결과를
레지스터~X에 넣는다. 다시 말해 레지스터~X의 비트는 레지스터~Y의 해당 비트가 다른 해당 비트보다
크거나 같을 때, 그리고 그때에만~1이 된다. 기호로 쓰면 $\rX=\rY\lor\overline\rZ$나
$\rX=\rY\lor\overline\zz$다. (이것은 $\rZ\setminus\rY$나 $\zz\setminus\rY$의 보수다.)

\bull\<NAND \$X,\$Y,\0 `비트 단위 부정 논리곱'.\>
@.NAND@>
레지스터~Y의 각 비트를 레지스터~Z나 상수~Z의 해당 비트와 논리곱하고, 그 결과의 보수를
레지스터~X에 넣는다. 다시 말해 레지스터~X의 비트는 피연산자들의 해당 비트가 둘 다~1일 때, 그리고
그때에만~0이 된다. 기호로 쓰면 $\rX=\rY\mathbin{\overline\land}\rZ$나
$\rX=\rY\mathbin{\overline\land}\zz$다.

\bull\<NOR \$X,\$Y,\0 `비트 단위 부정 논리합'.\>
@.NOR@>
레지스터~Y의 각 비트를 레지스터~Z나 상수~Z의 해당 비트와 논리합하고, 그 결과의 보수를
레지스터~X에 넣는다. 다시 말해 레지스터~X의 비트는 피연산자들의 해당 비트가 둘 다~0일 때, 그리고
그때에만~1이 된다. 기호로 쓰면 $\rX=\rY\mathbin{\overline\lor}\rZ$나
$\rX=\rY\mathbin{\overline\lor}\zz$다.

\bull\<NXOR \$X,\$Y,\0 `비트 단위 부정 배타적 논리합'.\>
@.NXOR@>
레지스터~Y의 각 비트를 레지스터~Z나 상수~Z의 해당 비트와 배타적 논리합하고, 그 결과의 보수를
레지스터~X에 넣는다. 다시 말해 레지스터~X의 비트는 피연산자들의 해당 비트가 같을 때, 그리고
그때에만~1이 된다. 기호로 쓰면 $\rX=\rY\mathbin{\overline\oplus}\rZ$나
$\rX=\rY\mathbin{\overline\oplus}\zz$다. 보충: 원본은 이 항목을 찾아보기에 \.{NAND}로 올렸는데,
여기서는 \.{NXOR}로 올렸다.

\bull\<MUX \$X,\$Y,\0 `비트 단위 멀티플렉스'.\>
@.MUX@>
비트 위치~$j$마다, 특수한 {\it 마스크 레지스터\/}~rM의 비트~$j$가 1인지 0인지에 따라 레지스터~X의
@^rM@>
$j$번째 비트를 레지스터~Y의 비트~$j$나 다른 피연산자 \$Z~또는~Z의 비트~$j$로 정한다. 곧
${\rm M}_j$이면 $\yy_j$, 그렇지 않으면~$\zz_j$다. 기호로 쓰면
$\rm\rX=(\rY\land rM)\lor(\rZ\land\overline{rM})$나
$\rm\rX=(\rY\land rM)\lor(\zz\land\overline{rM})$다. (\MMIX에는 이런 특수 레지스터가 여럿 있는데,
입력이 둘보다 많이 필요하거나 출력을 하나보다 많이 내는 명령들과 관련되어 있다.)

@ 열여덟 가지 비트 단위 연산 말고도, \MMIX는 좀 더 이국적인 부호 없는 바이트 단위 연산과 그보다
큰 단위의 연산도 할 수 있다.

\bull\<BDIF \$X,\$Y,\0 `바이트 차'.\>
@.BDIF@>
바이트 위치~$j$마다 레지스터~X의 $j$번째 바이트를, 레지스터~Y의 바이트~$j$에서 다른 피연산자
\$Z~또는~Z의 바이트~$j$를 뺀 값으로 정한다. 다만 그 차가 음수이면 \$X의 바이트~$j$를 0으로 정한다.

\bull\<WDIF \$X,\$Y,\0 `와이드 차'.\>
@.WDIF@>
와이드 위치~$j$마다 레지스터~X의 $j$번째 와이드를, 레지스터~Y의 와이드~$j$에서 다른 피연산자
\$Z~또는~Z의 와이드~$j$를 뺀 값으로 정한다. 다만 그 차가 음수이면 \$X의 와이드~$j$를 0으로 정한다.

\bull\<TDIF \$X,\$Y,\0 `테트라 차'.\>
@.TDIF@>
테트라 위치~$j$마다 레지스터~X의 $j$번째 테트라를, 레지스터~Y의 테트라~$j$에서 다른 피연산자
\$Z~또는~Z의 테트라~$j$를 뺀 값으로 정한다. 다만 그 차가 음수이면 \$X의 테트라~$j$를 0으로 정한다.

\bull\<ODIF \$X,\$Y,\0 `옥타 차'.\>
@.ODIF@>
레지스터~X를 레지스터~Y에서 다른 피연산자 \$Z~또는~Z를 뺀 값으로 정한다. 다만 \$Z~또는~Z가
레지스터~Y보다 크면 \$X를 0으로 정한다. 피연산자들은 부호 없는 정수로 다룬다.

\smallskip
명령 \.{BDIF}와 \.{WDIF}는 그래픽이나 영상에 응용할 때 쓸모 있다. 명령 \.{TDIF}와 \.{ODIF}는 일관성을
위해 함께 있다. 이를테면 \.a와 \.b가 8바이트짜리 양을 담은 레지스터이면, 바이트 단위 최댓값~\.c와
바이트 단위 최솟값~\.d는
$$\hbox{\tt BDIF x,a,b; ADDU c,x,b; SUBU d,a,x;}$$
로 계산한다. 마찬가지로 개별 ``화소 차''~\.e, 곧 해당하는 바이트들의 차의 절댓값은
$$\hbox{\tt BDIF x,a,b; BDIF y,b,a; OR e,x,y.}$$
로 계산한다. \.a와 \.b의 바이트들을 하나씩 더하되, 합이 한 바이트에 들어가지 않으면 모두 255로
잘라 내려면 이렇게 하면 된다.
$$\hbox{\tt NOR acomp,a,0; BDIF x,acomp,b; NOR clippedsums,x,0;}$$
다시 말해 \.a의 보수를 취하고, \.{BDIF}를 적용하고, 결과의 보수를 취한다. 이 연산들은 바이트나
와이드의 문자열에 대한 효율적인 연산을 만드는 데에도 쓸 수 있다.
@^graphics@>
@^pixels@>
@^saturating arithmetic@>
@^nybble@>

연습 문제: 니블 열여섯 개에 대해 한꺼번에 비슷한 방식으로 동작하는 ``니블 차'' 명령을 구현하라.

답: {\tt\spaceskip=.5em minus .3em
AND x,a,m; AND y,b,m; ANDN xx,a,m; ANDN yy,b,m;
BDIF x,x,y; BDIF xx,xx,yy; OR ans,x,xx}. 여기서 레지스터 \.m에는 마스크
\Hex{0f0f0f0f0f0f0f0f}가 들어 있다.

(연산 \.{ANDN}은 64비트에 대해 한꺼번에 비슷한 방식으로 동작하는 ``비트 차'' 명령으로 볼 수
있다.)

@ 비트를 주무르는 명령 세 쌍이 더 있어서 이국적인 명령 모음을 마무리한다.

\bull\<SADD \$X,\$Y,\0 `옆으로 더하기'.\>
@.SADD@>
레지스터~Y의 각 비트를 레지스터~Z나 상수~Z의 해당 비트의 보수와 논리곱하고, 그 결과에 든 1~비트의
개수를 레지스터~X에 넣는다. 다시 말해 레지스터~X를, 레지스터~Y는~1이고 다른 피연산자는~0인 비트
위치의 개수로 정한다. 기호로 쓰면 $\rX=\nu(\rY\setminus\rZ)$나 $\rX=\nu(\rY\setminus\zz)$다. 둘째
피연산자가 0일 때 이 연산을 ``개체 수 세기''라고 부르기도 한다. 레지스터~Y에 든 1의 개수를 세기
@^population counting@>
때문이다.
@^counting ones@>

\bull\<MOR \$X,\$Y,\0 `다중 논리합'.\>
@.MOR@>
레지스터~Y의 64비트에 다음과 같이 첨자를 붙인다고 하자.
$$y_{00}y_{01}\ldots y_{07}y_{10}y_{11}\ldots y_{17}\ldots
  y_{70}y_{71}\ldots y_{77}.$$
다시 말해 비트와 바이트에 큰 쪽 먼저 방식으로 왼쪽에서 오른쪽으로 0부터 7까지 번호를 매기면,
$y_{ij}$는 $i$번째 바이트의 $j$번째 비트다. 다른 피연산자 \$Z나~Z의 비트에도 비슷하게 첨자를 붙이자.
$$z_{00}z_{01}\ldots z_{07}z_{10}z_{11}\ldots z_{17}\ldots
  z_{70}z_{71}\ldots z_{77}.$$
연산 \.{MOR}는 레지스터~X의 각 비트 $x_{ij}$를 비트
$$ y_{0j}z_{i0}\lor y_{1j}z_{i1}\lor \cdots \lor y_{7j}z_{i7}$$
로 바꾼다. 따라서 이를테면 레지스터~Z에 상수 \Hex{0102040810204080}이 들어 있으면, \.{MOR}는
레지스터~Y의 바이트 순서를 뒤집어서 작은 쪽 먼저 주소 지정과 큰 쪽 먼저 주소 지정 사이를 바꾼다.
@^big-endian versus little-endian@>
@^little-endian versus big-endian@>
(레지스터 \$X의 $i$번째 바이트는 \$Z나~Z의 $i$번째 바이트가 지정하는 대로 \$Y의 바이트들에 따라 정해진다.
64비트 낱말을 한 열에 한 바이트씩 든 $8\times8$ 불 행렬로 보면, 이 연산은 불 곱
$\rX=\rY\,\rZ$나 $\rX=\rY\,\zz$를 계산한다. 거꾸로 64비트 낱말을 한 {\it 행\/}에 한 바이트씩 든
$8\times8$ 행렬로 보면, \.{MOR}는 피연산자의 순서가 반대인 불 곱 $\rX=\rZ\,\rY$나 $\rX=\zz\,\rY$를
계산한다. 즉시 꼴인 명령 \<MOR \$X,\$Y,Z 는 늘 레지스터~X의 앞쪽 일곱 바이트를 0으로 만든다. 나머지
바이트는 즉시 피연산자~Z가 지정하는 레지스터~Y의 바이트들을 비트 단위로 논리합한 것이 된다.)

연습 문제: 바이트 위치에서 \.a가 \.b보다 크면 \Hex{ff}이고 다른 바이트에서는 모두 \Hex{00}인
마스크 \.m을 계산하는 방법을 설명하라. 답: \.{BDIF}~\.{x,a,b;} \.{MOR}~\.{m,minusone,x;} 여기서
\.{minusone}은 모두 1로 이루어진 레지스터다. (더 나아가 이 결과를 \Hex{8040201008040201}과
\.{AND}한 다음 $\zz=255$로 \.{MOR}하면, \.m을 한 바이트로 부호화한 것을 얻는다.)

\bull\<MXOR \$X,\$Y,\0 `다중 배타적 논리합'.\>
@.MXOR@>
이 연산은 방금 설명한 불 곱셈과 비슷하지만, 비트를 합치는 데 배타적 논리합을 쓴다. 그래서 불 행렬
곱 대신 원소가 둘인 체 위의 행렬 곱을 얻는다. 이 연산은 여러 가지 쓰임 가운데 특히 해시 함수를
만드는 데 쓸 수 있다. (그 해시 함수들은 나쁘지 않지만, {\sl Sorting and Searching\/}의 연습 문제
6.4--72가 말하는 뜻에서 ``보편적''이지는 않다.)
@^matrices of bits@>
@^Boolean multiplication@>

@ 16비트 상수가 필요한 흔한 경우를 위해 ``즉시 와이드'' 명령이 열여섯 개 있다. 이 경우에는
명령의 Y~필드와~Z 필드를 하나의 16비트 부호 없는 수~YZ로 본다.
@^immediate operands@>

\bull\<SETH \$X,YZ `윗 와이드로 정하기';
@.SETH@>
     \<SETMH \$X,YZ `가운데 윗 와이드로 정하기';
@.SETMH@>
     \<SETML \$X,YZ `가운데 아랫 와이드로 정하기';
@.SETML@>
     \<SETL \$X,YZ `아랫 와이드로 정하기'.\>
@.SETL@>
16비트 부호 없는 수 YZ를 각각 48, 32, 16, 0비트 왼쪽으로 옮겨서 레지스터~X에 넣는다. 따라서
이를테면 \.{SETML}은 주어진 값을 레지스터~X의 끝에서 둘째 와이드에 넣고 나머지 세 와이드를 0으로
만든다.

\bull\<INCH \$X,YZ `윗 와이드만큼 늘리기';
@.INCH@>
     \<INCMH \$X,YZ `가운데 윗 와이드만큼 늘리기';
@.INCMH@>
     \<INCML \$X,YZ `가운데 아랫 와이드만큼 늘리기';
@.INCML@>
     \<INCL \$X,YZ `아랫 와이드만큼 늘리기'.\>
@.INCL@>
16비트 부호 없는 수 YZ를 각각 48, 32, 16, 0비트 왼쪽으로 옮겨서 넘침을 무시하고 레지스터~X에
더한다. 그 결과를 다시 레지스터~X에 넣는다.

값 YZ가 십육진 상수 \Hex{8000}이면, 명령 \<INCH \$X,YZ 는 레지스터~X의 가장 큰 쪽 비트를 뒤집는다.
아래에서 보겠지만, 이것으로 부동소수점 수의 부호를 바꿀 수 있다.
@^negation, floating point@>

\bull\<ORH \$X,YZ `윗 와이드와 논리합';
@.ORH@>
     \<ORMH \$X,YZ `가운데 윗 와이드와 논리합';
@.ORMH@>
     \<ORML \$X,YZ `가운데 아랫 와이드와 논리합';
@.ORML@>
     \<ORL \$X,YZ `아랫 와이드와 논리합'.\>
@.ORL@>
16비트 부호 없는 수 YZ를 각각 48, 32, 16, 0비트 왼쪽으로 옮겨서 레지스터~X와 논리합한다. 그
결과를 다시 레지스터~X에 넣는다.

원하는 4와이드 상수 \.{GH} \.{IJ} \.{KL} \.{MN}은 이를테면 다음과 같은 명령 네 개로 레지스터에
넣을 수 있다는 데 주목하라.
$$\hbox{\tt SETH \$X,GH; INCMH \$X,IJ; INCML \$X,KL; INCL \$X,MN;}$$
이 \.{INC} 명령들은 어느 것이든 \.{OR}로 바꾸어도 된다.

\bull\<ANDNH \$X,YZ `윗 와이드와 논리곱 부정';
@.ANDNH@>
     \<ANDNMH \$X,YZ `가운데 윗 와이드와 논리곱 부정';\>
@.ANDNMH@>
     \<ANDNML \$X,YZ `가운데 아랫 와이드와 논리곱 부정';
@.ANDNML@>
     \<ANDNL \$X,YZ `아랫 와이드와 논리곱 부정'.\>
@.ANDNL@>
16비트 부호 없는 수 YZ를 각각 48, 32, 16, 0비트 왼쪽으로 옮긴 다음, 보수를 취해서 레지스터~X와
논리곱한다. 그 결과를 다시 레지스터~X에 넣는다.

값 YZ가 십육진 상수 \Hex{8000}이면, 명령 \<ANDNH \$X,YZ 는 레지스터~X의 가장 큰 쪽 비트를 억지로
0으로 만든다. 이것으로 부동소수점 수의 절댓값을 계산할 수 있다.
@^absolute value, floating point@>

@ \MMIX는 레지스터를 왼쪽이나 오른쪽으로 몇 비트든 옮기는 방법을 여럿 안다.

\bull\<SL \$X,\$Y,\0 `왼쪽으로 옮기기'.\>
@.SL@>
레지스터~Y의 비트들을 \$Z나 Z자리만큼 왼쪽으로 옮기고, 오른쪽에서는 0을 채워 넣는다. 그 결과를
레지스터~X에 넣는다. 레지스터~Y는 부호 있는 수로 다루지만, 둘째 피연산자는 부호 없는 수로 다룬다.
효과는 $2^{\mkern1mu\rZ}$나 $2^\zz$를 곱하는 것과 같다. 결과가 $\ge2^{63}$이거나 $<-2^{63}$이면 정수
넘침 예외가 일어난다. 특히 둘째 피연산자가 64 이상이면 레지스터~X는 모두 0이 되고, 레지스터~Y가
0이 아니었다면 정수 넘침을 알린다.

\bull\<SLU \$X,\$Y,\0 `부호 없이 왼쪽으로 옮기기'.\>
@.SLU@>
레지스터~Y의 비트들을 \$Z나 Z자리만큼 왼쪽으로 옮기고, 오른쪽에서는 0을 채워 넣는다. 그 결과를
레지스터~X에 넣는다. 두 피연산자 모두 부호 없는 수로 다룬다. 명령 \.{SLU}는 넘침을 검사하지
않는다는 것 말고는 \.{SL}과 같다.

\bull\<SR \$X,\$Y,\0 `오른쪽으로 옮기기'.\>
@.SR@>
레지스터~Y의 비트들을 \$Z나 Z자리만큼 오른쪽으로 옮기고, 왼쪽에서는 가장 왼쪽 비트(부호 비트)의
복사본을 채워 넣는다. 그 결과를 레지스터~X에 넣는다. 레지스터~Y는 부호 있는 수로 다루지만, 둘째
피연산자는 부호 없는 수로 다룬다. 효과는 $2^{\mkern1mu\rZ}$나 $2^\zz$로 나누어 내림하는 것과 같다.
특히 둘째 피연산자가 64 이상이면, 레지스터~X는 \$Y가 음이 아니었으면 0이 되고, 음수였으면 $-1$이
된다.

\bull\<SRU \$X,\$Y,\0 `부호 없이 오른쪽으로 옮기기'.\>
@.SRU@>
레지스터~Y의 비트들을 \$Z나 Z자리만큼 오른쪽으로 옮기고, 왼쪽에서는 0을 채워 넣는다. 그 결과를
레지스터~X에 넣는다. 두 피연산자 모두 부호 없는 수로 다룬다. 효과는 64비트 수를
$2^{\mkern1mu\rZ}$나~$2^\zz$로 부호 없이 나누는 것과 같다. 둘째 피연산자가 64 이상이면
레지스터~X는 모두~0이 된다.

@* 비교.
산술 연산과 논리 연산도 좋지만, 컴퓨터 프로그램은 수를 비교하고 그 결과에 따라 계산의 흐름을
바꾸어야 하기도 한다. \MMIX에는 그런 판단을 돕는 비교 명령이 네 개 있다.

\bull\<CMP \$X,\$Y,\0 `비교'.\>
@.CMP@>
부호 있는 산술의 관례를 따라서, 레지스터~Y가 레지스터~Z보다 작거나 부호 없는 즉시값~Z보다 작으면
레지스터~X를 $-1$로 정한다. 레지스터~Y가 레지스터~Z와 같거나 부호 없는 즉시값~Z와 같으면 0으로
정한다. 그 밖에는~1로 정한다. 기호로 쓰면 $\rX=[\rY\!>\!\rZ]-[\rY\!<\!\rZ]$나
$\rX=[\rY\!>\!\zz]-[\rY\!<\!\zz]$다.

\bull\<CMPU \$X,\$Y,\0 `부호 없는 비교'.\>
@.CMPU@>
부호 없는 산술의 관례를 따라서, 레지스터~Y가 레지스터~Z보다 작거나 부호 없는 즉시값~Z보다 작으면
레지스터~X를 $-1$로 정한다. 레지스터~Y가 레지스터~Z와 같거나 부호 없는 즉시값~Z와 같으면 0으로
정한다. 그 밖에는~1로 정한다. 기호로 쓰면 $\rX=[\rY\!>\!\rZ]-[\rY\!<\!\rZ]$나
$\rX=[\rY\!>\!\zz]-[\rY\!<\!\zz]$다.

@ 두 갈래 행동 가운데 하나를 빨리 고르는 조건부 명령도 32개 있다.

\bull\<CSN \$X,\$Y,\0 `음수이면 조건부로 정하기'.\>
@.CSN@>
레지스터~Y가 음수이면(곧 가장 큰 쪽 비트가~1이면), 레지스터~X를 레지스터~Z의 내용이나 부호 없는
즉시값~Z로 정한다. 그렇지 않으면 아무 일도 일어나지 않는다.

\bull\<CSZ \$X,\$Y,\0 `0이면 조건부로 정하기'.
@.CSZ@>
\bul\<CSP \$X,\$Y,\0 `양수이면 조건부로 정하기'.
@.CSP@>
\bul\<CSOD \$X,\$Y,\0 `홀수이면 조건부로 정하기'.
@.CSOD@>
\bul\<CSNN \$X,\$Y,\0 `음수가 아니면 조건부로 정하기'.
@.CSNN@>
\bul\<CSNZ \$X,\$Y,\0 `0이 아니면 조건부로 정하기'.
@.CSNZ@>
\bul\<CSNP \$X,\$Y,\0 `양수가 아니면 조건부로 정하기'.
@.CSNP@>
\bul\<CSEV \$X,\$Y,\0 `짝수이면 조건부로 정하기'.\>
@.CSEV@>
이 명령들은 레지스터~Y가 각각 0, 양수, 홀수, 음수가 아닌 수, 0이 아닌 수, 양수가 아닌 수, 홀수가
아닌 수일 때만 레지스터~X가 바뀐다는 것 말고는 \.{CSN}과 똑같다.

\bull\<ZSN \$X,\$Y,\0 `음수이면 정하고 아니면 0'.\>
@.ZSN@>
레지스터~Y가 음수이면(곧 가장 큰 쪽 비트가~1이면), 레지스터~X를 레지스터~Z의 내용이나 부호 없는
즉시값~Z로 정한다. 그렇지 않으면 레지스터~X를 0으로 정한다.

\bull\<ZSZ \$X,\$Y,\0 `0이면 정하고 아니면 0'.
@.ZSZ@>
\bul\<ZSP \$X,\$Y,\0 `양수이면 정하고 아니면 0'.
@.ZSP@>
\bul\<ZSOD \$X,\$Y,\0 `홀수이면 정하고 아니면 0'.
@.ZSOD@>
\bul\<ZSNN \$X,\$Y,\0 `음수가 아니면 정하고 아니면 0'.
@.ZSNN@>
\bul\<ZSNZ \$X,\$Y,\0 `0이 아니면 정하고 아니면 0'.
@.ZSNZ@>
\bul\<ZSNP \$X,\$Y,\0 `양수가 아니면 정하고 아니면 0'.
@.ZSNP@>
\bul\<ZSEV \$X,\$Y,\0 `짝수이면 정하고 아니면 0'.\>
@.ZSEV@>
이 명령들은 레지스터~Y가 각각 0, 양수, 홀수, 음수가 아닌 수, 0이 아닌 수, 양수가 아닌 수, 짝수일
때 \$X를 \$Z나~Z로 정하고, 그렇지 않으면 \$X를 0으로 정한다는 것 말고는 \.{ZSN}과 똑같다.

두 명령 \<CMPU r,s,0 과 \<ZSNZ r,s,1 은 효과가 같다는 데 주목하라. 두 명령 \<CSNP r,s,0 과
\.{ZSP} \.{r,s,r}도 그렇다. \<AND r,s,1 과 \.{ZSOD}~\.{r,s,1}도 그렇다.

@* 분기와 점프.
\MMIX는 보통 명령을 차례로 실행해서, 테트라바이트 M$_4[\lambda]$의 명령에서 M$_4[\lambda+4]$의
명령으로 나아간다. 그러나 보통의 제어 흐름을 끊는 방법이 여럿 있는데, 대부분 명령의 Y 필드와 Z
필드를 합친 16비트 YZ 필드를 쓴다. 이를테면 \<BNZ \$3,@@+4000 (0이 아니면 분기)가 전형적이다.
이것은 레지스터~3이 0이 아니면 제어가 명령 1000개를 건너뛰어, \.{BNZ}로부터 $4000$바이트 뒤에 있는
명령으로 가야 한다는 뜻이다.

앞으로 분기하는 명령이 여덟 개 있는데, 앞에서 다룬 \.{CS}와 \.{ZS} 명령의 여덟 가지 조건에
해당한다. 그리고 비슷하게 뒤로 분기하는 명령이 여덟 개 있다. 이를테면 \<BOD \$2,@@-4000 (홀수이면
분기)는 레지스터~2가 홀수이면 이 \.{BOD} 명령보다 $4000$바이트 {\it 앞에\/} 있는 명령으로 제어를
옮긴다. 뒤로 분기할 때의 수치 OP 코드는 앞으로 분기할 때의 OP 코드보다 하나 크다. 어셈블러는
필요할 때 \.{ADD}를 32에서 33으로 바꾸어 주듯이 이것도 자동으로 처리한다.

분기는 현재 위치에 상대적이므로, \MMIX\ 어셈블러는 분기 명령을 특별하게 다룬다. 프로그래머가
`\.{BNZ} \.{\$3,Case5}'라고 썼는데, 여기서 \.{Case5}는 위치~$l$에 있는 명령의 주소라고 하자. 이
명령이 위치~$\lambda$에 있으면, 어셈블러는 먼저 변위 $\delta=\lfloor(l-\lambda)/4\rfloor$를 계산한다.
그다음 변위~$\delta$가 음이 아니면 그 양을 \.{BNZ} 명령의 YZ 필드에 넣는데, 그것은 $2^{16}$보다
작아야 한다. 변위~$\delta$가 음수이면 OP 코드를 1만큼 늘린 \.{BNZ} 명령의 YZ 필드에 양
$2^{16}+\delta$를 넣는데, 이때 $\delta$는 $-2^{16}$보다 작지 않아야 한다.

위의 \.{BNZ}와 \.{BOD}의 예에 쓴 기호 \.{@@}를 어셈블러는 ``현재 명령의 위치''의 약칭으로 해석한다.
다음 설명에서는 이를테면 `\.{BNZ}~\.{\$X,@@+4*YZ[-262144]}'라고 써서 분기 명령 쌍을 정의한다.
이것은 현재 위치에 YZ의 네 배를 더한 곳으로 분기하는 앞으로 분기 명령과, 현재 위치에
$(\rm YZ-65536)$의 네 배를 더한 곳으로 분기하는 뒤로 분기 명령을 함께 나타낸다.

\bull\<BN \$X,@@+4*YZ[-262144] `음수이면 분기'.
@.BN@>
\bul\<BZ \$X,@@+4*YZ[-262144] `0이면 분기'.
@.BZ@>
\bul\<BP \$X,@@+4*YZ[-262144] `양수이면 분기'.
@.BP@>
\bul\<BOD \$X,@@+4*YZ[-262144] `홀수이면 분기'.
@.BOD@>
\bul\<BNN \$X,@@+4*YZ[-262144] `음수가 아니면 분기'.
@.BNN@>
\bul\<BNZ \$X,@@+4*YZ[-262144] `0이 아니면 분기'.
@.BNZ@>
\bul\<BNP \$X,@@+4*YZ[-262144] `양수가 아니면 분기'.
@.BNP@>
\bul\<BEV \$X,@@+4*YZ[-262144] `짝수이면 분기'.\>
@.BEV@>
레지스터~X가 각각 음수, 0, 양수, 홀수, 음수가 아닌 수, 0이 아닌 수, 양수가 아닌 수, 짝수이고, 이
명령이 메모리 위치 $\lambda$에 있으면, 다음 명령을 메모리 위치 $\lambda+4{\rm YZ}$(앞으로 분기)나
$\lambda+4({\rm YZ}-2^{16})$(뒤로 분기)에서 가져온다. 따라서 위치~$\lambda$에서 $\lambda-262{,}144$
이상 $\lambda+262{,}140$ 이하의 어느 위치로든 갈 수 있다.

\smallskip
{\it 그럴듯한 분기\/}라고 부르는 분기 명령 열여섯 개도 더 있다. 이것들은 보통의 분기 명령과 뜻이
똑같다. 이를테면 \<PBOD \$2,@@-4000 과 \<BOD \$2,@@-4000 은 둘 다 레지스터~2가 홀수이면 4000바이트
뒤로 간다. 그러나 실행 시간이 다르다. \MMIX의 어떤 구현에서는 분기 명령은 분기할 때 더 오래 걸리고,
그럴듯한 분기는 분기하지 {\it 않을\/} 때 더 오래 걸린다. 그러니 프로그래머는 분기할 가능성이
비교적 낮다고 생각할 때는 \.B 명령을, 분기하는 경우가 더 많으리라고 예상할 때는 \.{PB} 명령을
써야 한다. 다음은 완전함을 위해 적은 그럴듯한 분기 명령의 목록이다.

\bull\<PBN \$X,@@+4*YZ[-262144] `음수이면 그럴듯한 분기'.
@.PBN@>
\bul\<PBZ \$X,@@+4*YZ[-262144] `0이면 그럴듯한 분기'.
@.PBZ@>
\bul\<PBP \$X,@@+4*YZ[-262144] `양수이면 그럴듯한 분기'.
@.PBP@>
\bul\<PBOD \$X,@@+4*YZ[-262144] `홀수이면 그럴듯한 분기'.
@.PBOD@>
\bul\<PBNN \$X,@@+4*YZ[-262144] `음수가 아니면 그럴듯한 분기'.
@.PBNN@>
\bul\<PBNZ \$X,@@+4*YZ[-262144] `0이 아니면 그럴듯한 분기'.
@.PBNZ@>
\bul\<PBNP \$X,@@+4*YZ[-262144] `양수가 아니면 그럴듯한 분기'.
@.PBNP@>
\bul\<PBEV \$X,@@+4*YZ[-262144] `짝수이면 그럴듯한 분기'.
@.PBEV@>

@ 현재 명령에 상대적인 위치는 \.{GETA} 명령으로 절대 위치로 바꿀 수 있다.

\bull\<GETA \$X,@@+4*YZ[-262144] `주소 얻기'.\>
@.GETA@>
값 $\lambda+4{\rm YZ}$나 $\lambda+4({\rm YZ}-2^{16})$를 레지스터~X에 넣는다. (분기 명령의 어셈블리
언어 관례가 적용된다. 이를테면 `\.{GETA} \.{\$X,Addr}'라고 쓸 수 있다.)

@ \MMIX에는 무조건 점프 명령도 있다. 무슨 일이 있어도 다음 명령의 위치를 바꾼다.

\bull\<JMP @@+4*XYZ[-67108864] `점프'.\>
@.JMP@>
명령 \.{JMP}는 바이트 X, Y, Z를 부호 없는 24비트 정수 XYZ로 다룬다. 이 명령으로 프로그램은
\.{B}와 \.{PB} 명령에서처럼 상대 주소 지정을 써서, 위치 $\lambda$에서 $\lambda-67\?{,}108{,}864$
이상 $\lambda+67\?{,}108{,}860$ 이하의 어느 위치로든 제어를 옮길 수 있다.

\bull\<GO \$X,\$Y,\0 `위치로 가기'.\>
@.GO@>
\MMIX는 다음 명령을 위치 $\rY+\rZ$나 $\rY+\zz$에서 가져와서 거기서부터 계속한다. 레지스터~X는
$\lambda+4$, 곧 보통 때라면 다음에 실행되었을 명령의 위치로 정한다. (명령 \.{GO}는 점프와 비슷하지만
현재 위치에 상대적이지 않다. 명령 \.{GO}는 적재나 저장 명령과 형식이 같으므로, 적재 루틴은 데이터 참조를
다루는 것과 같은 방식으로 프로그램 이름표를 다룰 수 있다.)

옛날식 서브루틴 연결은 서브루틴에 들어갈 때 `\.{GO}~\.{r,subloc,0}'이나 `\.{GETA}~\.{r,@@+8;}
\.{JMP}~\.{Sub}'라고 하고, 돌아올 때 `\.{GO}~\.{r,r,0}'이라고 해서 구현할 수 있다. 그러나 보통은
아래에서 설명하는 \.{PUSHJ}나 \.{PUSHGO} 명령으로 서브루틴에 들어간다.

명령 \.{GO}에 주는 주소의 가장 작은 쪽 두 비트는 사실상 무시된다. 그러나 그 비트들은 \.{GETA}
명령이 돌려주는 $\lambda$의 값에 나타나고, \.{PUSHJ}나 \.{PUSHGO} 명령을 수행한 뒤의 복귀 점프
@^bit stuffing@>
레지스터~rJ에 나타나고, 인터럽트가 일어난 때의 가로막힌 곳 레지스터에도 나타난다. 그래서 그 비트들로
@^rJ@>
서브루틴에(또는, 그럴 가능성은 적지만, 인터럽트 처리기에) 어떤 신호를 보낼 수도 있다.

@* 곱하기와 나누기.
이제 \MMIX를 더 힘들게 일하게 하는 명령들을 보자.

\bull\<MUL \$X,\$Y,\0 `곱하기'.\>
@.MUL@>
레지스터~Y의 수에 레지스터~Z의 수나 부호 없는 바이트~Z를 곱한 부호 있는 곱이 레지스터~X의 내용을
대신한다. 결과가 $-2^{63}$보다 작거나 $2^{63}-1$보다 크면 \.{ADD}나 \.{SUB}에서처럼 정수 넘침 예외가
일어날 수 있다. (2의 거듭제곱을 즉시값으로 곱하는 것은 \.{SL} 명령으로 더 빨리 할 수 있다.)

\bull\<MULU \$X,\$Y,\0 `부호 없는 곱하기'.\>
@.MULU@>
레지스터~Y와 레지스터~Z나~Z의 부호 없는 128비트 곱 가운데 아래 64비트를 레지스터~X에 넣고, 위
64비트를 특수한 {\it 곱 윗부분 레지스터\/}~rH에 넣는다. (윗부분이 필요 없다면, 2의 거듭제곱을
@^rH@>
즉시값으로 곱하는 것은 \.{SLU} 명령으로 더 빨리 할 수 있다. 더욱이 \<4ADDU \$X,\$Y,\$Y 같은 명령은
\.{MULU} \.{\$X,\$Y,5}보다 빠르다.)

\bull\<DIV \$X,\$Y,\0 `나누기'.\>
@.DIV@>
레지스터~Y의 수를 레지스터~Z의 수나 부호 없는 바이트~Z로 나눈 부호 있는 몫이 레지스터~X의 내용을
대신하고, 부호 있는 나머지는 특수한 {\it 나머지 레지스터\/}~rR에 넣는다. 제수가 0이면 정수 나눗셈
@^rR@>
검사 예외가 일어난다. 그런 경우에 \$X는 0이 되고 rR은~\$Y가 된다. 수 $-2^{63}$을~$-1$로 나누면
@^divide check exception@>
@^overflow@>
정수 넘침 예외가 일어난다. 그 밖에는 정수 넘침이 일어날 수 없다. 수 $y$를~$z$로 나눈 몫은
$\lfloor y/z\rfloor$로 정의하고, 나머지는 $y-\lfloor y/z\rfloor z$로 정의한다($y\bmod z$라고도 쓴다).
따라서 나머지는 0이거나 제수와 부호가 같다. 제수 $z=2^t$로 나누면 \.{SR} 명령으로 $t$만큼 오른쪽으로
옮긴 것과 몫이 똑같고, \.{AND} 명령으로 $z-1$과 논리곱한 것과 나머지가 똑같다. 양의 63비트 수를
양의 상수로 나누는 것은, 알맞은 부호 없는 곱의 윗부분을 계산해서 알맞게 오른쪽으로 옮기면 더 빨리
할 수 있다.

\bull\<DIVU \$X,\$Y,\0 `부호 없는 나누기'.\>
@.DIVU@>
레지스터~Y의 내용 앞에 특수한 {\it 피제수 레지스터\/}~rD를 붙여 얻은 부호 없는 128비트 수를
@^rD@>
레지스터~Z의 부호 없는 수나 부호 없는 바이트~Z로 나누고, 몫을 레지스터~X에 넣는다. 나머지는 나머지
레지스터~rR에 넣는다. 그러나 rD가 제수보다 크거나 같으면(특히 제수가 0이면), \$X는~rD가 되고 rR은~\$Y가
된다. (부호 없는 산술은 0으로 나눌 때조차 결코 예외 상황을 알리지 않는다.) rD가 0이면 $z=2^t$로
부호 없이 나누는 것은 \.{SRU} 명령으로 $t$만큼 오른쪽으로 옮긴 것과 몫이 똑같고, \.{AND} 명령으로
$z-1$과 논리곱한 것과 나머지가 똑같다. {\sl Seminumerical Algorithms\/}의 4.3.1절은 부호 없는
나눗셈으로 엄청나게 큰 수의 몫과 나머지를 얻는 방법을 설명한다.

@* 부동소수점 계산.
유명한 IEEE/ANSI 표준~754를 따르는 부동소수점 산술을 임의의 64비트 수에 대해 제공한다. IEEE
표준은 그런 수를 ``배정밀도 형식''의 양이라고 부르지만, \MMIX는 64비트 양이 보통이므로 그냥
부동소수점 수라고 부른다.
@^floating point arithmetic@>
@^IEEE/ANSI Standard 754@>
@^subnormal numbers@>
@^normal numbers@>
@^NaN@>
@^overflow@>
@^underflow@>
@^invalid exception@>
@^inexact exception@>
@^signaling NaN@>
@^quiet NaN@>
@^infinity@>
@^rounding modes@>

양의 부동소수점 수는 정밀도가 53비트이고, 대략 $10^{-308}$부터 $10^{308}$까지의 범위를 가질 수
있다. 절댓값이 $10^{-324}$와 $10^{-308}$ 사이인 ``비정규수''도 나타낼 수 있지만, 정밀도의 비트 수가 더
적다. 부동소수점 수는 무한대일 수도 있으며, $1.0/\infty=+0.0$, $-2.8\times\infty=-\infty$ 같은
항등식을 만족한다. 부동소수점 양은 ``수가 아님'' 곧 NaN일 수도 있는데, NaN은 다시 신호용 NaN과
조용한 NaN으로 나뉜다.

부동소수점 계산 동안 다섯 가지 예외가 일어날 수 있고, 저마다 코드 문자가 있다. 부동소수점
넘침~(O)이나 아래넘침~(U), 부동소수점 0으로 나누기~(Z), 부동소수점 부정확~(X), 부동소수점
잘못된 연산~(I)이다. 이를테면 넉넉히 작은 정수들의 곱셈은 아무 예외도 일으키지 않고, 91.0을~13.0으로
나누는 것도 예외가 없지만, 나눗셈 1.0/3.0은 부정확하다. 엄청나게 크거나 엄청나게 작은 부동소수점
수의 곱셈은 부정확하고, 넘침이나 아래넘침도 일으킨다. 음수의 제곱근을 구하면 잘못된 결과가 나온다.
수학자들은 I 예외를 $-1.0$의 제곱근에 연관 지어 기억할 수 있다. 무한대나 조용한 NaN을 고정소수점
정수로 바꾸려 할 때, 신호용 NaN을 만날 때, $\infty-\infty$나 $0/0$처럼 수학적으로 정의되지 않은
연산을 요청할 때에도 잘못된 결과가 나온다. (프로그래머가 모든 변수를 신호용 NaN 값으로 초기화해
두면, 초기화하지 않은 부동소수점 데이터를 잘못 쓰지 않았다고 확신할 수 있다.)

부정확한 결과를 위한 반올림 방식이 네 가지 있다. 가장 가까운 쪽으로 반올림(동률이면 짝수 쪽으로),
버림(0 쪽으로), 올림($+\infty$ 쪽으로), 내림($-\infty$ 쪽으로)이다. \MMIX에는 특수한 {\it 산술
상태 레지스터\/}~rA가 있어서, 현재 반올림 방식과 예외 처리에 관한 사용자의 현재 선호를 지정한다.
@^rA@>

\def\NaN{{\rm NaN}}
IEEE 표준 산술은 과학 계산을 위한 훌륭한 바탕을 제공하며, {\sl Seminumerical Algorithms\/}
제4판의 4.2절에서 자세히 설명할 것이다. 지금의 목적으로는 세부를 모두 공부할 필요는 없다. 그러나
표준이 완전히 정의하지 않은 몇 가지 일에 대해서는 \MMIX의 동작을 지정해야 한다. 이를테면 IEEE
표준은 NaN이 낀 연산의 결과를 완전히 정의하지 않는다.

옥타바이트가 \MMIX의 레지스터에서 부동소수점 수를 나타낼 때, 가장 왼쪽 비트는 부호다. 그다음에
지수~$e$를 위한 11비트가 오고, 나머지 52비트가 소수 부분~$f$다. 지수~$e$는 0과
$(11111111111)_2=2047$ 사이의 정수로 보고, 소수 부분~$f$는 0과 $(.111\ldots1)_2=1-2^{-52}$ 사이의
분수로 본다. 옥타바이트마다 뜻은 다음과 같다.
$$\vbox{\halign{\hfil$\pm#$,\quad &#\hfil\cr
0.0&$e=f=0$일 때(0),\cr
2^{-1022}f&$e=0$이고 $f>0$일 때(비정규수),\cr
2^{\mkern1mu e-1023}(1+f)&$0<e<2047$일 때(정규수),\cr
\infty&$e=2047$이고 $f=0$일 때(무한대),\cr
\NaN(f)&$e=2047$이고 $0<f<1/2$일 때(신호용 NaN),\cr
\NaN(f)&$e=2047$이고 $f\ge1/2$일 때(조용한 NaN).\cr}}$$
값 $+0.0$과 $-0.0$을 가린다는 데 주목하라. 이 사실은 구간 산술에서 중요하다.
@^minus zero@>

연습 문제: 부동소수점 수 1.0을 나타내는 64비트는 무엇인가? 답: $e=1023$이고 $f=0$이어야 하므로
답은 \Hex{3ff0000000000000}이다.

연습 문제: 가장 큰 유한 부동소수점 수는 무엇인가? 답: $e=2046$이고 $f=1-2^{-52}$이어야 하므로 답은
$\Hex{7fefffffffffffff}=2^{1024}-2^{971}$이다.

@ IEEE 부동소수점 산술 연산 일곱 가지(덧셈, 뺄셈, 곱셈, 나눗셈, 나머지, 제곱근, 가장 가까운 정수)는
모두 공통된 성질을 가지는데, 아래의 논의에서는 이것을 {\it 표준 부동소수점 관례\/}라고 부른다.
@^standard floating point conventions@>
@^overflow@>
@^underflow@>
연산은 두 레지스터 \$Y와~\$Z에 있는 부동소수점 수에 대해 한다. 다만 제곱근과 정수화에는 피연산자가
하나만 필요하다. 두 입력 피연산자 가운데 어느 것도 NaN이 아니면, 먼저 정확한 결과를 정한 다음,
특수 레지스터~rA에 있는 현재 반올림 방식으로 그것을 반올림한다. 무한대 결과는 정확하므로 반올림할
필요가 없다. 반올림한 결과가 유한하지만 2046보다 큰 지수가 필요하면 부동소수점 넘침 예외가 일어난다.
반올림한 결과에 1보다 작은 지수가 필요하고, 다음 두 조건 가운데 하나가 맞으면 부동소수점 아래넘침
예외가 일어난다. (i)~반올림하지 않은 결과를 비정규수로 정확히 나타낼 수 없거나, (ii)~rA에서
@^rA@>
``부동소수점 아래넘침 트립''이 허용되어 있는 것이다. (트립은 아래에서 다룬다.) NaN은 다음과 같이
특별하게 다룬다. 레지스터 \$Y나~\$Z가 신호용 NaN이면 잘못된 연산 예외가 일어나고, 그 NaN의 소수 부분에
1/2을 더해서 조용하게 만든다. 그다음 \$Z가 조용한 NaN이면 결과를 \$Z로 정하고, 그렇지 않고 \$Y가
조용한 NaN이면 결과를 \$Y로 정한다. (레지스터 \$Y와 \$Z가 실제로 바뀌지는 않는다.)

\bull\<FADD \$X,\$Y,\$Z `부동소수점 더하기'.\>
@.FADD@>
부동소수점 합 $\rY+\rZ$를 방금 설명한 표준 부동소수점 관례로 계산해서 레지스터~X에 넣는다. 합이
$(+\infty)+(-\infty)$나 $(-\infty)+(+\infty)$이면 잘못된 연산 예외가 일어난다. 그런 경우에 결과는
\$Z의 부호를 가진 $\NaN(1/2)$이다. 합이 정확히 0이고 현재 방식이 내림이 아니면, 결과는 $+0.0$이다.
다만 $(-0.0)+(-0.0)=-0.0$이다. 합이 정확히 0이고 현재 방식이 내림이면, 결과는 $-0.0$이다. 다만
@^minus zero@>
$(+0.0)+(+0.0)=+0.0$이다. 부호 있는 0에 관한 이 규칙은 구간 산술을 할 때 쓸모 있는 것으로 드러난다.
구간의 아래 경계가 $+0.0$이거나 위 경계가 $-0.0$이면 그 구간은 0을 담지 않으므로, 구간 안의 수들의
부호를 알 수 있다.

U-트립을 허용하지 않았으면 부동소수점 아래넘침은 일어날 수 없다. 부동소수점 덧셈의 결과가
아래넘치면 늘 비정규수로 정확히 나타낼 수 있기 때문이다.

실없지만 배울 것이 있는 연습 문제: 명령 \<FADD \$X,\$Y,\$Z 와 \<ADDU \$X,\$Y,\$Z 가 둘 다 \$X에 같은
결과를 내는 수의 쌍 $(\rY,\rZ)$를 모두 찾아라. (명령 \.{FADD}는 부동소수점 예외를 일으킬 수도 있다.)
답: 물론 한쪽이 신호용 NaN이 아니면 다른 쪽인 \$Y나 \$Z가 0일 수 있다. 또는 한쪽이 신호용 NaN이고
다른 쪽이 \Hex{0008000000000000}일 수 있다. 다른 가능성은 둘 다 양수이고 \Hex{0010000000000001}보다
작을 때, 또는 한 피연산자가 \Hex{0000000000000001}이고 다른 피연산자가 \Hex{0020000000000001} 이상
\Hex{002ffffffffffffd} 이하의 홀수일 때(가장 가까운 쪽으로 반올림할 때) 생긴다. 그리고
\Hex{7f6001b4c67bc809}\thinspace+\thinspace\Hex{ff5ffb6a4534a3f7}처럼 더 놀라운 가능성도 있다. 해의
여덟 가족은 언젠가 {\sl Seminumerical Algorithms\/}의 제4판에서 모두 밝혀질 것이다.

\bull\<FSUB \$X,\$Y,\$Z `부동소수점 빼기'.\>
@.FSUB@>
이 명령은 \$Z가~NaN이 아니면 \$Z의 부호를 바꾼다는 것 말고는 \.{FADD}와 같다.

\bull\<FMUL \$X,\$Y,\$Z `부동소수점 곱하기'.\>
@.FMUL@>
부동소수점 곱 $\rY\times\rZ$를 표준 부동소수점 관례로 계산해서 레지스터~X에 넣는다. 곱이
$(\pm0.0)\times(\pm\infty)$나 $(\pm\infty)\times(\pm0.0)$이면 잘못된 연산 예외가 일어난다. 그런
경우에 결과는 $\pm\NaN(1/2)$이다. 곱 $(\pm\infty)\times(\pm\infty)$에서는 예외가 일어나지 않는다. 레지스터 \$Y와~\$Z가 둘 다 NaN이 아니면, 결과의 부호는 \$Y와~\$Z의 부호를 곱한 것이다.

\bull\<FDIV \$X,\$Y,\$Z `부동소수점 나누기'.\>
@.FDIV@>
부동소수점 몫 $\rY\?/\rZ$를 표준 부동소수점 관례로 계산해서 \$X에 넣는다. 몫이
@^standard floating point conventions@>
$(\hbox{normal or subnormal})/(\pm0.0)$, 곧 (정규수나 비정규수)$/(\pm0.0)$이면 부동소수점 0으로 나누기
예외가 일어난다. 몫이 $(\pm0.0)/(\pm0.0)$이나 $(\pm\infty)/(\pm\infty)$이면 잘못된 연산 예외가
일어난다. 그런 경우에 결과는 $\pm\NaN(1/2)$이다. 몫 $(\pm\infty)/(\pm0.0)$에서는 예외가 일어나지 않는다. 레지스터 \$Y와~\$Z가 둘 다 NaN이 아니면, 결과의 부호는 \$Y와~\$Z의 부호를 곱한 것이다.

레지스터~X의 부동소수점 수의 지수가 2와~2046 사이에 있다는 것을 안다면, 명령
\<INCH \$X,\char`\#fff0 은 그 수를~2.0으로 나눈다.

\bull\<FREM \$X,\$Y,\$Z `부동소수점 나머지'.\>
@.FREM@>
부동소수점 나머지 $\rY\,{\rm rem}\,\rZ$를 표준 부동소수점 관례로 계산해서 레지스터~X에 넣는다.
(IEEE 표준은 나머지를 $\rY-n\times\rZ$로 정의한다. 여기서 $n$은 $\rY/\rZ$에 가장 가까운 정수이고,
동률이면 짝수다. 이것은 \.{DIV}나 \.{DIVU}가 계산하는 나머지 $\rY\bmod\rZ$와 같지 않다.) 나머지가
0이면 \$Y의 부호를 가진다. 레지스터 \$Y가 무한대이거나 \$Z가 0이면(또는 둘 다이면) 잘못된 연산 예외가
일어난다. 그런 경우에 결과는 \$Y의 부호를 가진 $\NaN(1/2)$이다.

\bull\<FSQRT \$X,\$Z `부동소수점 제곱근'.\>
@.FSQRT@>
부동소수점 제곱근 $\sqrt\rZ$를 표준 부동소수점 관례로 계산해서 레지스터~X에 넣는다. 레지스터 \$Z가
음수이면(무한대든, 정규수든, 비정규수든) 잘못된 연산 예외가 일어난다. 그런 경우에 결과는
$-\NaN(1/2)$이다. 값 $-0.0$이나 $+\infty$의 제곱근을 구할 때는 예외가 일어나지 않는다. 어느 경우든
결과의 부호는 \$Z의 부호다.

명령 \.{FSQRT}의 Y 필드는 아래에서 설명하듯이 특별한 반올림 방식을 지정하는 데 쓸 수 있다.

\bull\<FINT \$X,\$Z `부동소수점 정수화'.\>
@.FINT@>
레지스터~Z의 부동소수점 수를 현재 반올림 방식으로 (필요하면) 반올림해서 부동소수점 정수로 만들고,
레지스터~X에 넣는다. 무한대 값과 조용한 NaN은 바뀌지 않는다. 신호용 NaN은 표준 관례대로 다룬다.
부동소수점 넘침 예외와 아래넘침 예외는 일어날 수 없다.

명령 \.{FINT}의 Y 필드는 아래에서 설명하듯이 특별한 반올림 방식을 지정하는 데 쓸 수 있다.

@ 산술을 하는 것 말고도, 부동소수점 수를 서로 비교해야 한다. 이때 NaN과, $-0.0$을 $+0.0$과 같다고
보아야 한다는 사실을 제대로 고려해야 한다. 다음 명령들은 정수에 쓴 비교 연산자 \.{CMP}와
\.{CMPU}와 비슷하다.
@^minus zero@>

\bull\<FCMP \$X,\$Y,\$Z `부동소수점 비교'.\>
@.FCMP@>
부동소수점 산술의 관례에 따라 $\rY<\rZ$이면 레지스터~X를 $-1$로 정하고, 그 관례에 따라
$\rY>\rZ$이면~1로 정한다. 그 밖에는~0으로 정한다. 레지스터 \$Y나 \$Z가 NaN이면 잘못된 연산 예외가 일어난다.
그런 경우에 결과는 0이다.

\bull\<FEQL \$X,\$Y,\$Z `부동소수점 같음'.\>
@.FEQL@>
부동소수점 산술의 관례에 따라 $\rY=\rZ$이면 레지스터~X를 1로 정한다. 그 밖에는~0으로 정한다.
레지스터 \$Y나 \$Z가 NaN이면, NaN을 그 자신과 견주더라도 결과는 0이다. 그러나 \$Y나 \$Z가 신호용 NaN일 때조차
잘못된 연산 예외는 일어나지 않는다. (이 점에서 \MMIX는 IEEE 표준과 조금 다를지도 모른다. 그러나
프로그래머는 때로 부작용 없이 신호용 NaN을 살펴보아야 한다. 신호용 NaN을 부동소수점 같음으로
견줄 때마다 잘못된 연산 예외를 일으켜야 한다고 고집하는 프로그래머는, \.{FEQL}~\.{\$X,\$Y,\$Z}라고
말하기 바로 전에 명령 \<FSUB \$X,\$Y,\$Y; \<FSUB \$X,\$Z,\$Z 를 내면 된다.)

부호 없는 64비트 정수 $w$, $x$, $y$, $z$가 $w<x<2^{63}\le y<z$를 만족한다고 하자. 따라서 $w$와~$x$의
가장 왼쪽 비트는~0이고, $y$와~$z$의 가장 왼쪽 비트는~1이다. 그러면 이 수들을 부호 없는 정수로 볼
때는 $w<x<y<z$이지만, 부호 있는 정수로 볼 때는 $y$와~$z$가 음수이므로 $y<z<w<x$다. 더욱이 NaN이
없다고 가정하면, 이 똑같은 64비트 양들을 부동소수점 수로 볼 때는 $z<y\le w<x$다. 부동소수점 수의
가장 왼쪽 비트는 부호를 나타내고 나머지 비트는 크기를 나타내기 때문이다. 부동소수점 비교에서
$y=w$인 경우는 $y$가 $-0.0$의 표현이고 $w$가 $+0.0$의 표현일 때, 그리고 그때에만 일어난다.

\bull\<FUN \$X,\$Y,\$Z `부동소수점 순서 없음'.\>
@.FUN@>
부동소수점 산술의 관례에 따라 \$Y와 \$Z 사이에 순서가 없으면(곧 둘 가운데 하나가 NaN이면)
레지스터~X를 1로 정한다. 그렇지 않으면 레지스터~X를~0으로 정한다. 레지스터 \$Y나 \$Z가 신호용 NaN일 때조차
잘못된 연산 예외는 일어나지 않는다.

\smallskip
IEEE 표준은 부동소수점 수 사이의 서로 다른 관계 26가지를 다룬다. \MMIX는 그 가운데 14가지를 명령
하나와 그 뒤의 분기(또는 ``순수한'' 0이나~1의 결과를 내는 \.{ZS})로 구현한다. 26가지 모두를
\MMIX\ 명령 넷 이하의 열과 그 뒤의 분기로 계산할 수 있다. 가장 다루기 어려운 경우는 `?$>=$'(순서
없음, 또는 크거나 같음을 예외 없이 계산하는 것)인데, 다음 명령 열은 $\rY\mathrel?>=\rZ$일 때, 그리고
그때에만 $\rX\ge0$으로 만든다.
$$\vbox{\halign{&\tt#\hfil\ \cr
  &FUN &\$255,\$Y,\$Z\cr
  &BP  &\$255,1F&\% 순서가 없으면 앞으로 건너뛴다\cr
  &FCMP&\$X,\$Y,\$Z&\% \$X=[\$Y>\$Z]-[\$Y<\$Z]; 예외는 일어나지 않는다\cr
1H&CSNZ &\$X,\$255,1&\% 순서가 없으면 \$X=1\cr
}}$$

@ 연습 문제: \MMIX에 \.{FINT} 명령이 없다고 하자. 다른 명령들로 \<FINT \$X,\$Z 와 같은 것을 얻는
@.FINT@>
방법을 설명하라. 프로그램은 NaN과 예외에 대해 올바르게 동작해야 한다. (이를테면 \$Z가 신호용
NaN일 때, 그리고 그때에만 잘못된 연산 예외를 일으켜야 하고, \$Z를 다른 값으로 반올림해야 할 때만
부정확 예외를 일으켜야 한다.)
@^emulation@>

답: (어셈블러는 십육진 상수 앞에 \.\#을 붙인다.)
$$\vbox{\halign{&\tt#\hfil\ \cr
  &SETH &\$0,\char`\#4330&\% \$0=2\char`\^52\cr
  &SET &\$1,\$Z&\% \$1=\$Z\cr
  &ANDNH &\$1,\char`\#8000&\% \$1=abs(\$Z)\cr
  &ANDN &\$2,\$Z,\$1&\% \$2=signbit(\$Z)\cr
  &FUN &\$3,\$Z,\$Z&\% \$3=[\$Z가 NaN이다]\cr
  &BNZ &\$3,1F&\% \$Z가 NaN이면 앞으로 건너뛴다\cr
  &FCMP &\$3,\$1,\$0&\% \$3=[abs(\$Z)>2\char`\^52]-[abs(\$Z)<2\char`\^52]\cr
  &CSNN &\$0,\$3,0&\% \$3>=0이면 \$0=0으로 정한다\cr
  &OR  &\$0,\$2,\$0&\% \$Z의 부호를 \$0에 붙인다\cr
1H\ &FADD &\$1,\$Z,\$0&\% \$1=\$Z+\$0\cr
  &FSUB &\$1,\$1,\$0&\% \$X=\$1-\$0\cr
  &OR   &\$X,\$1,\$2&\% 음의 0을 잃지 않게 한다\cr}}$$
이 프로그램은 부동소수점 산술로 $\pm2^{52}$를 더했다가 빼서 관심 있는 경우 대부분을 처리한다.
모든 경우에 이렇게 하는 것은 옳지 않다. 이를테면 그런 덧셈과 뺄셈은 \$Z가 작은 음의 양일 때(0 쪽으로
반올림하면)나 \$Z가 $2^{105}+2^{53}$ 같은 수일 때(가장 가까운 쪽으로 반올림하면) 올바른 답을 내지
못할 수도 있다.

@ \MMIX는 {\sl Seminumerical Algorithms\/}의 4.2.2절의 이론이 제안하는 대로, IEEE 표준을 넘어서
부동소수점 수 사이에 추가 관계를 정의한다. 음이 아닌 수~$\epsilon$이 주어지면, 정규 부동소수점 수
$u=(f,e)$마다 다음 {\it 이웃\/}이 있다.
$$N_\epsilon(u)=\{x\,\mid\,\vert x-u\vert\le 2^{e-1022}\epsilon\};$$
또 $N_\epsilon(0)=\{0\}$으로 정의하고, $u$가 비정규수이면
$N_\epsilon(u)=\{x\mid\vert x-u\vert\le2^{-1021}\epsilon\}$으로 정의한다. 무한대에 대해서는
$\epsilon<1$이면 $N_\epsilon(\pm\infty)=\{\pm\infty\}$, $1\le\epsilon<2$이면
$N_\epsilon(\pm\infty)=\{\mp\infty$를 뺀 모든 것$\}$, $\epsilon\ge2$이면
$N_\epsilon(\pm\infty)=\{$모든 것$\}$으로 정의한다. 그러면 다음과 같이 쓴다.
$$\vbox{\halign{$u#v\ (\epsilon)$, &#\hfil\cr
\prec&$u<N_\epsilon(v)$이고 $N_\epsilon(u)<v$일 때;\cr
\sim&$u\in N_\epsilon(v)$이거나 $v\in N_\epsilon(u)$일 때;\cr
\approx&$u\in N_\epsilon(v)$이고 $v\in N_\epsilon(u)$일 때;\cr
\succ&$u>N_\epsilon(v)$이고 $N_\epsilon(u)>v$일 때.\cr}}$$

\def\rE{{\rm rE}}
\bull\<FCMPE \$X,\$Y,\$Z `엡실론에 대한 부동소수점 비교'.\>
@.FCMPE@>
위에서 말한 {\sl Seminumerical Algorithms\/}의 관례에 따라 $\rY\prec\rZ\ \ (\rE)$이면 레지스터~X를
$-1$로 정하고, 그 관례에 따라 $\rY\succ\rZ\ \ (\rE)$이면~1로 정한다. 그 밖에는~0으로 정한다. 여기서
rE는 특수한 {\it 엡실론 레지스터\/}에 든 부동소수점 수인데, 이 레지스터는 부동소수점 비교 연산
@^rE@>
\.{FCMPE}, \.{FEQLE}, \.{FUNE}만 쓴다. 레지스터 \$Y, \$Z, rE 가운데 어느 것이라도 NaN이거나 rE가 음수이면
잘못된 연산 예외가 일어나고 결과는 0이다. 그런 예외가 일어나지 않으면, rE에 대해 세 조건
$\rY\prec\rZ$, $\rY\sim\rZ$, $\rY\succ\rZ$ 가운데 정확히 하나가 성립한다.

\bull\<FEQLE \$X,\$Y,\$Z `엡실론에 대한 부동소수점 동치'.\>
@.FEQLE@>
위에서 말한 {\sl Seminumerical Algorithms\/}의 관례에 따라 $\rY\approx\rZ\ \ (\rE)$이면 레지스터~X를
1로 정한다. 그 밖에는~0으로 정한다. 레지스터 \$Y, \$Z, rE 가운데 어느 것이라도 NaN이거나 rE가 음수이면
잘못된 연산 예외가 일어나고 결과는 0이다. 명령 \.{FEQLE}이 계산하는 관계 $\rY\approx\rZ$는 \.{FCMPE}가
계산하는 관계 $\rY\sim\rZ$보다 강하다는 데 주목하라.

\bull\<FUNE \$X,\$Y,\$Z `엡실론에 대한 부동소수점 순서 없음'.\>
@.FUNE@>
\$Y, \$Z, rE 가운데 어느 것이라도 \.{FCMPE}와 \.{FEQLE}에서 말한 대로 예외적이면 레지스터~X를 1로
정한다. 그 밖에는~0으로 정한다. 레지스터 \$Y, \$Z, rE가 신호용 NaN이더라도 예외는 일어나지 않는다.

\smallskip\noindent
연습 문제: 예외가 일어나지 않을 때, \.{FCMPE}는 $\epsilon=1/2$에 대해 어떤 부동소수점 수들을
$\sim0.0$으로 여기는가? \ 답: 0, 비정규수, 그리고 $f=0$인 정규수다. (엡실론에 대해 0과 비슷한 수는
0, $f\le2\epsilon$인 비정규수, $f\le2\epsilon-1$인 정규수, 그리고 $\epsilon>=1$이면 $\pm\infty$다.)

@ IEEE 표준은 32비트 부동소수점 양도 정의하는데, 그것을 ``단정밀도 형식'' 수라고 부른다. \MMIX는
그것을 {\it 짧은 부동소수점 수\/}(short float)라고 부르며, 그런 수를 메모리에서 적재하거나 메모리에
@^short float@>
저장할 때 32비트 꼴과 64비트 꼴 사이를 바꾼다. 짧은 부동소수점 수는 부호 비트와 그 뒤의 8비트 지수와
23비트 소수로 이루어진다. \MMIX의 레지스터 하나에 적재되고 나면, 그 52비트 소수 부분의 끝에는 0
비트가 29개 붙고, 지수~$e$는 256개의 값 0, $(01110000001)_2=897$, $(01110000010)_2=898$, \dots,
$(10001111110)_2=1150$, 2047 가운데 하나가 된다. 다만 비정규수였다면 그렇지 않다. 비정규수인 짧은
부동소수점 수는 적재하면 $874\le e\le896$인 정규수가 된다.

\bull\<LDSF \$X,\$Y,\0 `짧은 부동소수점 수 적재'.\>
@.LDSF@>
레지스터~X를 $\mm_4[\rY+\rZ]$나 $\mm_4[\rY+\zz]$가 나타내는 32비트 부동소수점 수에 해당하는 64비트
부동소수점 수로 정한다. 신호용 NaN을 적재하더라도 산술 예외는 일어나지 않는다.

\bull\<STSF \$X,\$Y,\0 `짧은 부동소수점 수 저장'.\>
@.STSF@>
레지스터~X를 32비트 부동소수점 수로 반올림해서 얻은 값을 $\mm_4[\rY+\rZ]$나 $\mm_4[\rY+\zz]$에
넣는다. 반올림은 현재 반올림 방식으로 하는데, 정밀도와 지수 범위가 제한된다는 것 말고는 64비트
결과를 반올림하는 표준 관례와 정확히 같은 방식이다. 특히 부동소수점 넘침, 아래넘침, 부정확 예외가
일어날 수 있다. 신호용 NaN은 잘못된 연산 예외를 일으키고 조용해진다. NaN의 소수 부분은 필요하면
가장 작은 쪽 29비트를 무시해서 $2^{-23}$의 배수로 자른다.

짧은 부동소수점 수 둘을 적재해서 \.{FADD}, \.{FSUB}, \.{FMUL}, \.{FDIV}, \.{FREM}, \.{FSQRT}, \.{FINT}
가운데 하나로 한 번 연산하고, 그 결과를 짧은 부동소수점 수로 저장하면, IEEE 표준이 단정밀도 형식
산술에 요구하는 결과를 얻는다. 배정밀도 형식에는 ``두 번 반올림''의 문제를 피할 만큼 정밀도가
넉넉하다는 것을 보일 수 있기 때문이다. 그러나 32비트 컴퓨터의 정확한 동작을 흉내 내야 할 강한
까닭이 없다면, 프로그래머는 대개 64비트 산술을 고수하는 편이 낫다. 32비트는 정밀도를 그리 많이
주지 못한다.

@ 물론 정수와 부동소수점 값 사이를 오갈 수 있어야 한다.

\bull\<FIX \$X,\$Z `부동소수점을 고정소수점으로 바꾸기'.\>
@.FIX@>
레지스터~Z의 부동소수점 수를 \.{FINT} 명령에서처럼 정수로 바꾸고, 그렇게 얻은 정수를
($2^{64}$을 법으로) 레지스터~X에 넣는다. 레지스터 \$Z가 무한대이거나 NaN이면 잘못된 연산 예외가 일어난다.
그런 경우에 \$X는 그냥~\$Z와 같아진다. 결과가 $-2^{63}$보다 작거나 $2^{63}-1$보다 크면
부동소수점-고정소수점 변환 예외가 일어난다.
@^float-to-fix exception@>
@^short float@>

\bull\<FIXU \$X,\$Z `부동소수점을 부호 없는 고정소수점으로 바꾸기'.\>
@.FIXU@>
이 명령은 부동소수점-고정소수점 변환 예외가 일어나지 않는다는 것 말고는 \.{FIX}와 똑같다.

\bull\<FLOT \$X,\0 `고정소수점을 부동소수점으로 바꾸기'.\>
@.FLOT@>
레지스터 \$Z에 든 정수나 즉시 상수~Z를 (현재 반올림 방식으로) 가장 가까운 부동소수점 값으로 바꾸어
레지스터~X에 넣는다. 반올림이 필요하면 부동소수점 부정확 예외가 일어난다.

\bull\<FLOTU \$X,\0 `부호 없는 고정소수점을 부동소수점으로 바꾸기'.\>
@.FLOTU@>
명령 \.{FLOTU}는 \.{FLOT}와 같지만, \$Z를 부호 없는 정수로 다룬다.

\bull\<SFLOT \$X,\0 `고정소수점을 짧은 부동소수점 수로 바꾸기';
\<SFLOTU \$X,\0 `부호 없는 고정소수점을 짧은 부동소수점 수로 바꾸기'.\>
@.SFLOT@>
@.SFLOTU@>
명령 \.{SFLOT}들은 소수 부분이 $2^{-23}$의 배수인 부동소수점 수로 반올림한다는 것 말고는 \.{FLOT}
명령들과 같다. (그래서 결과 값은 ``짧은 부동소수점 수 저장'' 명령으로 바뀌지 않는다.) 이런 변환은
IEEE 표준을 완전히 따르려고 \MMIX의 명령 목록에 들어 있을 뿐이다. 프로그래머는 32비트 기계를 흉내
낼 때만 그것이 필요하다.
@^emulation@>

@ 명령 \.{FIX}와 \.{FLOT}의 변형들은 입력 피연산자(\$Z나~Z)가 하나뿐이므로, Y~필드는 보통 0이다.
그러나 프로그래머는 다음과 같이 정해서 이 명령들이 쓰는 반올림 방식을 강제할 수 있다.
$$\vbox{\halign{$\yy=#$,\quad &\.{ROUND\_#}\hfil&\quad(#);\hfil\cr
1&OFF&none\cr
2&UP&away from zero\cr
3&DOWN&toward zero\cr
4&NEAR&to closest\cr}}$$
이를테면 명령 \<FLOTU \$X,ROUND\_OFF,\$Z 는 \$Z가 앞쪽에 0 비트가 $l$개 있는 0이 아닌 양이면
레지스터~X의 지수~$e$를 $1086-l$로 정한다. 그래서 이어서 \.{SETL}~\.{\$0,1086};
\.{SR}~\.{\$X,\$X,52}; \.{SUB}~\.{\$X,\$0,\$X}; \.{CSZ}~\.{\$X,\$Z,64}를 하면 앞쪽의 0의 개수를 셀
수 있다.
@^counting leading zeros@>
@.FLOT@>
@.FLOTU@>
@.SFLOT@>
@.SFLOTU@>
@.FIX@>
@.FIXU@>
@:ROUND_OFF}\.{ROUND\_OFF@>
@:ROUND_UP}\.{ROUND\_UP@>
@:ROUND_DOWN}\.{ROUND\_DOWN@>
@:ROUND_NEAR}\.{ROUND\_NEAR@>

보충: 표의 괄호 안은 원본의 설명(없음, 0에서 멀어지는 쪽, 0 쪽, 가장 가까운 쪽)을 그대로 옮긴
것이다. 부호 없는 수처럼 양수만 생각할 때의 설명이다. 앞에서 말했듯이 일반적으로 \.{ROUND\_OFF}는 0
쪽으로, \.{ROUND\_UP}은 $+\infty$ 쪽으로, \.{ROUND\_DOWN}은 $-\infty$ 쪽으로 반올림한다.

Y 필드는 피연산자가 하나뿐인 다른 부동소수점 명령, 곧 \.{FSQRT}와~\.{FINT}에서도 같은 방식으로
원하는 반올림 방식을 지정하는 데 쓸 수 있다. 이 명령들 가운데 어느 것에서든 Y가~4보다 크면 불법
@.FSQRT@>
@.FINT@>
명령 인터럽트가 일어난다.
@^illegal instructions@>

@* 서브루틴 연결.
\MMIX에는 서브루틴을 부르고 구현하는 과정을 돕도록 설계된 특별한 연산이 몇 가지 있다. 핵심 개념은
하드웨어가 지원하는 {\it 레지스터 스택\/}이라는 착상인데, 이것은 레지스터에 두지 않는 변수들을 위한,
소프트웨어가 지원하는 스택과 함께 있을 수 있다. 프로그래머가 보기에 \MMIX는 잠시 접근할 수 없는
레지스터들의 내용을 담은 옥타바이트들의, 한없이 길어질 수 있는 목록 $S[0]$, $S[1]$,
\dots,~$S[\tau-1]$을 유지한다. 처음에는 $\tau=0$이다. 서브루틴에 들어갈 때 레지스터들을 이 목록의
끝에 ``밀어 넣을'' 수 있는데, 그러면 $\tau$가 는다. 서브루틴이 실행을 마치면 레지스터들을 다시
``꺼내고'' $\tau$가 준다.

지금까지의 논의는 256개 레지스터 \$0, \$1, \dots,~\$255를 모두 똑같은 것처럼 다루었다. 그러나 사실
\MMIX는 한 바이트짜리 내부 계수기 두 개 $L$과~$G$를 유지한다. 여기서 $0\le\ll\le\gg<256$이고,
다음 성질이 있다.
$$\vbox{\halign{#\hfil\cr
레지스터 0, 1, \dots, $\ll-1$은 ``지역''이다;\cr
레지스터 @!|L|, $\ll+1$, \dots, $\gg-1$은 ``가장자리''다;\cr
레지스터 @!|G|, $\gg+1$, \dots, 255는 ``전역''이다.\cr}}$$
가장자리 레지스터는 그 값을 읽으면 0이다.
@^illegal instructions@>
@^rG@>
@^rL@>
@^local registers@>
@^marginal registers@>
@^global registers@>
@^register stack@>

계수기 $G$는 보통 프로그램을 적재할 때 한 번 고정된 값으로 정해진다. 그래서 실행하는 동안 메모리가
아니라 온전히 레지스터에서 살 프로그램 변수의 개수가 정해진다. 그러나 프로그래머는 아래에서
설명하는 \.{PUT} 명령으로 $G$를 동적으로 바꿀 수 있다.

계수기 $L$은 0에서 시작한다. 어떤 명령이 지금 가장자리인 레지스터, 곧 $\ll\le x<\gg$인
레지스터~$x$에 값을 넣으면, $L$의 값은 $x+1$로 늘어나고 새로 지역이 된 레지스터들은 0이 된다.
이를테면 $\ll=10$이고 $\gg=200$이면, 명령 \<ADD \$5,\$15,1 은 그냥 \$5를~1로 정한다. 그러나 명령
\<ADD \$15,\$5,\$200 은 \$10, \$11, \dots,~\$14를 0으로, \$15를 $\$5+\$200$으로, $L$을~16으로
정한다. (레지스터를 지우고 $L$을 늘리는 과정은 최악의 경우에 기계 사이클이 꽤 많이 걸릴 수 있다.
그동안 일어날 수 있는 우선순위 높은 인터럽트도 \MMIX가 처리할 수 있다는 것을 나중에 보게 된다.)

\bull\<PUSHJ \$X,@@+4*YZ[-262144] `레지스터를 밀어 넣고 점프'.
\bul\<PUSHGO \$X,\$Y,\0 `레지스터를 밀어 넣고 가기'.\>
@.PUSHGO@>
@.PUSHJ@>
먼저 $\xx<\ll$이라고 하자. 레지스터~X를 수~X와 같게 정하고, 아래에서 설명하듯이 레지스터 0, 1,
\dots,~X를 레지스터 스택에 밀어 넣는다. 이 명령이 위치 $\lambda$에 있으면, 값 $\lambda+4$를 특수한
{\it 복귀 점프 레지스터\/}~rJ에 넣는다. 그다음 \.{JMP}나 \.{GO} 명령에서처럼 명령
@^rJ@>
$\lambda+4\rm YZ$나 $\lambda+4\rm YZ-262144$나 $\rY+\rZ$나 $\rY+\zz$로 제어가 점프한다.

처음 $\xx+1$개의 레지스터를 스택에 밀어 넣는다는 것은 본질적으로 $S[\tau]\gets\$0$,
$S[\tau+1]\gets\$1$, \dots, $S[\tau+\xx]\gets\$\xx$, $\tau\gets\tau+\xx+1$, $\$0\gets\$(\xx+1)$,
\dots, $\$(\ll-\xx-2)\gets\$(\ll-1)$, $\ll\gets\ll-\xx-1$로 정한다는 뜻이다. 이를테면 $\xx=1$이고
$\ll=5$이면, \$0의 현재 내용과 수~1을 레지스터 스택에 넣는데, 거기서 그것들은 잠시 접근할 수 없게
된다. 그다음 $L$이~3으로 줄어든 채로 서브루틴으로 점프한다. 우리가 \$2, \$3, \$4라고 부르던
레지스터들이 서브루틴에게는 \$0, \$1, \$2로 보인다.

조건 $\ll\le\xx<\gg$가 성립하면, 위에서 설명한 대로 $\ll$의 값이 $\xx+1$로 늘어난다. 그다음
$\xx<\ll$에 대한 규칙이 적용된다.

조건 $\xx\ge\gg$가 성립하면 동작이 비슷하지만, 지역 레지스터 \$0, \dots,~$\$(\ll-1)$을 {\it
모두\/} 레지스터 스택에 넣고 그 뒤에 수~$L$을 넣은 다음, $L$을 0으로 되돌린다. 특히 명령
\<PUSHGO \$255,\$Y,\$Z 는 앞의 $L$ 값과 상관없이 모든 지역 레지스터를 스택에 밀어 넣고 $L$을
0으로 정한다.

\MMIX가 실제로는 일을 거의 하지 않고도 지역 레지스터를 밀어 넣고 이름을 바꾸는 효과를 낼 수
있다는 것을 나중에 보게 된다.

\bull\<POP X,YZ `레지스터를 꺼내고 서브루틴에서 돌아오기'.\>
@.POP@>
이 명령은 현재 지역 레지스터 가운데 X개를 보존하고, 가장 최근의 \.{PUSHJ}나 \.{PUSHGO}의 효과를
되돌리고, $\mm_4[{\rm4YZ+rJ}]$의 명령으로 점프한다. 필드 X가 0보다 크면, $\$(\xx-1)$의 값이 ``구멍''
자리에 들어간다. 구멍은 \.{PUSHJ}나 \.{PUSHGO}가 앞서 밀어 넣은 레지스터의 개수를 저장한 자리다.

명령 \.{POP}의 형식적인 세부는 조금 복잡하지만, 그것이 이치에 맞는다는 것을 보게 될 것이다.
조건 $\xx>\ll$이 성립하면 먼저 X를 $\ll+1$로 바꾼다. 그다음 $x\gets S[\tau-1]\bmod 256$으로 정한다. 이것은
되돌리고 있는 밀어 넣기 명령의 X~필드의 실제 값이다. 이제 스택 자리 $S[\tau-1]$을 $0<\xx\le L$이면
$\$(\xx-1)$로 정하고, 그렇지 않으면 0으로 정한다. 그다음 본질적으로 $\ll\gets\min(x+\xx,\gg)$,
$\$(\ll-1)\gets\$(\ll-x-2)$, \dots, $\$(x+1)\gets\$0$, $\$x\gets S[\tau-1]$, \dots,
$\$0\gets S[\tau-x-1]$, $\tau\gets\tau-x-1$로 정한다. 프로그램이 밀어 넣기보다 꺼내기를 더 많이
@^operating system@>
하면 메모리 보호 인터럽트가 일어나도록 운영체제가 준비해 두어야 한다. (조건 $x>\gg$가 성립하면 이 공식들은 적힌
그대로는 말이 되지 않는다. 그런 드문 경우에는 실제로 $\ll>j\ge0$에 대해 $\$j\gets S[\tau-x-1+j]$로
정한다.)

이를테면 어떤 서브루틴이 입력 매개변수 셋 $(\$0,\$1,\$2)$를 받아서 출력 둘 $(\$0,\$1)$을 낸다고 하자.
그 서브루틴이 다른 서브루틴을 부르지 않는다면, 그냥 \.{POP} \.{2,0}으로 끝내면 된다. rJ에 복귀
주소가 들어 있기 때문이다. 그렇지 않다면, 지역 레지스터 \$0부터~\$3까지를 쓸 경우 이를테면 명령
\<GET \$4,rJ 로 rJ를 저장하면서 시작해야 하고, 하위 서브루틴을 부를 때는 \<PUSHJ \$5 나
\<PUSHGO \$5 를 써야 한다. 마지막으로 \.{POP}~\.{2,0}이라고 말하기 전에 \<PUT rJ,\$4 를 해야 한다.
이 서브루틴을 이를테면 지역 레지스터가 6개인 다른 루틴에서 부르려면, 입력 인자들을 \$7, \$8,
\$9에 넣고 명령 \.{PUSHGO} \.{\$6,base,Subr}을 낸다. 때가 되면 서브루틴의 출력이 \$7과~\$6에
나타난다.

밀어 넣기와 꺼내기 명령은 레지스터 스택에서 한 자리짜리 ``구멍''을 쓴다는 데 주목하라. 구멍은 밀려
내려간 레지스터들과 지역으로 남는 레지스터들 사이에 있다. (방금 본 예에서는 구멍이 \$6 자리다.)
\MMIX는 밀려 내려간 레지스터의 개수를 기억하려고 이 구멍 자리가 필요하다. 출력이 없는 서브루틴은
\<POP 0,0 으로 끝나고, 구멍은 사라진다(가장자리가 된다). 출력이 \$0 하나인 서브루틴은 \<POP 1,0 으로
끝나고, 구멍은 \$0의 옛 값을 받는다. 출력이 둘 $(\$0,\$1)$인 서브루틴은 \<POP 2,0 으로 끝나고, 구멍은
\$1의 옛 값을 받는다. 그러니 이 경우에는 두 출력의 상대적인 순서가 레지스터 스택에서 바뀐다.
서브루틴의 출력이 이를테면 다섯 개 $(\$0,\ldots,\$4)$이면, 그것은 \<POP 5,0 으로 끝나고 \$4가 구멍
자리에 들어가며, 그 뒤에 $(\$0,\$1,\$2,\$3)$이 온다. \MMIX가 출력이 여럿인 경우에 이렇게 묘하게
순서를 바꾸는 까닭은, 다섯 값을 저마다 스택에서 아래로 미끄러뜨리는 것보다 값 하나(곧~\$4)를 아래로
옮겨서 구멍을 메우는 것이 가장 쉽기 때문이다.

매개변수를 넘기는 이 관례가 일반적인 경우에 조금 헷갈린다는 것은 인정한다. 크누스는 이 관례를 많이
쓰는 사람들이 언젠가 ``악명 높은 \MMIX\ 레지스터 뒤섞기''를 이야기하게 될지도 모르겠다고 짐작한다.
그러나 $(x,a,b,c)$ 같은 레지스터 내용의 열을 $(f,a,b,c)$로 바꾸는 서브루틴은 쓸모가 많다. 여기서
$f$는 $a$, $b$, $c$의 함수이지만 $x$의 함수는 아니다. 더욱이 \.{PUSHGO}와 \.{POP}은 아주 효율적으로
구현할 수 있고, 다른 관례를 쓰면 서브루틴 연결이 심각한 병목이 되기 쉽다.

서브루틴의 호출 관례에 관한 정보는 디버거에 전해 주어야 한다. 그 일은 메모리 주소의 기호 이름을
디버거에 알릴 때 함께 쉽게 할 수 있다.

지역 레지스터를 50개 쓰는 서브루틴은 $G$를 50보다 작게 정하는 프로그램이 부르면 제대로 동작하지
않는다. \MMIX는 $G$의 값이 32보다 작아지지 못하게 한다. 그러므로 전역 레지스터를 피하고 지역
레지스터를 많아야~32개 쓰는 서브루틴은 $G$의 현재 값과 상관없이 제대로 동작한다고 확신할 수 있다.

위에서 말한 규칙들에 따르면, $\xx=255$인 \.{PUSHJ}나 \.{PUSHGO} 명령은 지금 정의된 지역 레지스터를
모두 스택에 밀어 넣고 $L$을~0으로 정한다. 그러면 점프해 간 서브루틴이 지역 레지스터를 $G$개 쓸 수
있다. 그 서브루틴이 나중에 \.{POP} \.{0,0}으로 돌아오면, $L$의 옛 값과 \$0, \dots,~$\$(\ll-1)$의
옛 내용이 되살아난다($G$가 줄지 않았다고 가정하면).

필드 값이 $\xx=255$인 \.{POP} 명령은 (꺼낸 뒤에 전체가 $G$를 넘지 않는다면) 모든 지역 레지스터를 서브루틴의
출력으로 보존하고, 구멍에는 ($L=G=255$가 아니면) 0을 넣는다. 그러나 가장 좋은 방침은 거의 언제나
X가 작은 \.{POP}을 쓰는 것이고, 일반적으로 레지스터가 더는 활성이 아니면 $L$을 줄여서 $L$의 값을
되도록 작게 유지하는 것이다. 계수기 $L$의 값이 작을수록 \MMIX가 한 프로세스에서 다른 프로세스로 옮겨 갈
때 문맥을 더 쉽게 바꿀 수 있다.

@* 시스템에 관한 고려.
\MMIX의 고성능 구현은 계산이 진행되면서 필요할 가능성이 높은 명령과 데이터의 {\it 캐시\/}를 두어
속도를 얻는다. [M.~V. Wilkes, {\sl IEEE Transactions\/ \bf EC-14}(1965), 270--271과 J.~S. Liptay,
@^caches@>
{\sl IBM System J. \bf7}(1968), 15--21을 보라.] 신중한 프로그래머는 그런 캐시를 어떻게 관리하면
@^Wilkes, Maurice Vincent@>
@^Liptay, John S.@>
좋을지 귀띔해 주어서 컴퓨터를 더 빨리 돌게 할 수 있다.

\bull\<LDUNC \$X,\$Y,\0 `캐시하지 않는 옥타 적재'.\>
@.LDUNC@>
이 명령들은 \.{LDO}와 뜻이 같지만, 적재한 옥타바이트(와 캐시 블록 안의 이웃들)를 가까운 앞날에 아마
읽거나 쓰지 않으리라는 것도 컴퓨터에 알린다.

\bull\<STUNC \$X,\$Y,\0 `캐시하지 않는 옥타 저장'.\>
@.STUNC@>
이 명령들은 \.{STO}와 뜻이 같지만, 저장한 옥타바이트(와 캐시 블록 안의 이웃들)를 가까운 앞날에 아마
읽거나 쓰지 않으리라는 것도 컴퓨터에 알린다.

\bull\<PRELD X,\$Y,\0 `데이터 미리 적재'.\>
@.PRELD@>
이 명령들은 레지스터나 메모리에 아무 영향도 주지 않지만, $\xx+1$개의 바이트 $\mm[\rY+\rZ]$부터
$\mm[\rY+\rZ+\xx]$까지, 또는 $\mm[\rY+\zz]$부터 $\mm[\rY+\zz+\xx]$까지의 많은 바이트를 가까운 앞날에
아마 적재하거나 저장하리라는 것을 컴퓨터에 알린다. 메모리에 접근할 수 없더라도 보호 실패는 일어나지
않는다.

\bull\<PREGO X,\$Y,\0 `갈 곳 미리 가져오기'.\>
@.PREGO@>
이 명령들은 레지스터나 메모리에 아무 영향도 주지 않지만, $\xx+1$개의 바이트 $\mm[\rY+\rZ]$부터
$\mm[\rY+\rZ+\xx]$까지, 또는 $\mm[\rY+\zz]$부터 $\mm[\rY+\zz+\xx]$까지의 많은 바이트를 가까운 앞날에
아마 명령으로 쓰리라는 것을 컴퓨터에 알린다. 메모리에 접근할 수 없더라도 보호 실패는 일어나지
않는다.

\bull\<PREST X,\$Y,\0 `데이터 미리 저장'.\>
@.PREST@>
컴퓨터에 데이터 캐시가 없으면 이 명령들은 레지스터나 메모리에 아무 영향도 주지 않는다. 그러나 그런
캐시가 있으면, $\xx+1$개의 바이트 $\mm[\rY+\rZ]$부터 $\mm[\rY+\rZ+\xx]$까지, 또는 $\mm[\rY+\zz]$부터
$\mm[\rY+\zz+\xx]$까지의 바이트를 {\it 모두\/} 가까운 앞날에 적재하기 전에 틀림없이 저장하리라는
것을 컴퓨터에 알린다. (그래서 기계는 그 바이트들의 현재 내용을 무시해도 된다. 또 그 바이트들을 여러
프로세서가 함께 쓰고 있으면, 현재 프로세서는 독점적인 접근을 얻으려고 해야 한다.) 메모리에 접근할 수
없더라도 보호 실패는 일어나지 않는다.

\bull\<SYNCD X,\$Y,\0 `데이터 동기화'.\>
@.SYNCD@>
음이 아닌 위치에서 실행할 때, 쓰기 버퍼도 ``나중 쓰기'' 데이터 캐시도 없으면 이 명령들은 레지스터나
메모리에 아무 영향도 주지 않는다. 그러나 그런 버퍼나 캐시가 있으면, $\xx+1$개의 바이트
$\mm[\rY+\rZ]$부터 $\mm[\rY+\rZ+\xx]$까지, 또는 $\mm[\rY+\zz]$부터 $\mm[\rY+\zz+\xx]$까지의 모든
데이터가 반드시 메모리에 있게 하도록 컴퓨터에 강제한다. (그렇지 않으면 앞선 저장 명령의 결과가
캐시에만 있을 수 있다. 컴퓨터는 그 정보를 아직 써 넣지 않았다면 지금이 써 넣을 때라는 말을 듣는
것이다. 프로그램은 메모리에서 곧바로 출력하기 전에 이 기능을 쓸 수 있다.) 메모리에 접근할 수
없더라도 보호 실패는 일어나지 않는다.

음수 주소에서 \.{SYNCD}를 실행할 때도 동작은 비슷하지만, 이 경우에는 지정한 바이트들을 데이터 캐시에서
(그리고 2차 캐시가 있으면 거기서도) 없앤다. 운영체제는 가상 메모리의 페이지를 내보낼 때나, 데이터를
메모리로 곧바로 입력할 때 이 기능을 쓸 수 있다.
@^operating system@>

\bull\<SYNCID X,\$Y,\0 `명령과 데이터 동기화'.\>
@.SYNCID@>
음이 아닌 위치에서 실행할 때, 컴퓨터에 데이터 캐시와 따로 된 명령 캐시가 없으면 이 명령들은
레지스터나 메모리에 아무 영향도 주지 않는다. 그러나 그런 캐시가 있으면, $\xx+1$개의 바이트
$\mm[\rY+\rZ]$부터 $\mm[\rY+\rZ+\xx]$까지, 또는 $\mm[\rY+\zz]$부터 $\mm[\rY+\zz+\xx]$까지를 다음에
고치기 전에 명령으로 쓰면 올바르게 해석되도록 컴퓨터에 강제한다. (일반적으로 \MMIX\ 프로그램은
명령으로도 쓰이는 메모리 위치에 아무것도 저장하지 않으리라고 기대한다. 그래서 \MMIX의 명령 캐시는
데이터 캐시와 어긋나도 된다. 이를테면 디버깅을 위해 멈춤점을 둘 때처럼 동적으로 만들어 낸 명령을
굳이 실행하려는 프로그래머는, 의도한 결과를 얻도록 보장하기 위해 먼저 그 명령들을 \.{SYNCID}해야
한다.) 명령 \.{SYNCID}는 여러 방식으로 구현할 수 있다. 이를테면 기계가 명령 캐시를 데이터 캐시와
맞도록 고칠 수도 있다. 더 단순한 해법은 지정한 범위의 명령을 명령 캐시가 있다면 거기서 없애서, 다음에
필요할 때 메모리에서 가져와야 하게 만드는 것이다. 명령 \.{SYNCID}가 필요한 일은 드물어야 하므로 이것으로
충분하다. 이 경우에 기계는 \.{SYNCD} 명령의 효과도 낸다. 메모리에 접근할 수 없더라도 보호 실패는
일어나지 않는다.

음수 위치에서 \.{SYNCID}를 실행하면 동작이 더 과격하지만 더 빠르다. 그때는 지정한 범위의 모든
바이트를 그냥 모든 캐시에서 없애고, 그런 바이트가 든 ``더러운'' 캐시 블록에 해당하는 메모리는 최신으로
만들지 {\it 않는다}. 운영체제는 가상 메모리의 페이지를 버릴 때(이를테면 프로그램이 끝날 때) 이 판의
명령을 쓸 수 있다.

@ \MMIX는 프로세서 하나에서뿐 아니라, 여러 프로세서가 공통 메모리를 함께 쓰는 상황에서도 동작하도록
설계되었다. 그런 상황에서 효율적으로 동작하는 데 다음 명령들이 쓸모 있다.

\bull\<CSWAP \$X,\$Y,\0 `옥타바이트 비교하고 맞바꾸기'.\>
@.CSWAP@>
옥타바이트 $\mm_8[\rY+\rZ]$나 $\mm_8[\rY+\zz]$가 특수한 {\it 예측 레지스터\/}~rP의 내용과 같으면,
@^rP@>
메모리에서 그것을 레지스터~X의 내용으로 바꾸고 레지스터~X를~1로 정한다. 그렇지 않으면 메모리의
옥타바이트가 rP를 대신하고 레지스터~X는 0이 된다. 이것은 원자적(나뉠 수 없고 가로막을 수 없는)
연산이어서, 독립된 컴퓨터들이 같은 메모리를 함께 쓸 때 프로세스 사이의 통신에 쓸모 있다.

비교하고 맞바꾸기 연산은 IBM이 System/370 아키텍처의 후기 모델에 도입했고, 곧 다른 여러 기계로
@^IBM Corporation@>
@^compare-and-swap@>
@^atomic instruction@>
퍼졌다. 이 연산의 중요한 쓰임새는 이를테면 Harold Stone의 {\sl High-Performance Computer
@^System/370@>
Architecture\/}(Reading, Massachusetts:\ Addison--Wesley, 1987)의 7.2.3절과, Jim Gray와 Andreas
Reuter의 {\sl Transaction Processing\/}(San Francisco:\ Morgan Kaufmann, 1993)의 8.2절과 8.3절에서
다룬다. % Kaufmann: 그대로
@^Stone, Harold Stuart@>
@^Gray, James Nicholas@>
@^Reuter, Andreas Horst@>

\bull\<SYNC XYZ `동기화'.\>
@.SYNC@>
필드가 $\rm XYZ=0$이면 기계는 파이프라인을 비운다(곧 앞선 명령들이 모두 활동을 마칠 때까지 멈춘다).
필드가 $\rm XYZ=1$이면 기계는 덜 과격하게 동작을 제어해서, 이 \.{SYNC}보다 앞선 저장 명령들이 모두 그 뒤의
저장 명령들보다 먼저 끝나게 한다. 필드가 $\rm XYZ=2$이면 기계는 동작을 제어해서, 이 \.{SYNC}보다 앞선 적재
명령들이 모두 그 뒤의 적재 명령들보다 먼저 끝나게 한다. 필드가 $\rm XYZ=3$이면 기계는 동작을 제어해서, 이
\.{SYNC}보다 앞선 {\it 적재나 저장\/} 명령들이 모두 그 뒤의 적재나 저장 명령들보다 먼저 끝나게 한다.
필드가 $\rm XYZ=4$이면 기계는 절전 방식으로 들어가는데, 이 방식에서는 어떤 ``깨움'' 신호를 받을 때까지 명령을
@^power-saver mode@>
더 느리게 실행할 수도(또는 아예 실행하지 않을 수도) 있다. 필드가 $\rm XYZ=5$이면 기계는 쓰기 버퍼를 비우고,
데이터 캐시가 있다면(2차 캐시가 있다면 그것까지) 청소한다. 캐시는 데이터를 간직하지만, 캐시의 내용이
메모리에도 나타나게 된다. 필드가 $\rm XYZ=6$이면 기계는 가상 주소 변환 캐시를 지운다(아래를 보라).
필드가 $\rm XYZ=7$이면 기계는 명령 캐시와 데이터 캐시를 지우는데, 데이터 캐시에 있던 정보 가운데 앞서 메모리에
없던 것은 버린다. (``지우기''는 ``청소하기''보다 강하다. 지운 캐시는 아무것도 기억하지 않는다. 지우기는
모든 것을 그냥 없애 버리므로 더 빠르기도 하다.) 필드가 $\rm XYZ>7$이면 불법 명령 인터럽트가 일어난다.

물론 메모리에서 적재하거나 메모리에 저장하는 명령과, 그 뒤에 정확히 같은 위치에서 적재하거나 거기에
저장하는 명령 사이에는 \.{SYNC}가 필요 없다. 그러나 입출력 과정이 보통의 계산과 나란히 일어나므로,
프로세서가 하나인 체계에서도 어떤 경우에는 \.{SYNC}가 필요할 수 있다.

경우 $\rm XYZ>3$은 운영체제만 쓸 수 있다는 뜻에서 {\it 특권\/} 명령이다. 더 정확히 말하면, $\rm
XYZ=4$나 $\rm XYZ=5$나 $\rm XYZ=6$이나 $\rm XYZ=7$인 \.{SYNC} 명령을 만나면, 그 인터럽트가 지금
금지되어 있지 않은 한 ``특권 명령 인터럽트''가 일어난다. 인터럽트를 금지할 수 있는 것은 운영체제뿐이다
(아래를 보라).
@^privileged operations@>

@* 트립과 트랩.
특수 레지스터 rA는 산술 예외에 관한 현재 상태 정보를 기록한다. 그 가장 작은 쪽 바이트에는 왼쪽에서
오른쪽으로 DVWIOUZX라고 부르는 ``사건'' 비트 여덟 개가 들어 있다. 여기서 D는 정수 나눗셈 검사,
V는~정수 넘침, W는~부동소수점-고정소수점 변환 넘침, I는~잘못된 연산, O는~부동소수점 넘침, U는~부동소수점
아래넘침, Z는~부동소수점 0으로 나누기, X는~부동소수점 부정확을 나타낸다.
% 아래 다섯 비트는 SPARC I의 관례와 맞는다
% 그러나 이를테면 Alpha는 VXUOZI 순서를 쓴다
rA의 그다음 바이트에는 이름이 DVWIOUZX로 같고 뜻도 같은 ``허용'' 비트 여덟 개가 들어 있다. 예외
상황이 일어나면 두 경우가 있다. 해당하는 허용 비트가~0이면 해당하는 사건 비트를~1로 만든다. 그러나
해당하는 허용 비트가~1이면, \MMIX는 현재의 명령 흐름을 가로막고 특별한 ``예외 처리기''를 실행한다.
그러니 사건 비트는 ``트립''하지 않은 예외들을 기록한다.
@^overflow@>
@^underflow@>
@^exceptions@>
@^handlers@>
@^float-to-fix exception@>
@^inexact exception@>
@^invalid exception@>
@^divide check exception@>

부동소수점 넘침은 늘 예외 두 개, O와~X를 일으킨다. (IEEE 표준을 가장 엄격하게 해석하면 부동소수점
넘침이 허용되지 않았을 때만 넘침에서 예외~X를 일으키겠지만, \MMIX는 넘친 결과를 늘 부정확하다고
여긴다.) 부동소수점 아래넘침은 아래넘침이 허용되지 않았을 때 늘 U와~X를 둘 다 일으키고, 아래넘침이
허용되었을 때는 U와~X를 둘 다 일으킬 수도 있다. 그런 경우에 허용 비트가 둘 다~1이면, 넘침이나
아래넘침 처리기를 부르고 부정확 처리기는 무시한다. 다른 종류의 예외는 모두 한 번에 하나씩 일어나므로,
``ropcode~2''(아래를 보라)가 예외를 일으키는 경우가 아니면 어느 예외 처리기를 불러야 하는지 모호할
일이 없다. 일반적으로 목록 DVWIOUZX에서 첫째로 허용된 예외가 우선한다.

상태 레지스터 rA의 위쪽 여섯 바이트는 어떨까? 지금은 그 48비트 가운데 두 비트만 정의되어 있다.
@^rA@>
@^rounding modes@>
나머지는 앞으로 있을지 모를 확장과 호환되도록 0이어야 한다. rA에서 $2^{17}$과 $2^{16}$에 해당하는 두
비트는 다음과 같이 반올림 방식을 지정한다. 00은 가장 가까운 쪽으로 반올림(기본값), 01은 버림(0 쪽으로),
10은 올림(양의 무한대 쪽으로), 11은 내림(음의 무한대 쪽으로)이다.
% Alpha의 관례는 다르다: nearest, off, up, down이 10, 00, 11, 01이다

@ \MMIX\ 프로그램의 실행은 여러 방식으로 가로막힐 수 있다. 방금 보았듯이 산술 예외는 허용되어 있으면
인터럽트를 일으킨다. 불법 명령이나 특권 명령, 또는 하드웨어가 제공하지 않고 소프트웨어로
@^illegal instructions@>
@^privileged operations@>
@^emulation@>
@^interrupts@>
@^I/O@>
@^input/output@>
에뮬레이트하는 명령도 그렇다. 입출력 연산이나 바깥 타이머는 인터럽트의 또 다른 흔한 원천이다.
운영체제는 \MMIX\ 프로세서 칩에 연결될 수 있는 모든 장치를 다루는 방법을 안다. 메모리 접근이 실패할
때도, 이를테면 메모리가 없거나 보호되어 있을 때도 인터럽트가 일어난다. 비상시에 기계가 계속 돌려고
예비 배터리 전원을 써야 하는 전원 고장이나, 패리티 오류 같은 하드웨어 고장도 모두 되도록 우아하게
처리해야 한다.

사용자는 \.{TRAP}이나 \.{TRIP} 명령을 명시적으로 내서 인터럽트를 억지로 일으킬 수도 있다.

\bull\<TRAP X,Y,Z `트랩'; \<TRIP X,Y,Z `트립'.\>
@.TRIP@>
@.TRAP@>
두 명령 모두 처리를 가로막고 처리기로 제어를 옮긴다. 둘의 차이는 \.{TRAP}은 운영체제가 처리하지만
\.{TRIP}은 사용자가 처리한다는 것이다. 더 정확히 말하면, \.{TRAP}의 X, Y, Z 필드는 운영체제 커널이
@^operating system@>
미리 정해 둔 특별한 뜻을 가진다. 이를테면 시스템 호출---이를테면 입출력 명령이나 메모리를 더
할당하는 명령---을 X, Y,~Z의 특정한 설정으로 불러낼 수 있다. 한편 \.{TRIP}의 X, Y, Z 필드는
사용자가 자기 응용을 위해 정의할 수 있고, 처리기도 사용자가 스스로 정의한다. 명령 \.{TRIP}이 불러내는
``트립 처리기'' 프로그램은 가로막을 수 있지만, \.{TRAP}을 처리하는 동안에는 보통 인터럽트가
금지된다. 명령 \.{TRIP}과 \.{TRAP}의 정확한 동작에 관한 구체적인 세부는, 처리기에서 가로막힌 프로그램으로
제어를 돌려주는 \.{RESUME}이라는 다른 명령의 설명과 함께 아래에 나온다.

\MMIX\ 아키텍처가 미리 정해 둔 \.{TRAP}의 변형은 두 가지뿐이다. 명령 \.{TRAP}에서 $\rm XYZ=0$이면
사용자 프로세스가 끝나야 한다. 필드가 $\rm XYZ=1$이면, 사용자가 특정한 종류의 인터럽트를 위한 처리기를
제공하지 않은 경우를 위해 운영체제가 기본 동작을 제공해야 한다(아래를 보라).

\MMIX\ 시뮬레이터와 함께 쓰는 원시적인 운영체제에는 \.{TRAP}의 변형이 몇 가지 더 정해져 있다. 간단한
입출력 연산을 할 수 있게 해 주는 이 변형들은 모두 $\xx=0$이고, Y~필드는 작은 양의 상수다. 이를테면
$\yy=1$이면 파일을 여는 \.{Fopen} 루틴을 불러낸다. (자세한 것은 {\mc MMIX-SIM} 프로그램을 보라.)
@^I/O@>
@^input/output@>

@ \MMIX에서 파국적이지 않은 인터럽트는 늘 {\it 정밀하다}. 곧 어떤 지점 앞의 올바른 명령들은 모두
사실상 실행되었고, 그 지점 뒤의 명령은 아직 하나도 실행되지 않았다는 뜻이다. 현재 명령은 인터럽트가
일어난 때에 끝났을 수도 있고 아닐 수도 있으며, 인터럽트를 처리한 뒤 다시 시작해야 할 수도 있고 아닐
수도 있다. 그 명령은 특수한 {\it 실행 레지스터\/}~rX에 넣고, 피연산자가 있으면 특수 레지스터 rY와~rZ에
넣는다. 그다음 명령의 주소는 특수한 {\it 가로막힌 곳 레지스터\/}~rW에 넣는다.
@^interrupts@>
@^rW@>
@^rX@>
@^rY@>
@^rZ@>
rX의 명령은 위치 $\rm rW-4$의 명령과 같지 않을 수도 있다. 이를테면 rW로 분기하거나 점프한 명령일 수도
있다. \MMIX\ 프로세서가 안에서 끼워 넣은 명령일 수도 있다. (이를테면 $L$이 지금 10보다 작으면,
컴퓨터는 \<ADD \$9,\$1,\$0 같은 명령 앞에 $L$을 늘리는 내부 명령을 조용히 끼워 넣는다. 끼워 넣은
명령과 \.{ADD} 사이에 인터럽트가 일어나면, rX의 명령은 \.{ADD}라고 말할 것이다. 내부 명령은 그것을
낳은 실제 명령의 정체를 간직하기 때문이다. 그러나 rW는 {\it 진짜\/} \.{ADD} 명령을 가리킬 것이다.)

명령이 ``\$X를 \$Y~op~\$Z의 결과로 정하라''나 ``\$X를 \$Y~op~Z의 결과로 정하라''라는 보통의 뜻을
가질 때는, 특수 레지스터 rY와~rZ가 명령의 Y와~Z 피연산자와 뻔한 방식으로 관련된다. 그러나 늘 그렇지는
않다. 이를테면 저장 명령이 가로막힌 뒤에는, 첫째 피연산자~rY에 가상 메모리 주소(\$Y에 \$Z나~Z를 더한
것)가 들어 있고, 둘째 피연산자~rZ는 메모리에 저장할 옥타바이트(\.{STB} 같은 경우에는 바뀌지 않은
바이트까지 포함한 것)다. 다른 경우에 rY와~rZ의 실제 내용은 \MMIX의 구현마다 정의하며, 프로그래머는
그 뜻에 기대면 안 된다.

어떤 명령은 예측할 수 없고 어쩌면 긴 시간이 걸리므로, 진행 중에 가로막아야 할 수도 있다. 이를테면
\.{FREM} 명령(부동소수점 나머지)은 첫째 피연산자의 지수가~2046이고 둘째 피연산자의 지수가~1이면
@.FREM@>
빨리 계산하기가 극히 어렵다. 그런 경우에 인터럽트 동안 저장한 rY와 rZ 레지스터는 반드시 피연산자의
원래 값이 아니라 계산의 현재 상태를 보여 준다. 그래도 $\rm rY\,{rem}\,rZ$의 값은 여전히 바라는
나머지이지만, rY는 지수가 rZ의 지수에 더 가까운 수로 줄어들었을 수도 있다. 인터럽트를 처리한 뒤에는
나머지 계산이 멈춘 곳에서 이어진다. (다른 방법으로, 나중에 보겠지만 \.{FREM}이나 심지어 \.{FADD}
같은 연산을 하드웨어가 아니라 소프트웨어로 구현할 수도 있다.)

또 다른 예는 \.{PREST}(미리 저장) 같은 명령에서 생긴다. 이 명령은 256바이트까지 미리 저장하도록
@.PREST@>
지정할 수 있다. \MMIX의 어떤 구현은 캐시 블록 크기에 따라 한 번에 32바이트나 64바이트만 미리
저장하기로 할 수도 있다. 그러면 rX의 내용을 바꾸어서, 일부만 끝난 \.{PREST} 명령의 끝나지 않은
부분을 나타낼 수 있다.

계수기 $G$를 줄이는 명령, 스택을 꺼내는 명령, 현재 문맥을 저장하는 명령, 옛 문맥을 되살리는 명령도 가로막을
수 있다. 레지스터~rX를 써서 일부만 끝났다는 정보를 전해서, 프로그램을 다시 시작한 뒤에는 가로막힘이
본질적으로 ``보이지 않게'' 한다.

@ 가로막힘에는 세 종류가 있다. 트립, 강제 트랩, 동적 트랩이다. 차례로 하나씩 다루자.
@^interrupts@>
@^trips@>
@^traps@>
@^forced traps@>
@^dynamic traps@>
@^handlers@>
@^operating system@>

명령 \.{TRIP}은 자기 자신을 실행 레지스터~rX의 오른쪽 절반에 넣고, 왼쪽 절반의 32비트를
@.TRIP@>
\Hex{80000000}으로 정한다. (그러니 rX는 {\it 음수\/}가 된다. 이 사실이 \.{RESUME} 명령에게 다시
\.{TRIP}하지 말라고 알려 준다.) 특수 레지스터 rY와 rZ는 \.{TRIP} 명령의 Y와 Z 필드가 지정하는
레지스터들, 곧 \$Y와~\$Z의 내용으로 정한다. 그다음 \$255를 특수한 {\it 부트스트랩
레지스터\/}~rB에 넣고, \$255를~rJ로 정한다. \MMIX는 이제 다음 명령을 가상 메모리 주소~0에서
@^rB@>
@^rJ@>
가져온다.

산술 예외는 허용되어 있으면 본질적으로 \.{TRIP}과 같은 방식으로 계산을 가로막는다. 유일한 차이는
그 처리기들이 rA의 예외 비트 D, V, W, I, O, U, Z,~X에 대해 각각 주소 16, 32, 48, 64, 80, 96, 112,~128에서
시작한다는 것이다. 레지스터 rY와~rZ는 앞에서 설명한 대로 가로막힌 명령의 피연산자로 정한다.

16바이트짜리 메모리 블록은 다음과 같은 명령 열을 담기에 딱 맞다.
$$\hbox{\tt PUSHJ 255,Handler; PUT rJ,\$255; GET \$255,rB; RESUME}$$
이것은 사용자의 처리기를 불러낸다. 그리고 사용자가 손수 설계한 처리기를 제공하지 않기로 하면,
운영체제가 다음 명령들로 기본 처리기를 제공한다.
$$\hbox{\tt TRAP 1; GET \$255,rB; RESUME.}$$

트립 처리기는 트립이 일어났다는 사실을 기록하기만 할 수도 있다. 그러나 산술 인터럽트의 처리기는
계산의 기본 결과를 바꾸고 싶을 수도 있다. 그런 경우에 처리기는 바라는 대체 결과를~rZ에 넣고, rX의 가장
큰 쪽 바이트를 \Hex{80}에서 \Hex{02}로 바꾸어야 한다. 아래에서 설명하는 \.{RESUME}의 규칙 때문에
이렇게 하면 바라는 효과를 얻는다. {\it 다만\/} \.{STB}나 \.{STSF} 같은 명령에서 예외가 일어났을
때는 그렇지 않다. (메모리에 저장하는 명령의 효과를 바꾸려면 일이 조금 더 필요하다.)

{\it 음수\/} 가상 위치에 있는 명령은 \.{TRIP}이든 산술 예외든 트립 처리기를 불러내지 않는다. 나중에
보겠지만, 그런 명령은 운영체제를 위해 남겨 둔 것이다.
@^negative locations@>

@ 명령 \.{TRAP}은 본질적으로 \.{TRIP}처럼 계산을 가로막지만, 다음과 같이 다르다.
@^interrupts@>
@^rT@>
@.TRAP@>
@^rK@>
(i)~인터럽트 마스크 레지스터~rK를 0으로 지워서 인터럽트를 금지한다. (ii)~제어는 0이 아니라 가상
메모리 주소~rT로 점프한다. (iii)~정보를 rB, rW, rX, rY,~rZ 대신 따로 된 특수 레지스터 모음 rBB,
@^rBB@>
@^rWW@>
@^rXX@>
@^rYY@>
@^rZZ@>
rWW, rXX, rYY,~rZZ에 넣는다. (이 특수 레지스터들이 필요한 것은 \.{TRIP}을 처리하는 동안 트랩이
일어날 수도 있기 때문이다.)

또 다른 종류의 강제 트랩은 어떤 명령을 하드웨어가 아니라 소프트웨어로 에뮬레이트하는 \MMIX\
구현에서 일어난다. 그런 명령은 연산 코드가 \.{FREM}이나 \.{FADD}나 \.{DIV} 같은 다른 것이더라도
\.{TRAP}을 일으킨다. 트랩 처리기는 rXX에 나타나는 연산 코드를 보고 어떤 명령을 에뮬레이트할지 알 수
있다. 그런 경우에 rXX의 왼쪽 절반은 \Hex{02000000}으로 정해진다. 이를테면 \.{FADD}를 에뮬레이트하는
처리기는 rYY와~rZZ의 부동소수점 합을 계산해서 결과를~rZZ에 넣어야 한다. 그러면 뒤이은
\.{RESUME}~\.1이 rZZ의 값을 알맞은 레지스터에 넣는다.
@^emulation@>
@^forced traps@>

메모리 보호 실패 때문에 저장 명령에서 강제 트랩이 일어나면, rYY와 rZZ의 값은 정의되지 않는다. 그
값들이 트립한 저장 명령 뒤에 트립 처리기에 주어지는 가상 주소 rY와 저장할 옥타바이트 rZ에 꼭
해당하지는 않는다. 강제 트랩은 그 명령을 되도록 빨리 중단하기 때문이다.

\MMIX의 구현은 아래에서 설명하는 가상 주소에서 물리 주소로 가는 변환 과정도, 페이지 테이블 계산을
하드웨어로 제공하지 않고 에뮬레이트할 수 있다. 그러면 이를테면 \.{LDB} 명령이 지정된 가상 주소에
해당하는 물리 메모리 주소를 모르면, rXX의 왼쪽 절반을 \Hex{03000000}으로 정하고 rYY를 문제의 가상
주소로 정해서 강제 트랩을 일으킨다. 트랩 처리기는 물리 페이지 주소를~rZZ에 넣어야 한다. 그러면
\.{RESUME}~\.1이 \.{LDB}를 마무리한다.

@ 셋째이자 마지막 종류의 인터럽트는 {\it 동적\/} 트랩이라고 부른다. 이런 가로막힘은 특수한
@^interrupts@>
@^dynamic traps@>
{\it 인터럽트 요청 레지스터\/}~rQ의 64비트 가운데 하나 이상이~1이 되고, 그에 해당하는 특수한 {\it
@^rQ@>
@^rK@>
인터럽트 마스크 레지스터\/}~rK의 비트도 적어도 하나가~1일 때 일어난다. rQ와~rK의 비트 위치는
일반적으로 다음 꼴이다.
$$\beginword
&\field{24}{24}&&\field88&&\field{24}{24}&&\field88\cr
\noalign{\hrule}
\\&낮은 우선순위 입출력&\\&프로그램&\\&높은 우선순위 입출력&\\&기계&\\\cr
\noalign{\hrule}\endword$$
여기서 8비트짜리 ``프로그램'' 비트들은 \.{rwxnkbsp}라고 부르며, 다음과 같은 뜻을 가진다.
$$\vbox{\halign{\.# 비트: &#\hfil\cr
r&읽기 허가가 없는 페이지에서 적재하려는 명령;\cr
w&쓰기 허가가 없는 페이지에 저장하려는 명령;\cr
x&실행 허가가 없는 페이지에 있는 명령;\cr
n&음수 가상 주소를 가리키는 명령;\cr
k&특권이 있어서 ``커널''만 쓰는 명령;\cr
b&\MMIX의 규칙을 어기는 명령;\cr
s&보안을 어기는 명령(아래를 보라);\cr
p&특권이 있는(음수) 가상 주소에서 온 명령.\cr}}$$
음수 주소는 운영체제만 쓴다. 음이 아닌 주소에 있는 명령을 rK의 \.{rwxnkbsp} 비트가 모두~1이 아닌 채로
@^operating system@>
@^protection bits@>
@^permission bits@>
@^security violation@>
@^privileged instructions@>
@^illegal instructions@>
@^page fault@>
실행하면 보안 위반이 일어난다. (그런 경우에는 rQ와~rK 둘 다의 \.s 비트가~1이 된다.)

rQ와 rK의 여덟 ``기계'' 비트는 가장 급한 종류의 인터럽트를 나타낸다. 가장 오른쪽 비트는 전원 고장을,
그다음은 메모리 패리티 오류를, 그다음은 없는 메모리를, 그다음은 재부팅을 나타내는 식이다. 고속
네트워크의 요청처럼 특히 빨리 처리해야 하는 인터럽트도 오른쪽 끝 가까이의 비트 위치를 받는다. 키보드
같은 우선순위 낮은 입출력 장치는 왼쪽의 비트를 받는다. 입출력 장치를 비트 위치에 할당하는 방식은
어떤 장치가 있느냐에 따라 구현마다 다를 것이다.
@^I/O@>
@^input/output@>

값 $\rm rQ\land rK$가 0이 아니게 되면, 기계는 정밀한 인터럽트를 줄 수 있을 때까지 잠깐 기다린다.
그다음 강제 트랩에서처럼 진행하는데, 다만 rT 대신 특수한 ``동적 트랩 주소 레지스터''~rTT를 쓴다.
위치~rTT에서 시작하는 트랩 처리기는 $\rm rQ\land rK$를 살펴서 인터럽트의 까닭을 알아낼 수 있다.
@^rTT@>
(이를테면 다음 명령들을 실행하고 나면
$$\hbox spread-10pt{\tt\spaceskip .5em minus .1em
 GET \$0,rQ; LDOU \$1,savedK; AND \$0,\$0,\$1; SUBU \$1,\$0,1;
   SADD \$2,\$1,\$0; ANDN \$1,\$0,\$1}$$
우선순위가 가장 높은 문제 비트가 \$1에 있고, 그 위치가~\$2에 있다.)
@^counting trailing zeros@>

가로막힌 명령이 rQ의 \.{rwxnkbsp} 비트 가운데 어느 것에 1을 보탰다면, 해당하는 비트가 rXX에서도~1이
된다. 동적 트랩 처리기는 이 정보를 쓸 수 있을지도 모른다(다만 $\rm rQ\land rK$의 오른쪽 절반이 0이
아니면 우선순위가 더 높은 인터럽트를 먼저 처리해야 한다).
@^rX@>

\MMIX의 규칙은 운영체제만 인터럽트를 억누른 채로 명령을 실행할 수 있도록 짜여 있다. 그러니 운영체제는
보통의 프로그램이라면 인터럽트를 일으켰을 명령을 실제로 쓸 수 있다. 레지스터 rK를 제어하는 것이 궁극의
특권이며, 어떤 뜻에서는 유일하게 중요한 특권인 것으로 드러난다.
@^privileged operations@>

동적 트랩을 일으키는 명령은 대개 가로막힘이 일어나기 전에 실행된다. 그러나 비트 \.x, \.k, \.b로
트랩하는 명령은 아무 일도 하지 않는다. \.r이나 \.n으로 트랩하는 적재 명령은 0을 적재한다.
비트 \.{rwxnkbsp} 가운데 어느 것으로든 트랩하는 저장 명령은 아무것도 저장하지 않는다.

@ 트립 처리기나 트랩 처리기가 할 일을 마치면, 대개 다음 명령을 불러낸다.

\bull\<RESUME Z `인터럽트 뒤 재개'; X와 Y 필드는 0이어야 한다.\>
@.RESUME@>
@^interrupts@>
@^handlers@>
이 명령의 Z 필드가 0이면, \MMIX는 특수 레지스터 rW, rX, rY,~rZ에 있는 정보를 써서 가로막힌 계산을
@^rW@>
@^rX@>
@^rY@>
@^rZ@>
@^rBB@>
@^rWW@>
@^rXX@>
@^rYY@>
@^rZZ@>
@^rK@>
다시 시작한다. 실행 레지스터 rX가 음수이면 그것은 무시하고 가상 주소~rW에서 시작하는 명령들을
실행한다. 그렇지 않으면 실행 레지스터의 오른쪽 절반에 든 명령을, 곧 설명할 몇 가지 수정을 거쳐서
위치 $\rm rW-4$에 있었던 것처럼 프로그램에 끼워 넣고, {\it 다음\/} 명령은 rW에서 가져온다.

명령 \.{RESUME}의 Z 필드가 1이고 이 명령이 음수 위치에 있으면, rW, rX, rY,~rZ 대신 레지스터 rWW, rXX,
rYY,~rZZ를 쓴다. 또 계산을 재개하기 바로 전에 마스크 레지스터 rK를 \$255로 정하고 \$255를 rBB로
정한다. (이 기능은 운영체제만 쓸 수 있다.)
@^operating system@>

운영체제 안의 인터럽트 처리기는 자기 자신이 가로막히는 것을 허락하기로 할 수도 있다. 그런 경우에는
rK를 0이 아니게 만들기 전에 rBB, rWW, rXX, rYY,~rZZ의 내용을 어떤 스택에 저장해야 한다. 그다음 바닥
수준의 인터럽트를 일으킨 것이 무엇이든 그것을 재개하기 전에, 모든 인터럽트를 다시 금지해야 한다.
이 일은 \.{TRAP}으로 할 수 있다. 트랩 처리기는 rWW의 가상 주소를 보고 자기를 운영체제가 불렀다는
것을 알 수 있기 때문이다. rK가 다시 0이 되면 rBB, rWW, rXX, rYY,~rZZ의 내용을 스택에서 되살리고,
바깥 수준의 인터럽트 마스크를 \$255에 넣으면, \<RESUME 1 이 일을 마무리한다.

1보다 큰 Z 값은 나중에 정의할지도 몰라서 남겨 두었다. 그래서 \MMIX의 지금 판에서 그런 값은 불법 명령
인터럽트를 일으킨다(곧 rQ의 `\.b' 비트를 켠다).
@^illegal instructions@>

실행 레지스터 rX가 음이 아니면, 그 가장 왼쪽 바이트가 오른쪽 절반을 프로그램에 끼워 넣는 방식을
제어한다. 이 바이트를 ``ropcode''라고 부르자. ropcode가~0이면 그냥 명령을 실행 흐름에 끼워 넣는다.
ropcode가~1이면 비슷하지만, 고려하는 연산에서 말이 된다면 두 피연산자 대신 rY와 rZ를 쓴다.
@^ropcodes@>

ropcode~2는 \$X를 rZ로 정하는 명령을 끼워 넣는다. 여기서 X는 rX의 오른쪽 절반의 둘째 바이트다. 이
ropcode는 보통 강제 트랩 에뮬레이션과 함께 쓰여서, 에뮬레이트한 명령의 결과가 올바른 레지스터에
들어가게 한다. 또 rX의 왼쪽에서 셋째 바이트를 써서, rZ를 \$X에 넣는 것과 동시에 산술 예외 DVWIOUZX
가운데 아무것이나 모두 일으킨다. 그래서 에뮬레이트한 명령과 명시적인 \.{TRAP} 명령도 보통의 명령처럼
이를테면 넘침을 일으킬 수 있다. (물론 이런 새 예외는 해당하는 비트가 rA에서 허용되어 있으면 트립
인터럽트를 낳을 수도 있다.)
@^rA@>
@^emulation@>

끝으로 ropcode 3은 ropcode 0과 같지만, rZ를 가상 주소~rY의 페이지 테이블 항목으로 다루라고 \MMIX에게
알리기도 한다. (아래의 가상 주소 변환에 관한 논의를 보라.) 3보다 큰 ropcode는 허용되지 않는다.
더욱이 \<RESUME 1 만 ropcode~3을 쓸 수 있다.

물론 \.{RESUME}~\.1이 ropcode를 볼 때는, 앞 문단들의 ropcode 규칙이 rW, rX, rY,~rZ 대신 rWW, rXX,
rYY, rZZ에 관한 것으로 이해해야 한다. 그래서 특히 ropcode~3은 늘 rYY와~rZZ에 적용되고, 결코 rY와~rZ에
적용되지 않는다.

재개가 제대로 동작하려면 특별한 제약이 지켜져야 한다. ropcode 0과~3은 \.{RESUME} 명령을 끼워 넣으면
안 된다. ropcode~1은 ``보통의'' 명령, 곧 연산 코드가 십육진 숫자 \Hex{0}, \Hex{1}, \Hex{2},
\Hex{3}, \Hex{6}, \Hex{7}, \Hex{C}, \Hex{D},~\Hex{E} 가운데 하나로 시작하는 명령을 끼워 넣어야
한다. (아래의 연산 코드 표를 보라.) 어떤 구현은 ropcode~1을 \.{SYNCD[I]}와 \.{SYNCID[I]}에도 허용해서,
그 명령들을 편리하게 가로막을 수 있게 할 수도 있다. 더욱이 ropcode 1이나~2와 함께 쓰는 목적지
레지스터 \$X는 가장자리이면 안 된다. 이 제약들은 모두 보통으로 쓸 때는 저절로 지켜진다. 프로그래머가
무언가 까다로운 일을 하려고 할 때만 관련이 있다.

조금 까다로운 명령 열
$$\hbox{\tt LDA \$0,Loc; PUT rW,\$0; LDTU \$1,Inst; PUT rX,\$1; RESUME}$$
은 거의 임의의 명령 \.{Inst}를 위치 \.{Loc-4}에 있었던 것처럼 실행한 다음, 위치 \.{Loc}으로 점프한다는
데 주목하라(\.{Inst}가 다른 곳으로 분기하지 않는다고 가정하면).

@* 특수 레지스터.
@^special registers@>
지금까지 꽤 많은 특수 레지스터를 언급했는데, \MMIX에는 실제로 그보다 더 많이 있다. 이제 그것들을
모두 안에서 쓰는 코드 번호와 함께 늘어놓을 때가 되었다.
$$\vbox{\halign{\hfil#,\quad&#;\hfil\cr
rA&산술 상태 레지스터 [21]\cr
rB&부트스트랩 레지스터(트립) [0]\cr
rC&계속 레지스터 [8]\cr
rD&피제수 레지스터 [1]\cr
rE&엡실론 레지스터 [2]\cr
rF&실패 위치 레지스터 [22]\cr
rG&전역 문턱 레지스터 [19]\cr
rH&곱 윗부분 레지스터 [3]\cr
rI&구간 계수기 [12]\cr
rJ&복귀 점프 레지스터 [4]\cr
rK&인터럽트 마스크 레지스터 [15]\cr
rL&지역 문턱 레지스터 [20]\cr
rM&멀티플렉스 마스크 레지스터 [5]\cr
rN&일련번호 [9]\cr
rO&레지스터 스택 오프셋 [10]\cr
rP&예측 레지스터 [23]\cr
rQ&인터럽트 요청 레지스터 [16]\cr
rR&나머지 레지스터 [6]\cr
rS&레지스터 스택 포인터 [11]\cr
rT&트랩 주소 레지스터 [13]\cr
rU&사용 계수기 [17]\cr
rV&가상 변환 레지스터 [18]\cr
rW&가로막힌 곳 레지스터(트립) [24]\cr
rX&실행 레지스터(트립) [25]\cr
rY&Y 피연산자(트립) [26]\cr
rZ&Z 피연산자(트립) [27]\cr
rBB&부트스트랩 레지스터(트랩) [7]\cr
rTT&동적 트랩 주소 레지스터 [14]\cr
rWW&가로막힌 곳 레지스터(트랩) [28]\cr
rXX&실행 레지스터(트랩) [29]\cr
rYY&Y 피연산자(트랩) [30]\cr
rZZ&Z 피연산자(트랩) [31]\cr}}$$
@^rG@>
@^rL@>
이 목록에서 rG와 rL은 지금까지 그냥 $G$와 $L$이라고 부른 것이다. 레지스터 rC, rF, rI, rN, rO, rS, rU,~rV는 앞에서 언급하지 않았다.

@ {\it 구간 계수기\/}~rI는 \MMIX\ 프로세서의 ``클럭 펄스''마다 1씩 준다. 그래서 \MMIX가 500 MHz로
@^rI@>
돌고 있으면 구간 계수기는 2나노초마다 준다. 이것은 0에 이르면 {\it 구간 인터럽트\/}를 일으킨다. 그런
인터럽트는 프로그램의 실제 실행 시간을 연구하는 수단인 ``연속 프로파일링''에 아주 쓸모 있을 수 있다.
Jennifer~M. Anderson, Lance~M. Berc, Jeffrey Dean, Sanjay Ghemawat, Monika~R. Henzinger,
Shun-Tak~A. Leung, Richard~L. Sites, Mark~T. Vandevoorde, Carl~A. Waldspurger, William~E. Weihl,
{\sl ACM Transactions on Computer Systems\/ \bf15}(1997), 357--390을 보라. 구간 인터럽트는 rQ의
``기계'' 바이트에서 가장 왼쪽의 다음 비트를~1로 만들어서 일으킨다. 이것은 가장 작은 쪽에서 일곱째
비트다.
@^rQ@>
@^continuous profiling@>
@^performance monitoring@>
@^Anderson, Jennifer-Ann Monique@>
@^Berc, Lance Michael@>
@^Dean, Jeffrey Adgate@>
@^Ghemawat, Sanjay@>
@^Henzinger, Monika Hildegard Rauch@>
@^Leung, Shun-Tak Albert@>
@^Sites, Richard Lee@>
@^Vandevoorde, Mark Thierry@>
@^Waldspurger, Carl Alan@>
@^Weihl, William Edward@>

{\it 사용 계수기\/}~rU는 세 필드 $(u_p,u_m,u_c)$로 이루어지는데, 이것들을 사용 패턴~$u_p$, 사용
@^rU@>
마스크~$u_m$, 사용 횟수~$u_c$라고 부른다. rU의 가장 큰 쪽 바이트가 사용 패턴이고, 그다음 바이트가
사용 마스크이며, 나머지 48비트가 사용 횟수다. 조건 ${\rm OP}\land u_m=u_p$를 만족하는 명령을 실행할 때마다 $u_c$의
값이 ($2^{47}$을 법으로) 1씩 는다. 그래서 이를테면 아래의 OP 코드 표에 따르면, $u_p=u_m=0$이면 모든
명령을 센다. 패턴이 $u_p=(10000000)_2$이고 $u_m=(11000000)_2$이면 모든 적재와 저장을 \.{GO}와 \.{PUSHGO}와
함께 센다. 패턴이 $u_p=0$이고 $u_m=(11100000)_2$이면 모든 부동소수점 명령을 고정소수점 곱셈과 나눗셈과 함께
센다. 패턴이 $u_p=(00011000)_2$이고 $u_m=(11111000)_2$이면 고정소수점 곱셈과 나눗셈만 센다. 패턴이 $u_p=\.{POP}$이고
$u_m=(11111111)_2$이면 완료된 서브루틴 호출을 센다. 운영체제에 속하는 음수 위치의 명령은 예외다. 그런
명령은 $u_c$의 앞자리 비트가~1일 때만 사용 횟수에 들어간다.
@^negative locations@>

덧붙여, 64비트 계수기 rI는 ``자리올림 보존 덧셈''이라는 옛 기법을 써서 논리 두 단계만으로 꽤 싸게
구현할 수 있다[이를테면 G.~Metze와 J.~E. Robertson, {\sl Proc.\ International Conf.\ Information
Processing\/}(Paris:\ 1959), 389--396을 보라]. 이 착상을 멋지게 구현하는 방법 하나는 이진수~$x$를 두
@^Metze, Gernot@>
@^Robertson, James Evans@>
@^carry-save addition@>
이진수의 차 $x'-x''$라는 여분이 있는 꼴로 나타내는 것이다. 그런 수 둘은 자리올림을 전파하지 않고도
다음과 같이 더할 수 있다.
$$f(x,y,z)=
 (x\land\bar y)\lor(x\land z)\lor(\bar y\land z), \qquad
% ((x\oplus y)\land(x\oplus z))\oplus z, \qquad
  g(x,y,z)=x\oplus y\oplus z$$
라고 하자. 그러면 $x-y+z=2f(x,y,z)-g(x,y,z)$임을 쉽게 확인할 수 있다. 변수 $x$, $y$,~$z$가 0이나~1인
여덟 경우에서만 확인하면 된다. 따라서 계수기 $x'-x''$에서 1을 빼려면
$$(x',x'')\gets(f(x',x'',-1)\LL1,\;g(x',x'',-1))$$
로 정하면 된다. 1을 더하려면 $(x',x'')\gets(g(x'',x',-1),f(x'',x',-1)\LL1)$로 정하면 된다. 결과는
$x'=x''$일 때, 그리고 그때에만 0이다. 레지스터를 살펴보아야 할 때까지는 차 $x'-x''$를 실제로 계산할
필요가 없다. 특별한 경우 $z=0$과 $z=-1$에서는 $f(x,y,z)$와 $g(x,y,z)$의 계산이 특히 단순하다. 비슷한
기법이 rU에도 통하지만, 그 경우에는 명령 여러 개가 동시에 끝날 수도 있으므로 더 조심해야 한다.
(이 문단을 고쳐 준 Frank Yellin에게 감사한다.)
@^Yellin, Frank Nathan@>

@ 특수한 {\it 일련번호 레지스터\/}~rN의 가장 작은 쪽 다섯 바이트는, 이 \MMIX\ 개체가 만들어진
@^rN@>
시각(1970년 1월~1일 그리니치 평균시 00:00:00부터 센 초의 수)으로 영구히 정해진다. 가장 큰 쪽 세
바이트는 구현하는 \MMIX\ 아키텍처의 {\it 판 번호\/}와, 판 번호를 한정하는 두 바이트로 영구히 정해진다.
이 양은 \MMIX의 사본마다 사실상 고유한 식별 번호 구실을 한다.
@^version number@>

이 문서는 아키텍처의 1.0.0판을 설명한다. 1.0.1판은 비슷하지만, 파이프라인과 운영체제의 복잡함을
피하도록 단순하게 만든 것이다. 앞으로 다른 판이 필요해질 수도 있다.

@ {\it 레지스터 스택 오프셋\/}~rO와 {\it 레지스터 스택 포인터\/}~rS는 특히 흥미롭다. 이것들은
@^register stack@>
@^rO@>
@^rS@>
\MMIX의 레지스터 스택~$S[0]$, $S[1]$, $S[2]$,~\dots를 구현하는 데 쓰이기 때문이다.

운영체제는 돌고 있는 프로세스마다 \Hex{6000000000000000} 같은 주소에서 시작하는 가상 메모리의 넓은
영역을 배정해서 레지스터 스택을 초기화한다. 이 시작 주소가~$\sigma$이면, 스택 항목 $S[k]$는
옥타바이트 $\mm_8[\sigma+8k]$로 간다. 프로세스에게는 $\mm[\sigma-1]$에서 읽을 허가가 없으므로 스택
아래넘침은 들킨다. 스택 넘침도 들킨다. 레지스터 스택이 가상 메모리의 $2^{61}$~바이트를 채우기 훨씬
전에 무언가---사용자의 예산이든, 사용자의 인내심이든, 사용자의 스왑 공간이든---가 바닥날 것이기
때문이다.
@^terabytes@>

\MMIX\ 하드웨어는 64비트 범용 레지스터의 뱅크를 둘 두어서 레지스터 스택을 유지한다. 하나는 전역
레지스터를 위한 것이고, 다른 하나는 지역 레지스터를 위한 것이다. 전역 레지스터 $\rm g[32]$, $\rm
g[33]$, \dots, $\rm g[255]$는 \MMIX\ 명령에서 $\ge\gg$인 레지스터 번호에 쓰인다. 계수기 $G$가 늘 32 이상이라는
것을 떠올려라. 지역 레지스터는 $8\le n\le10$인 어떤~$n$에 대해 레지스터가 $2^n$개 든 다른 배열에서
온다. 설명을 단순하게 하려고 지역 레지스터가 정확히 512개 있다고 가정하지만, 256개뿐일 수도 있고
1024개일 수도 있다.

\def\l{{\rm l}}
@^ring of local registers@>
지역 레지스터 자리 l[0], l[1], \dots, l[511]은 주소가 512를 법으로 돌아가는 순환 버퍼 구실을 한다. 그래서
$\l[512]=\l[0]$, $\l[513]=\l[1]$ 따위가 성립한다. 이 버퍼는 포인터 셋으로 세 부분으로 나뉘는데, 그
포인터들을 $\alpha$, $\beta$, $\gamma$라고 부르자.
$$\mplibcode
beginfig(1)
numeric r; r=.5in; % 원의 반지름
numeric rr; rr=.9in; % 호의 반지름

pickup pencircle scaled .6pt;
draw (r,0){up}...(0,r){left}...(-r,0){down}...(0,-r){right}...cycle;
pickup pencircle scaled .3pt;
for a=-45, 30, 180:
  z[a]=(r+10pt,0) rotated (a+10);
  draw ((r-4pt,0)--(r+20pt,0)) rotated a;
endfor
label.rt(btex $\alpha$ etex,z[-45]-(2pt,6pt));
label.rt(btex $\beta$ etex,z[30]+(0,2pt));
label.lft(btex $\gamma$ etex,z[180]);

drawdblarrow ((rr,0) rotated-45){dir 45}...((rr,0) rotated 30){dir 120};
label.rt(btex $L$ etex,(rr+8pt,0) rotated -10);
endfig;
\endmplibcode$$
레지스터 $\l[\alpha]$, $\l[\alpha+1]$, \dots,~$\l[\beta-1]$은 지금 프로그램의 명령들이 \$0, \$1,
\dots,~$\$(\ll-1)$이라고 부르는 것이다. 레지스터 $\l[\beta]$, $\l[\beta+1]$, \dots,~$\l[\gamma-1]$은
지금 쓰이지 않는다. 레지스터 $\l[\gamma]$, $\l[\gamma+1]$, \dots,~$\l[\alpha-1]$에는 밀려 내려갔지만
아직 메모리에 저장되지 않은 레지스터 스택의 항목들이 들어 있다. 특수 레지스터~rS에는 필요할 때
$\l[\gamma]$를 저장할 가상 메모리 주소가 들어 있다. 특수 레지스터~rO에는 $\l[\alpha]$를 저장할 주소가
들어 있는데, 이것은 늘 $8\tau$에 $S[0]$의 주소를 더한 것과 같다. 다음이 성립하므로 rL, rO,~rS의
내용에서 $\alpha$, $\beta$,~$\gamma$의 값을 알아낼 수 있다.
$$\rm\alpha=(rO/8)\bmod512,\qquad \beta=(\alpha+rL)\bmod512,\qquad
\gamma=(rS/8)\bmod512.$$

이런 상황을 유지하려면 포인터 $\alpha$, $\beta$, $\gamma$가 결코 서로를 지나쳐 가지 않게 해야 한다.
연산 \.{PUSHJ}나 \.{PUSHGO}는 그냥 $\alpha$를~$\beta$ 쪽으로 나아가게 하므로 아주 단순하다. 포인터 $\beta$를 $\alpha$ 쪽으로 옮기는 \.{POP} 연산의 앞부분도 아주 단순하다. 그러나 \.{POP}의 뒷부분에서는
$\alpha$가 아래로 움직여야 하는데, 메모리에 접근해야 할 수도 있다. \MMIX는 $\alpha$가 $\gamma$를
지나 줄어들지 않도록, 필요하면 한 번 이상 rS를 8만큼 줄이고(그래서 $\gamma$를 1만큼 줄이고)
$\l[\gamma]\gets\mm_8[{\rm rS}]$로 정한다. 마찬가지로 $L$을 늘리는 연산은, $\beta$가 $\gamma$를 지나
늘어나지 않도록, \MMIX가 한 번 이상 $\mm_8[{\rm rS}]\gets\l[\gamma]$로 정하고 rS를 8만큼 늘리게(그래서
$\gamma$를 1만큼 늘리게) 할 수도 있다. (사실 $\beta$는 $\gamma$와 {\it 같아지는\/} 데까지 늘어나는
것조차 허락되지 않는다.) 한꺼번에 많은 레지스터를 적재하거나 저장해야 하면, 이 연산들은 가로막을 수
있다.

[David R. Ditzel과 H.~R. McLellan이 {\sl SIGPLAN Notices\/ \bf17},\thinspace4(1982년 4월),
48--56에서 조금 비슷한 방식을 도입했고, AT{\AM}T 벨 연구소에서 개발한 이른바 {\mc CRISP}
아키텍처에 그것을 넣었다. 1980년대 후반에 Advanced Micro Devices는 Am29000 시리즈의 프로세서에 이보다
@^AT{\AM}T Bell Laboratories@>
@^Advanced Micro Devices@>
훨씬 더 비슷한 방식을 채택했다. 그 컴퓨터 가족의 명령은 본질적으로 \MMIX가 쓰는 `OP~X~Y~Z' 형식을
가진다.]
@^Ditzel, David Roger@>
@^McLellan, Hubert Rae, Jr.@>

레지스터가 더 적은, 제한된 판의 \MMIX도 생각해 볼 수 있다. 이를테면 지역 레지스터가 $\l[0]$, $\l[1]$,
\dots,~$\l[31]$의 32개뿐이고 전역 레지스터가 $\rm g[224]$, $\rm g[225]$, \dots,~$\rm g[255]$의
32개뿐일 수도 있다. 그런 기계는 부등식 $\ll<32$와 $\gg\ge224$를 지키는 \MMIX\ 프로그램이라면 무엇이든
돌릴 수 있을 것이다.

@ \MMIX의 특수 레지스터에는 \.{GET}과 \.{PUT} 명령으로 접근한다.
@^special registers@>
@^rL@>
@^rQ@>

\bull\<GET \$X,Z `특수 레지스터에서 얻기'; Y 필드는 0이어야 한다.\>
@.GET@>
앞에서 늘어놓은 코드 번호를 써서, 코드 번호~Z로 식별하는 특수 레지스터의 내용으로 레지스터~X를
정한다. 번호가 $\zz\ge32$이면 불법 명령 인터럽트가 일어난다.

특수 레지스터는 모두 읽을 수 있다. \MMIX는 호기심 많은 사용자에게 비밀을 두지 않는다. 그러나 물론
rK와~rQ(인터럽트 마스크 레지스터와 요청 레지스터) 같은 레지스터는 운영체제만 바꿀 수 있다. 그리고
@^operating system@>
rN~(일련번호)이나 스택 포인터 rO와~rS는 운영체제조차 바꿀 수 없다.

\bull\<PUT X,\0 `특수 레지스터에 넣기';
@.PUT@>
Y 필드는 0이어야 한다.\>
허용되는 경우에, X로 식별하는 특수 레지스터를 레지스터 Z의 내용이나 부호 없는 바이트~Z 자체로 정한다.
그러나 어떤 변경은 허용되지 않는다. rA에서 늘 0인 비트들은 0으로 남아야 한다. rG와 rL의 앞쪽 일곱
바이트는 0으로 남아야 하고, rL은~rG를 넘으면 안 된다. 특수 레지스터 9--11(곧 rN, rO,~rS)은 바뀌면
안 된다. 특수 레지스터 8과 12--18(곧 rC, rI, rK, rQ, rT, rU, rV,~rTT)은 rK의 특권 비트가 0일 때만 바꿀
수 있다. 그리고 rQ의 어떤 비트들은 (있는 하드웨어에 따라) 소프트웨어가 0에서~1로 바꾸지 못하게 할
수도 있다. 더욱이 가장 최근의 \<GET x,rQ 뒤로 0에서~1로 바뀐 rQ의 비트들은 \.{PUT}~\.{rQ,z} 뒤에도~1로
남는다. 명령 \.{PUT}은 rL을 늘리지 않는다. rL을 현재 값과 새 값 가운데 작은 것으로 정한다. (rL이
100보다 작다는 것을 알 때, 프로그램은 \<PUT rL,100 대신 \<SETL \$99,0 이라고 해야 한다.)

허용되지 않는 \.{PUT} 명령은 불법 명령 인터럽트를 일으키거나, (rC, rI, rK, rQ, rT, rU, rV,~rTT의
경우에는) 특권 연산 인터럽트를 일으킨다.
@^illegal instructions@>
@^privileged operations@>

\bull\<SAVE \$X,0 `프로세스 상태 저장';
@.SAVE@>
@^register stack@>
@^ring of local registers@>
@^rO@>
@^rS@>
\<UNSAVE 0,\$Z `프로세스 상태 되살리기'. Y~필드는 0이어야 하고, \.{SAVE}의 Z
필드와 \.{UNSAVE}의 X~필드도 그래야 한다.\>
@.UNSAVE@>
명령 \.{SAVE}는 지금 돌고 있는 프로세스의 계산에 영향을 줄 수 있는 레지스터와 특수 레지스터를 모두
저장한다. 먼저 현재 지역 레지스터 \$0, \$1, \dots,~$\$(\ll-1)$을 \.{PUSHGO}~\.{\$255}에서처럼 밀어
넣고, $L$을 0으로 정한다. 그다음 현재 전역 레지스터 $\$\gg$, $\$(\gg+1)$, \dots,~\$255를 레지스터
스택에서 그 위에 넣는다. 마지막으로 rB, rD, rE, rH, rJ, rM, rR, rP, rW, rX, rY,~rZ를 맨 꼭대기에 넣고,
그 뒤에 레지스터 rG와 rA를 여덟 바이트에 모아 넣는다.
$$\beginword
&\field88&&\field{24}{24}&&\field{32}{32}\cr
\noalign{\hrule}
\\&rG&\\&0&\\&rA&\\\cr
\noalign{\hrule}\endword$$
그다음 가장 위에 있는 옥타바이트의 주소를 레지스터~X에 넣는데, 이것은 전역 레지스터여야 한다.
(이 명령은 가로막을 수 있다. 레지스터를 저장하는 동안 인터럽트가 일어나면, 지역 레지스터의 고리에서
$\alpha=\beta=\gamma$가 된다. 그래서 rO는~rS와 같고 rL은 0이 된다. 인터럽트 처리기는 본질적으로
일부만 저장한 문맥 위에서 시작하는 새 레지스터 스택을 가진다.) 명령 \.{SAVE} 바로 뒤에 rO와~rS의 값은 방금
저장한 스택의 바로 다음 첫 바이트의 위치와 같다. 이 시점에서 현재 레지스터 스택은 사실상 비어 있다.
그러니 이 문맥이나 다른 어떤 문맥을 되살리기 전까지는 \.{POP}을 하면 안 된다.
@^rO@>
@^rS@>

명령 \.{UNSAVE}는 반대로 간다. 앞선 \.{SAVE}가 돌려준 주소를 레지스터~Z에 주면 모든 레지스터를
되살린다. 명령 \.{UNSAVE} 바로 뒤에 rO와~rS의 값은 같다. 명령 \.{SAVE}처럼 이 명령도 가로막을 수 있다.

운영체제는 \.{SAVE}와 \.{UNSAVE}로 서로 다른 프로세스 사이에서 문맥을 바꾼다. 명령 \.{UNSAVE}로 rO와~rS의
알맞은 초깃값을 정할 수도 있다. 그러나 자기가 무엇을 하는지 아는 사용자 프로그램은 실제로 자기
레지스터 스택을 하나든 여럿이든 할당하고 프로세스 전환을 스스로 할 수 있다.

주의: \.{UNSAVE}는 파괴적이다. 곧 프로그램은 같은 저장된 문맥에서 믿을 만하게 두 번 되살릴 수 없다.
한 번 되살리고 나면, 그 뒤의 연산이 저장된 것의 메모리 기록을 바꾸기 쉽다. 더욱이 \.{UNSAVE}의 한가운데서
인터럽트가 일어나면, \.{UNSAVE}가 완전히 끝나기 전에 메모리의 데이터 일부를 이미 망가뜨렸을 수도 있다.
그래도 모든 레지스터에는 데이터가 제대로 나타난다.

@* 가상 주소와 물리 주소.
64비트 가상 주소는 특수한 {\it 가상 변환 레지스터\/}~rV가 다스리는 방식으로 물리 주소로 바뀐다. 따라서
@^virtual addresses@>
@^physical addresses@>
@^rV@>
$\rm M[A]$는 실제로 $\rm m[\phi(A)]$를 가리킨다. 여기서 m은 물리 메모리 배열이고, $\phi(A)$는 물리 사상
함수~$\phi$가 정한다. 이 변환의 세부는 꽤 기술적이고 주로 운영체제에게나 관심거리이지만, 보통의
사용자에게도 중요한 단순한 규칙이 두 가지 있다.
@^operating system@>

\bull 음수 주소는 그냥 부호 비트를 없애서 곧바로 물리 주소로 사상한다.
@^negative locations@>
$$\phi(A)=A+2^{63}=A\land\Hex{7fffffffffffffff},\qquad
\hbox{단, $A<0$.}$$
{\it 음수 주소에 대한 접근은 모두 특권이 있어서\/} 운영체제만 쓸 수 있다.
@^privileged operations@>
(그래서 이를테면 rT와~rTT의 트랩 주소는 음수여야 한다. 그것들은 운영체제 안의 주소이기 때문이다.)
더욱이 $\ge2^{48}$인 물리 주소는 모두 메모리 사상 입출력 장치가 쓰도록 되어 있다. 그런 위치에서 읽거나
그런 위치에 쓰는 값은 결코 캐시에 넣지 않는다.
@^I/O@>
@^input/output@>
@^memory-mapped input/output@>

\bull 음이 아닌 주소는 앞쪽 세 비트가 000, 001, 010, 011 가운데 무엇인지에 따라 네 {\it 세그먼트\/}에
@^segments@>
속한다. 이 $2^{61}$바이트짜리 세그먼트들은 전통적으로 각각 프로그램의 텍스트, 데이터, 동적 메모리,
레지스터 스택에 쓰지만, 그런 관례를 꼭 지켜야 하는 것은 아니다. 61비트 주소를 48비트 물리 메모리
공간으로 보내는 사상이 세그먼트마다 하나씩 네 개, 곧 $\phi_0$, $\phi_1$, $\phi_2$,~$\phi_3$가 있다.
$$\phi(A)=\phi_{\lfloor A/2^{61}\rfloor}(A\bmod2^{61}),\qquad
\hbox{단, $0\le A<2^{63}$.}$$
일반적으로 기계는 세그먼트의 작은 주소에 큰 주소보다 더 효율적으로 접근할 수 있다. 그러니 임의의
주소가 모두 합법이긴 하지만, 프로그래머는 세그먼트마다 0에서부터 위로 자라게 해서, 61비트 주소가
필요 이상으로 커지지 않도록 애써야 한다.

@ 이제 가상 주소 변환의 기술적인 세부를 볼 때가 되었다. 사상 $\phi_0$, $\phi_1$, $\phi_2$,~$\phi_3$는
@^segments@>
@^virtual addresses@>
@^physical addresses@>
@^rV@>
다음 규칙으로 정의한다.
\smallskip

(1) rV의 처음 두 바이트는 $b_1$, $b_2$, $b_3$, $b_4$라고 부르는 니블 넷이다. 니블 $b_0$도 0으로 정의한다.
세그먼트~$i$에는 페이지가 많아야 $1024^{\,b_{i+1}-b_i}$개 있다. 특히 $b_i=b_{i+1}$이면 세그먼트~$i$에는
페이지가 많아야 하나 있어야 하고, $b_i>b_{i+1}$이면 세그먼트~$i$는 완전히 비어 있어야 한다.

(2) rV의 그다음 바이트~$s$는 현재 {\it 페이지 크기\/}를 지정하는데, 그 크기는 $2^s$바이트다. 조건
$s\ge13$을 지켜야 한다(그래서 페이지마다 적어도 8192~바이트다). 메모리 보호와 스와핑은 페이지 전체에
적용되므로, 이를테면 20쯤보다 큰 $s$의 값은 주 메모리에 오랫동안 머무는 꽤 큰 프로그램에서만 쓸모
있다. 바이트 $s$의 합법적인 가장 큰 값은~48이다.

(3) rV의 나머지 다섯 바이트는 27비트 {\it 뿌리 위치\/}~$r$, 10비트 {\it 주소 공간 번호\/}~$n$,
3비트 {\it 기능 필드\/}~$f$다.
$$\centerline{$\hbox{rV}=\beginword
&\field44&&\field44&&\field44&&\field44&&\field88&&
 \field{27}{27}&&\field{10}{10}&&\field33\cr
\noalign{\hrule}
\\&$b_1$&\\&$b_2$&\\&$b_3$&\\&$b_4$&\\&$s$&\\&$r$&\\&$n$&\\&$f$&\\\cr
\noalign{\hrule}\endword$}$$
보통은 $f=0$이다. 필드가 $f=1$이면 가상 주소 변환을 하드웨어가 아니라 소프트웨어가 하고, 하드웨어는 rV의
$b_1$, $b_2$, $b_3$, $b_4$,~$r$ 필드를 무시한다. (1보다 큰 $f$ 값은 앞으로 쓸지도 몰라서 남겨 두었다. \MMIX가
주소를 변환하려 할 때 $f>1$이면 메모리 보호 실패가 일어난다.)
@^illegal instructions@>

(4) 페이지마다 8바이트짜리 {\it 페이지 테이블 항목\/}(PTE)이 있는데, 다음과 같이 생겼다.
@^page table entry@>
@^PTE@>
$$\centerline{$\hbox{PTE}=\beginword
&\field{16}{16}&&\field{32}{48-s}&&\field3{s-13}&&\field{10}{10}&&
 \field33\cr
\noalign{\hrule}
\\&$x$&\\&$a$&\\&$y$&\\&$n$&\\&$p$&\\\cr
\noalign{\hrule}\endword$}$$
여기서 $x$와 $y$는 무시한다(그래서 운영체제가 아무 목적에나 쓸 수 있다). 값 $2^s a$는 페이지의 바이트~0의
물리 주소이고, $n$은 주소 공간 번호다(rV의 번호와 맞아야 한다). 마지막 세 비트는 {\it 보호 비트\/}
$p_r\,p_w\,p_x$다. 사용자가 이 페이지에서 적재하려면 $p_r=1$이어야 하고, 이 페이지에 저장하려면
$p_w=1$이어야 하고, 이 페이지의 명령을 실행하려면 $p_x=1$이어야 한다. 번호 $n$이 rV의 번호와 맞지 않거나
알맞은 보호 비트가 0이면 메모리 보호 결함이 일어난다.
@^protection fault@>

페이지 테이블 항목은 운영체제만 쓸 수 있어야 한다. 필드 $x$의 무시되는 16비트는 물리 메모리 크기가
$2^{48}$바이트(곧 넉넉한 256 테라바이트)로 제한된다는 뜻이다. 새 천 년 내내는 아니더라도 한동안은
그만하면 넉넉할 것이다.
@^terabytes@>

(5) 주어진 61비트 주소 $A$는 그 세그먼트의 페이지 $\lfloor A/2^s\rfloor$에 속한다. 그리고 $a$가
세그먼트~$i$의 페이지 $\lfloor A/2^s\rfloor$를 위한 PTE의 주소이면
$$\phi_i(A)=2^s\,a+(A\bmod2^s)$$
이다.

(6) 값 $\lfloor A/2^s\rfloor$가 1024진법으로 $(a_4a_3a_2a_1a_0)_{1024}$라고 하자. 흔한 경우인
$a_4=a_3=a_2=a_1=0$이면 PTE는 그냥 옥타바이트 ${\rm m}_8[2^{13}(r+b_i)+8a_0]$이다. 이 규칙이 처음
1024개 페이지의 사상을 정의한다. 그다음 백만 개쯤의 페이지는 ${\rm m}_8[2^{13}(r+b_i+1)+8a_1]$에 있는
보조 {\it 페이지 테이블 포인터\/}
@^page table pointer@>
@^PTP@>
$$\centerline{$\hbox{PTP}=\beginword
&\field11&&\field{50}{50}&&\field{10}{10}&&\field33\cr
\noalign{\hrule}
\\&1&\\&$c$&\\&$n$&\\&$q$&\\\cr
\noalign{\hrule}\endword$}$$
를 거쳐 접근한다. 여기서 부호는~1이어야 하고 $n$ 필드는 rV와 맞아야 하지만, $q$~비트들은 무시한다.
그러면 페이지 $(a_1a_0)_{1024}$를 위한 바라는 PTE는 ${\rm m}_8[2^{13}c+8a_0]$에 있다. 그다음 십억 개쯤의
페이지, 곧 $a_2\ne0$인 페이지 $(a_2a_1a_0)_{1024}$는 비슷하게 둘째 수준의 보조 PTP를 거쳐 접근한다.
그다음도 마찬가지다.

니블이 $b_3=b_4$이면 세그먼트~3에는 페이지가 하나뿐이고, 그 PTE는 물리 위치 $2^{13}(r+b_3)$에 홀로 나타난다는
데 주목하라. 그렇지 않으면 PTE들은 1024옥타바이트짜리 블록에 나타난다. 보통은 $0<b_1<b_2<b_3<b_4$이지만,
빈 경우 $b_1=b_2=b_3=b_4=0$은 짚어 둘 만하다. 이 특별한 경우에는 페이지가 하나뿐이고, 가상 주소의
세그먼트 비트는 무시한다. 가상 주소마다 나머지 $61-s$비트는 0이어야 한다.

매개변수가 $s=13$, $b_1=3$, $b_2=2$, $b_3=1$, $b_4=0$이면, 저마다 8192바이트인 페이지가 많아야 $2^{30}$개 있고,
모두 세그먼트~0에 속한다. 이것은 본질적으로 {\mc DIGITAL~UNIX}$^{\rm\,TM}$을 쓰는 Alpha~21064
컴퓨터의 가상 메모리 설정이다.
@^Alpha computers@>

몇몇 특별한 경우는 기묘하게 동작하는데, 아마 쓸모 있지는 않을 것이다. 그래도 이 방식이 얼마나
유연한지 분명히 하려고 크누스는 그것들을 언급해 둔다. 이를테면 $b_1=2$, $b_2=b_3=1$, $b_4=5$이면,
$r+1$이 세그먼트~0의 PTP와 세그먼트~2의 PTE 모두에 쓰인다. 그리고 $b_2=b_3<b_4$이면, $r+b_2$가 세그먼트
2와~3의 페이지~0의 PTE에 쓰인다. 세그먼트~2의 페이지~1은 허용되지 않지만, 세그먼트~3에는 페이지~1이
있다.

크누스는 이 규칙들이 지독하게 복잡해 보인다는 것을 알고, 실제로 단순하면서도 효율적인 다른 방법을
찾을 수 있었다면 좋았겠다고 진심으로 바란다고 적었다. 그는 해싱에 바탕을 둔 여러 방식을 시도했지만,
이 응용에는 여기서 설명한 것 같은 ``트라이'' 방법이 더 낫다는 결론에 이르렀다. 사실 오늘날 대부분의
컴퓨터의 페이지 테이블은 아주 비슷한 착상에 바탕을 두고 있다. 다만 가상 주소가 훨씬 작고, 작은
페이지 번호를 위한 지름길이 없다. 그는 rV와 페이지 테이블의 형식을 바이트 경계에 더 알맞게 맞추려고도
해 보았지만, 그러면 페이지 크기가 잘 맞지 않았다. 다행히 이 지저분한 세부는 거의 언제나 보통의
사용자에게 완전히 감추어져 있다.

스택 넘침은 문제가 될 수 있다. 포인터 $\gamma$가 쓰기 허가가 없는 새 페이지의 가상 주소로 늘어나면, 보호
@^Stack overflow@>
인터럽트 처리기가 일할 스택 공간이 없을 것이다! 그래서 \MMIX에는 ``계속 페이지''의 물리 주소를 담은
{\it 계속 레지스터\/}~rC가 있다. 밀려 내려간 정보는 \MMIX가 안전하게 가로막을 수 있는 명령에 이를
@^rC@>
때까지 계속 페이지에 쓴다. 그다음 스택 넘침 인터럽트가 일어나고, 운영체제가 질서를 되찾을 수 있다.
rC의 형식은 $n$ 필드를 무시한다는 것 말고는 보통의 PTE 항목과 똑같다.

@ 물론 \MMIX가 메모리에 접근할 때마다 물리 주소를 길게 계산할 여유는 없다. 그래서 기계는 최근에
접근한 페이지들의 변환을 담은 {\it 변환 캐시\/}(TC)를 유지한다. (사실 대개 그런 캐시가 두 개 있는데,
@^translation caches@>
@^TC@>
하나는 명령을 위한 것이고 하나는 데이터를 위한 것이다.) TC에는 64비트 변환 열쇠
$$\beginword
&\field{1.2}1&&\field22&&\field{44.8}{61-s}&&\field3{s-13}&&\field{10}{10}&&
 \field33\cr
\noalign{\hrule}
\\&0&\\&$i$&\\&$v$&\\&0&\\&$n$&\\&0&\\\cr
\noalign{\hrule}\endword$$
들의 집합이, 세그먼트 $i$의 페이지 $v$에 대한 PTE의 관련 부분을 나타내는 38비트 변환
$$\beginword
&\field{32}{48-s}&&\field3{s-13}&&\field33\cr
\noalign{\hrule}
\\&$a$&\\&0&\\&$p$&\\\cr
\noalign{\hrule}\endword$$
과 짝지어 들어 있다. 서로 다른 프로세스는 대개 $n$의 값이 다르고, $s$의 값도 다를 수 있다. 운영체제는
페이지를 할당하거나, 옮기거나, 스왑하거나, 재활용할 때 그런 캐시를 최신으로 유지하는 방법이 필요하다.
운영체제는 어느 페이지를 최근에 썼는지도 알고 싶어 한다. 명령 \.{LDVTS}가 그런 연산을 돕는다.
@^protection bits@>
@^permission bits@>

\bull\<LDVTS \$X,\$Y,\0 `가상 변환 상태 적재'.\>
@.LDVTS@>
합 $\rY+\rZ$나 $\rY+\zz$는 가장 오른쪽 세 비트가 0이 아니어도 된다는 것 말고는 위와 같은 변환 캐시
열쇠의 꼴이어야 한다. 이 열쇠가 TC에 있으면, 가장 오른쪽 세 비트가 현재 보호 코드~$p$를 대신한다.
그러나 그렇게 해서 $p$가 0이 되면 그 열쇠를 TC에서 없앤다. 레지스터~X는 열쇠가 어느 변환 캐시에도
없었으면 0으로, 명령을 위한 TC에 있었으면 1로, 데이터를 위한 TC에 있었으면 2로, 둘 다에 있었으면~3으로
정한다. 이 명령은 운영체제만 쓴다. (TC의 변경은 곧바로 일어나지 않는다. 그래서 {\mc MMIX-PIPE}에서
다루듯이, 알맞은 때에 \.{SYNC}나 \.{SYNCD}를 하거나 둘 다 해야 한다.)

@ 앞에서 말했듯이 값싼 판의 \MMIX는 물리 주소를 하드웨어 대신 소프트웨어로 계산할 수도 있다. 운영체제가
@^emulation@>
@^rV@>
페이지 테이블 계산을 해야 할 때 강제 트랩을 쓰는 것이다. 다음은 그런 목적에 쓸 수 있는 코드다. 이
@^operating system@>
코드는 레지스터~rYY에 음이 아닌 가상 주소가 주어졌을 때 변환 과정을 정확히 정의한다. 먼저 rV의 필드들을
@^virtual addresses@>
@^physical addresses@>
@^rV@>
@^PTE@>
@^PTP@>
@^segments@>
풀고, PTE와 PTP의 관련 기준 주소들을 계산해야 한다.
$$\vbox{\halign{&\tt#\hfil\ \cr
&GET &virt,rYY\cr
&GET &\$7,rV         &\% \$7=(가상 변환 레지스터)\cr
&SRU    &\$1,virt,61    &\% \$1=i (가상 주소의 세그먼트 번호)\cr
&SLU    &\$1,\$1,2       \cr
&NEG    &\$1,52,\$1      &\% \$1=52-4i\cr
&SRU    &\$1,\$7,\$1      \cr
&SLU    &\$2,\$1,4       \cr
&SETL   &\$0,\#f000     \cr
&AND    &\$1,\$1,\$0      &\% \$1=b[i]<<12\cr
&AND    &\$2,\$2,\$0      &\% \$2=b[i+1]<<12\cr
&SLU    &\$3,\$7,24      \cr
&SRU    &\$3,\$3,37      \cr
&SLU    &\$3,\$3,13      &\% \$3=(rV의 r 필드)\cr
&ORH   &\$3,\#8000     &\% \$3을 물리 주소로 만든다\cr
&2ADDU   &base,\$1,\$3    &\% base=첫 페이지 테이블의 주소\cr
&2ADDU   &limit,\$2,\$3   &\% limit=마지막 페이지 테이블 다음의 주소\cr
&SRU    &s,\$7,40      \cr
&AND    &s,s,\#ff       &\% s=(rV의 s 필드)\cr
&CMP    &\$0,s,13       \cr
&BN     &\$0,Fail       &\% s는 13 이상이어야 한다\cr
&CMP    &\$0,s,49       \cr
&BNN    &\$0,Fail       &\% s는 48 이하여야 한다\cr
&SETH  &mask,\#8000 \cr
&ORL   &mask,\#1ff8&\% mask=(부호 비트와 n 필드)\cr 
&ORH   &\$7,\#8000      &\% 아래의 PTP 검증을 위해 부호 비트를 켠다\cr
&ANDNH &virt,\#e000     &\% 세그먼트 번호를 지운다\cr
&SRU    &\$0,virt,s     &\% \$0=a4a3a2a1a0 (virt의 페이지 번호)\cr
&ZSZ   &\$1,\$0,1       &\% \$1=[페이지 번호가 0이다]\cr
&ADD    &limit,limit,\$1&\% 페이지 번호가 0이면 limit를 늘린다\cr
&SETL&\$6,\#3ff\cr
}}$$
루틴의 다음 부분은 페이지 번호 $(a_4a_3a_2a_1a_0)_{1024}$의 ``자릿수''를 오른쪽에서 왼쪽으로
찾는다.
$$
\vcenter{\halign{&\tt#\hfil\ \cr
&CMP &\$5,base,limit\cr
&SRU &\$1,\$0,10\cr
&PBZ &\$1,1F\cr
&AND &\$0,\$0,\$6\cr
&INCL&base,\#2000\cr}}
\vcenter{\halign{&\tt#\hfil\ \cr
&CMP &\$5,base,limit\cr
&SRU &\$2,\$1,10\cr
&PBZ &\$2,2F\cr
&AND &\$1,\$1,\$6\cr
&INCL&base,\#2000\cr}}
\vcenter{\halign{&\tt#\hfil\ \cr
&CMP &\$5,base,limit\cr
&SRU &\$3,\$2,10\cr
&PBZ &\$3,3F\cr
&AND &\$2,\$2,\$6\cr
&INCL&base,\#2000\cr}}
\vcenter{\halign{&\tt#\hfil\ \cr
&CMP &\$5,base,limit\cr
&SRU &\$4,\$3,10\cr
&PBZ &\$4,4F\cr
&AND &\$3,\$3,\$6\cr
&INCL&base,\#2000\cr}}
$$
\filbreak
그다음 과정은 PTP들을 거쳐 거꾸로 폭포처럼 내려온다.
$$
\vcenter{\halign{&\tt#\hfil\ \cr
&CMP &\$5,base,limit\cr
&BNN &\$5,Fail\cr
&8ADDU&\$6,\$4,base\cr
&LDO  &base,\$6,0\cr
&XOR &\$6,base,\$7\cr
&AND &\$6,\$6,mask\cr
&BNZ &\$6,Fail\cr}}
\vcenter{\halign{&\tt#\hfil\ \cr
&ANDNL&base,\#1fff\cr
4H&BNN &\$5,Fail\cr
&8ADDU &\$6,\$3,base\cr
&LDO  &base,\$6,0\cr
&XOR &\$6,base,\$7\cr
&AND &\$6,\$6,mask\cr
&BNZ &\$6,Fail\cr}}
\vcenter{\halign{&\tt#\hfil\ \cr
&ANDNL&base,\#1fff\cr
3H&BNN &\$5,Fail\cr
&8ADDU &\$6,\$2,base\cr
&LDO  &base,\$6,0\cr
&XOR &\$6,base,\$7\cr
&AND &\$6,\$6,mask\cr
&BNZ &\$6,Fail\cr}}
\vcenter{\halign{&\tt#\hfil\ \cr
&ANDNL&base,\#1fff\cr
2H&BNN &\$5,Fail\cr
&8ADDU &\$6,\$1,base\cr
&LDO  &base,\$6,0\cr
&XOR &\$6,base,\$7\cr
&AND &\$6,\$6,mask\cr
&BNZ &\$6,Fail\cr}}
$$
마지막으로 PTE를 얻어서 기계에 전한다. 오류를 알아냈으면 변환을 0으로 정한다. 사실 허가 비트가 0인
변환이면 어느 것이든 효과가 같을 것이다.
$$\chardef\_=`\_
\vcenter{\halign{&\tt#\hfil\ \cr
&ANDNL &base,\#1fff &\% PTP의 아래 13비트를 없앤다\cr
1H &BNN &\$5,Fail\cr
&8ADDU &\$6,\$0,base \cr
&LDO  &base,\$6,0  &\% base=PTE\cr
&XOR &\$6,base,\$7\cr
&ANDN&\$6,\$6,\#7\cr
&SLU &\$6,\$6,51\cr
&PBZ &\$6,Ready &\% n이 맞으면 분기한다\cr
Fail&SETL &base,0 &\% 오류가 나면 PTE는 0이다\cr
Ready&PUT&rZZ,base\cr
&LDO&\$255,IntMask &\% rK의 바라는 설정을 적재한다\cr
&RESUME&1 &\% 이제 기계가 변환을 소화한다\cr}}$$
이 프로그램의 적재와 저장은 모두 음수 가상 주소를 다룬다. 이렇게 하면 사실상 메모리 사상이 꺼지고,
사용자는 페이지 테이블에 접근할 수 없다.

이 프로그램은 rXX의 ropcode가 3이라고 가정한다(가상 변환이 필요해서 강제 트랩이 일어났을 때는
그렇다).
@^ropcodes@>
@^translation caches@>

가상 페이지에서 물리 페이지로 가는 변환이 실제로 PTP와 PTE의 규칙을 따를 필요는 없다. 특별한 요구가
있는 운영체제는 다른 어떤 사상으로든 바꿀 수 있다. 그러나 사람들은 대개 되도록 서로 다른 구현 사이에
호환성이 있기를 바란다. \MMIX가 rV에서 정말로 필요로 하는 것은 페이지 크기를 정하는 $s$~필드와, 한
프로세스의 TC 항목이 다른 프로세스의 TC 항목과 헷갈리지 않게 하는 $n$~필드뿐이다.

@* 완전한 명령 집합. 이제 \MMIX의 특수 레지스터를 모두 설명했다---하나만 빼고. 특수한 {\it 실패
위치 레지스터\/}~rF는 패리티 오류나 다른 메모리 결함이 일어나면 물리 메모리 주소로 정해진다. (그런
@^rF@>
결함이 드러나기 훨씬 전에 그 오류로 이어진 명령은 아마 오래전에 지나갔을 것이다. 이를테면 기계는 새
데이터를 넣을 자리를 만들려고 캐시의 옛 데이터를 쓰려던 참일 수도 있다. 그래서 대개 현재 가상 프로그램
위치~rW와 메모리 오류의 물리 위치 사이에는 아무 관계가 없다. 그러나 오류의 물리 위치를 알면 하드웨어를
고칠 때나 운영체제가 부팅할 때 여전히 쓸모 있을 수 있다.)

@ 명령 하나가 더 쓸모 있는 것으로 드러난다.

\bull\<SWYM X,Y,Z `기계를 헤아려 주기'.\>
이 명령은 필요하면 디스크 드라이브, 팬, 자기 테이프 드라이브, 레이저 프린터, 스캐너, 그 밖에 \MMIX에
연결된 모든 기계 장비에 기름을 친다. 필드 X, Y,~Z는 무시한다.
@.SWYM@>

명령 \.{SWYM}은 원래 \MMIX의 명령 목록에 들어갔다. 사람이 좋은 근육을 유지하려고 이따금 헤엄을
치거나(swim) 다른 운동을 해야 하듯이, 기계도 이따금 제 모양을 지키려면 기름이 필요하기 때문이다.
그러나 사실 \.{SWYM}은 ``무연산'', 곧 아무것도 하지 않는 명령으로 드러났다. 우리의 가상 기계를 만드는
@^no-op@>
가상의 제조사들이, 오늘날의 컴퓨터 장비는 이미 기름칠이 잘 되어 있고 영구히 쓰도록 봉해져 있다고
지적했기 때문이다. 그래도 무연산 명령은 소프트웨어가 하드웨어에 신호를 보내는 좋은 방법이 된다.
이를테면 유행어를 두루 갖춘 슈퍼스칼라 슈퍼파이프라인 기계에서 명령을 발행하는 방식을 스케줄하는 일
따위에 쓸 수 있다. 소프트웨어 프로그램은 기호 디버거 같은 다른 프로그램과 통신하는 데에도 무연산을
쓸 수 있다.

강제 트랩이 가상 주소~rYY의 변환~rZZ를 계산할 때, rXX의 연산 코드가 \.{SWYM}이면 \<RESUME 1 의
ropcode~3은 $\rm(rYY,rZZ)$를 명령을 위한 TC에 넣는다. 그렇지 않으면 $\rm(rYY,rZZ)$를 데이터를 위한
TC에 넣는다.
@^ropcodes@>
@^translation caches@>
@.RESUME@>
@^virtual address emulation@>
@^emulation@>

@ \MMIX\ 프로그램의 실행 시간은 기술의 변화에 크게 달려 있다. \MMIX는 신화 속의 기계이지만, 그 신화
속의 하드웨어에는 싸고 느린 판도 있고 비싼 고성능 모델도 있다. 실행 시간의 세부는 대개 가상 메모리를
구현하는 데 쓸 수 있는 주 메모리의 양과, 캐시와 다른 버퍼의 크기 같은 것에 달려 있다.

실용적인 목적으로는, 주 메모리가 넉넉한 고성능 기계에서 얻을 대략의 실행 시간에 바탕을 두고 연산마다
고정된 비용을 매겨서 \MMIX\ 프로그램의 실행 시간을 흔히 만족스럽게 어림할 수 있다. 그래서 그렇게
하기로 한다. 연산마다 정수 개의~$\upsilon$가 걸린다고 가정한다. 여기서 $\upsilon$(``웁스''라고
읽는다)는 파이프라인 구현의 클럭 사이클 시간을 나타내는 단위다. 단위 $\upsilon$의 값은 해마다 줄겠지만,
@^mems@>
@^oops@>
크누스는 계속 그것을 $\upsilon$라고 부르겠다고 한다. 실행 시간은 프로그램이 쓰는 메모리 참조, 곧
{\it 멤\/}(mem)의 수에도 달려 있다. 이것은 적재와 저장 명령의 수다. 이를테면 \.{LDO}(옥타 적재)
명령마다 $\mu+\upsilon$가 든다고 가정한다. 여기서 $\mu$는 메모리 참조 하나의 평균 비용이다.
프로그램의 전체 실행 시간은 이를테면 $35\mu+1000\upsilon$라고 알릴 수 있는데, 멤 35개와 웁스 1000개라는
뜻이다. 비율 $\mu/\upsilon$는 시간이 갈수록 커질 것이므로, 멤 세기가 점점 더 중요해질 것이다.
[{\sl The Stanford GraphBase\/}(New York:\ ACM Press, 1994)의 멤에 관한 논의를 보라.]
@^oops@>
@^running times, approximate@>

정수 덧셈, 뺄셈, 비교는 모두 $1\upsilon$만 걸린다. 명령 \.{SET}, \.{GET}, \.{PUT}, \.{SYNC},
\.{SWYM}도 그렇고, 비트 단위 논리 연산, 자리 옮김, 상대 점프, 비교, 조건부 대입, 올바르게 예측한
일어나지 않는 분기나 일어나는 그럴듯한 분기도 그렇다. 잘못 예측한 분기나 그럴듯한 분기에는
$3\upsilon$가 들고, \.{POP}과 \.{GO} 명령도 그렇다. 정수 곱셈은 $10\upsilon$가 걸리고, 정수 나눗셈은
$60\upsilon$나 나간다.
@.MUL@>
@.DIV@>
@.TRAP@>
@.TRIP@>
@.RESUME@>
명령 \.{TRAP}, \.{TRIP}, \.{RESUME}에는 저마다 $5\upsilon$가 든다.

대부분의 부동소수점 연산은 명목상 실행 시간이 $4\upsilon$이지만, 비교 연산자 \.{FCMP}, \.{FEQL},
\.{FUN}에는 $1\upsilon$만 필요하다. 명령 \.{FDIV}와 \.{FSQRT}에는 저마다 $40\upsilon$가 든다. 부동소수점
@.FDIV@>
@.FSQRT@>
@.FREM@>
계산의 실제 실행 시간은 피연산자에 따라 달라진다. 이를테면 기계는 비정규수인 입력이나 출력마다
$\upsilon$가 하나 더 필요할 수도 있고, 트립이 허용되어 있으면 크게 느려질 수도 있다. 명령 \.{FREM}에는
대개 $(3+\delta)\upsilon$가 들 수 있다. 여기서 $\delta$는 첫째 피연산자의 지수가 둘째 피연산자의
지수보다 큰 양이다(이 양이 음수이면 0). 부동소수점 연산은 피연산자 가운데 적어도 하나가 0이나 무한대나
NaN이면 $1\upsilon$만 걸릴 수도 있다. 그러나 실행 시간을 어림짐작할 때는 모두 이 문단의 처음에 말한
고정된 값을 쓴다. 어림을 터무니없이 빗나가게 하지 않으면서 되도록 단순하게 유지하고 싶기 때문이다.

적재와 저장 연산은 모두 $\mu+\upsilon$가 든다고 가정한다. 다만 \.{CSWAP}에는 $2\mu+2\upsilon$가 든다.
(이것은 \Hex{98}--\Hex{9F}와 \Hex{B8}--\Hex{BF}를 빼고, \Hex8, \Hex9, \Hex{A}, \Hex{B}로 시작하는 모든
OP~코드에 적용된다. 비용 $\mu$는 평균 메모리 비용을 어림하는 대략의 장치일 뿐이므로, 규칙을 단순하게
유지하는 것이 가장 좋다.) 명령 \.{SAVE}와 \.{UNSAVE}에는 $20\mu+\upsilon$를 매긴다.
@.CSWAP@>
@.SAVE@>
@.UNSAVE@>

물론 이 수들이 아주 거칠다는 것을 기억해야 한다. 메모리에서 명령을 가져오는 비용은 넣지 않았다. 더욱이
정수 곱셈이나 나눗셈은, 다른 수들을 계산하는 동안 그 결과가 필요하지 않으면 실제 비용이 $1\upsilon$뿐일
수도 있다. 정말로 현실적이리라고 기대할 수 있는 것은 자세한 시뮬레이션뿐이다.

@ \MMIX에 연산 코드가 넉넉히 많다고 생각한다면, 옳다. 이제 그것들을 모두 설명했다. 다음은 그 수치
값을 보여 주는 표다.
\def\oddline#1{\cr
  \noalign{\nointerlineskip}
  \omit&\setbox0=\hbox{\lower 2.3pt\hbox{\Hex{#1x}}}\smash{\box0}&
  \multispan{17}\hrulefill&
  \setbox0=\hbox{\lower 2.3pt\hbox{\Hex{#1x}}}\smash{\box0}\cr
  \noalign{\nointerlineskip}}
\def\evenline{\cr\noalign{\hrule}}
\def\chartstrut{\lower4.5pt\vbox to14pt{}}
\def\beginchart{$$\tt\halign to\hsize\bgroup
    \chartstrut##\tabskip0pt plus10pt&
    &\hfil##\hfil&\vrule##\cr
    \lower6.5pt\null
    &&&\Hex0&&\Hex1&&\Hex2&&\Hex3&&\Hex4&&\Hex 5&&\Hex 6&&\Hex 7&\evenline}
\def\endchart{\raise11.5pt\null&&&\Hex 8&&\Hex 9&&\Hex A&&\Hex B&
  &\Hex C&&\Hex D&&\Hex E&&\Hex F&\cr\egroup$$}
\def\\#1[#2]{\multispan3\hfil#1[#2]\hfil}
\beginchart
&&&TRAP&&FCMP&&FUN&&FEQL&&FADD&&FIX&&FSUB&&FIXU&\oddline 0
&&&\\FLOT[I]&&\\FLOTU[I]&&\\SFLOT[I]&&\\SFLOTU[I]&\evenline
&&&FMUL&&FCMPE&&FUNE&&FEQLE&&FDIV&&FSQRT&&FREM&&FINT&\oddline 1
&&&\\MUL[I]&&\\MULU[I]&&\\DIV[I]&&\\DIVU[I]&\evenline
&&&\\ADD[I]&&\\ADDU[I]&&\\SUB[I]&&\\SUBU[I]&\oddline 2
&&&\\2ADDU[I]&&\\4ADDU[I]&&\\8ADDU[I]&&\\16ADDU[I]&\evenline
&&&\\CMP[I]&&\\CMPU[I]&&\\NEG[I]&&\\NEGU[I]&\oddline 3
&&&\\SL[I]&&\\SLU[I]&&\\SR[I]&&\\SRU[I]&\evenline
&&&\\BN[B]&&\\BZ[B]&&\\BP[B]&&\\BOD[B]&\oddline 4
&&&\\BNN[B]&&\\BNZ[B]&&\\BNP[B]&&\\BEV[B]&\evenline
&&&\\PBN[B]&&\\PBZ[B]&&\\PBP[B]&&\\PBOD[B]&\oddline 5
&&&\\PBNN[B]&&\\PBNZ[B]&&\\PBNP[B]&&\\PBEV[B]&\evenline
&&&\\CSN[I]&&\\CSZ[I]&&\\CSP[I]&&\\CSOD[I]&\oddline 6
&&&\\CSNN[I]&&\\CSNZ[I]&&\\CSNP[I]&&\\CSEV[I]&\evenline
&&&\\ZSN[I]&&\\ZSZ[I]&&\\ZSP[I]&&\\ZSOD[I]&\oddline 7
&&&\\ZSNN[I]&&\\ZSNZ[I]&&\\ZSNP[I]&&\\ZSEV[I]&\evenline
&&&\\LDB[I]&&\\LDBU[I]&&\\LDW[I]&&\\LDWU[I]&\oddline 8
&&&\\LDT[I]&&\\LDTU[I]&&\\LDO[I]&&\\LDOU[I]&\evenline
&&&\\LDSF[I]&&\\LDHT[I]&&\\CSWAP[I]&&\\LDUNC[I]&\oddline 9
&&&\\LDVTS[I]&&\\PRELD[I]&&\\PREGO[I]&&\\GO[I]&\evenline
&&&\\STB[I]&&\\STBU[I]&&\\STW[I]&&\\STWU[I]&\oddline A
&&&\\STT[I]&&\\STTU[I]&&\\STO[I]&&\\STOU[I]&\evenline
&&&\\STSF[I]&&\\STHT[I]&&\\STCO[I]&&\\STUNC[I]&\oddline B
&&&\\SYNCD[I]&&\\PREST[I]&&\\SYNCID[I]&&\\PUSHGO[I]&\evenline
&&&\\OR[I]&&\\ORN[I]&&\\NOR[I]&&\\XOR[I]&\oddline C
&&&\\AND[I]&&\\ANDN[I]&&\\NAND[I]&&\\NXOR[I]&\evenline
&&&\\BDIF[I]&&\\WDIF[I]&&\\TDIF[I]&&\\ODIF[I]&\oddline D
&&&\\MUX[I]&&\\SADD[I]&&\\MOR[I]&&\\MXOR[I]&\evenline
&&&SETH&&SETMH&&SETML&&SETL&&INCH&&INCMH&&INCML&&INCL&\oddline E
&&&ORH&&ORMH&&ORML&&ORL&&ANDNH&&ANDNMH&&ANDNML&&ANDNL&\evenline
&&&\\JMP[B]&&\\PUSHJ[B]&&\\GETA[B]&&\\PUT[I]&\oddline F
&&&POP&&RESUME&&SAVE&&UNSAVE&&SYNC&&SWYM&&GET&&TRIP&\evenline
\endchart
표기 `\.{[I]}'는 Z 필드가 레지스터 번호 대신 상수를 나타내는 ``즉시'' 변형이 있는 연산을 가리킨다.
마찬가지로 `\.{[B]}'는 상대 주소의 변위가 음수인 ``뒤로'' 변형이 있는 연산을 가리킨다. \MMIX\ 명령을
기호 꼴로 보여 주어야 하는 시뮬레이터와 다른 프로그램들은 연산 코드 \Hex{20}이 \.{ADD}이고 연산 코드
\Hex{21}이~\.{ADDI}라고 말하며, \Hex{F2}가 \.{PUSHJ}이고 \Hex{F3}이~\.{PUSHJB}라고 말할 것이다. 그러나
\MMIX\ 어셈블러는 \.{ADDI}나 \.{PUSHJB}가 아니라 \.{ADD}와 \.{PUSHJ} 꼴만 쓴다.

이 표를 읽으려면 위, 아래, 왼쪽, 오른쪽의 십육진 숫자를 쓰면 된다. 이를테면 십육진 표기로 연산 코드
\.{A9}는 \Hex{Ax} 행의 아래 부분과 \Hex1/\Hex9 열에 나타나는데, 그것은 \.{STTI}, 곧 `store tetrabyte
immediate'(즉시 테트라바이트 저장)다.
@^OP codes, table@>

%이 표의 빈 자리는 정의되지 않은 연산 코드로, 앞으로의 확장을 위해 남겨 둔 것이다.
%사용자 프로그램에서 그런 연산 코드를 가진 명령을 만나면 (이를테면 \.Y 필드가 9보다 큰 \.{FIX}처럼)
%불법 명령으로 여겨,
%@^illegal instructions@>
%인터럽트를 일으킨다. 그런 명령은 \MMIX의 뒤의 판에서 정의될 수도 있는데, 그때 운영체제는
%뒤쪽 호환을 위해 아마 새 명령들을 에뮬레이트할 수 있을 것이다.
%@^version number@>

\def\\#1{\leavevmode\hbox{\it#1\/\kern.05em}} % 식별자는 이탤릭으로

@* 찾아보기. (절 번호로 가리킨다. 쪽 번호가 아니다.)
